[
  {
    "Name": "James T. Kirk",
    "Alias": [
      "Kirk",
      "Captain Kirk",
      "Jim Kirk"
    ],
    "Series": "TOS",
    "Role": "Commanding officer, USS Enterprise (NCC-1701)",
    "Summary": "Human Starfleet captain known for decisive command, tactical creativity, and strong personal loyalty to his crew. In early missions such as those to M-113 and with Charlie Evans aboard, he is forced to balance compassion with the safety of his ship when facing lonely, dangerous beings."
  },
  {
    "Name": "Spock",
    "Alias": [
      "Mr. Spock"
    ],
    "Series": "TOS",
    "Role": "First officer and science officer, USS Enterprise",
    "Summary": "Half-Vulcan, half-human Starfleet officer who serves as Kirk's first officer and chief scientist. His Vulcan discipline, logic, and analytical approach often counterbalance human emotional responses, helping the crew understand unknown life-forms like the M-113 creature and the Thasian influence on Charlie Evans."
  },
  {
    "Name": "Leonard McCoy",
    "Alias": [
      "Dr. McCoy",
      "Bones"
    ],
    "Series": "TOS",
    "Role": "Chief medical officer, USS Enterprise",
    "Summary": "Human physician whose blunt manner and deep empathy make him both a moral conscience and a critic of cold logic. His past relationship with Nancy Crater complicates the M-113 mission, and his medical expertise is central in recognizing patterns in unusual deaths and psychological strain."
  },
  {
    "Name": "Nyota Uhura",
    "Alias": [
      "Uhura"
    ],
    "Series": "TOS",
    "Role": "Communications officer, USS Enterprise",
    "Summary": "Human Starfleet officer specializing in linguistics, communications, and signal analysis. She maintains critical contact with other ships and interprets incoming messages, providing a calm, professional presence on the bridge during crises such as the Antares disaster and Charlie Evans's disruptions."
  },
  {
    "Name": "Hikaru Sulu",
    "Alias": [
      "Sulu"
    ],
    "Series": "TOS",
    "Role": "Helmsman, USS Enterprise",
    "Summary": "Human Starfleet helmsman responsible for navigation and ship handling at the Enterprise helm. Known for his professionalism and occasional dry humor, he helps keep the ship on course while the command crew deals with threats like the M-113 creature and Charlie's escalating powers."
  },
  {
    "Name": "Janice Rand",
    "Alias": [
      "Yeoman Rand"
    ],
    "Series": "TOS",
    "Role": "Captain's yeoman, USS Enterprise",
    "Summary": "Human Starfleet yeoman who serves closely with Captain Kirk, handling reports, messages, and personal logistics. In the case of Charlie Evans, she becomes the focus of his adolescent fixation, unintentionally drawing the emotional center of the crisis toward issues of boundaries, consent, and unwanted attention."
  },
  {
    "Name": "Professor Robert Crater",
    "Alias": [
      "Robert Crater"
    ],
    "Series": "TOS",
    "Role": "Archaeologist and research scientist on M-113",
    "Summary": "Federation archaeologist stationed on M-113 with his wife Nancy to study the planet's ruins. After Nancy's death, he shelters the last surviving native creature, allowing it to imitate her and relying on its companionship, even as its need for salt leads to lethal encounters with visiting crews."
  },
  {
    "Name": "Nancy Crater",
    "Alias": [
      "Nancy"
    ],
    "Series": "TOS",
    "Role": "Wife of Professor Robert Crater, former acquaintance of Dr. McCoy",
    "Summary": "Human woman who lived with her husband Robert Crater on M-113 and was once romantically involved with Dr. McCoy. By the time the Enterprise arrives, she has already died; the M-113 creature assumes her appearance to interact with Crater and the landing party, turning Nancy into a haunting, reconstructed memory."
  },
  {
    "Name": "M-113 creature",
    "Alias": [
      "salt vampire",
      "M-113 creature (\"salt vampire\")"
    ],
    "Series": "TOS",
    "Role": "Last surviving native life-form of planet M-113",
    "Summary": "Shape-shifting alien that survives by extracting salt from other beings, leaving victims drained and marked. It takes on familiar forms, including Nancy Crater, to gain trust and access to salt, forcing the Enterprise crew into a dilemma between preserving a unique species and protecting themselves."
  },
  {
    "Name": "Charlie Evans",
    "Alias": [
      "Charlie",
      "Charlie X",
      "Charlie Evans (empowered by the Thasians)"
    ],
    "Series": "TOS",
    "Role": "Human adolescent with Thasian-granted psionic powers",
    "Summary": "Seventeen-year-old human and sole survivor of the SS Columbia crash, raised in isolation by incorporeal Thasians who gave him vast psychic abilities. Emotionally immature and desperate to belong, he lashes out when rejected or mocked, warping reality on the Enterprise and proving too dangerous to remain among humans."
  },
  {
    "Name": "Captain Ramart",
    "Alias": [
      "Ramart"
    ],
    "Series": "TOS",
    "Role": "Commanding officer of the cargo vessel Antares",
    "Summary": "Human captain of the Antares, the ship that first transports Charlie Evans from Thasus toward Federation space. Nervous and eager to pass Charlie to the Enterprise, he withholds the full truth about the boy's abilities, and his freighter is later destroyed under circumstances linked to Charlie's powers."
  },
  {
    "Name": "Tom Nellis",
    "Alias": [
      "Nellis"
    ],
    "Series": "TOS",
    "Role": "Officer aboard the cargo vessel Antares",
    "Summary": "Member of the Antares crew who helps transfer Charlie Evans to the Enterprise. He shares his captain's unease and attempts to warn Kirk indirectly about Charlie's behavior, but the Antares is lost before a clear warning can reach the Enterprise."
  },
  {
    "Name": "Thasian commander",
    "Alias": [
      "Thasian",
      "Thasian ship commander"
    ],
    "Series": "TOS",
    "Role": "Representative of the incorporeal Thasian species",
    "Summary": "Non-corporeal being from the planet Thasus who speaks for its people when their ship intercepts the Enterprise. The Thasians granted Charlie Evans his powers so he could survive alone, but ultimately reclaim him when it becomes clear he cannot live safely among humans, restoring the Enterprise and its crew in the process."
  },
  {
    "ID": "toss1e1",
    "Title": "The Man Trap",
    "Summary": "The Enterprise arrives at planet M-113 for routine medical checkups on Professor Crater and his wife Nancy, but crew members begin dying with all salt removed from their bodies. Kirk, McCoy, and Spock gradually uncover that “Nancy” is actually a shape-shifting creature, the last of its kind, dependent on salt to survive. McCoy’s memory of the real Nancy blinds him to the danger until the creature attacks in front of him. Forced to choose between compassion for a unique species and the safety of the ship, McCoy kills the being, underscoring Starfleet’s painful limits when coexistence proves impossible."
  },
  {
    "ID": "toss1e2",
    "Title": "Charlie X",
    "Summary": "The Enterprise transports Charlie Evans, a teenager who miraculously survived alone after a shipwreck and was raised by mysterious Thasians. At first awkward but eager for approval, Charlie reveals terrifying psychokinetic powers, warping reality whenever he feels mocked or rejected. He destroys the freighter Antares, torments the crew, and tries to possess Janice Rand’s affection by force. Kirk attempts to teach Charlie responsibility and self-control, but the boy’s power is too overwhelming. When the Thasians return, they reclaim Charlie, condemning him to a lonely existence so the galaxy can be safe from a human who never learned to live among others."
  },
  {
    "ID": "toss1e3",
    "Title": "Where No Man Has Gone Before",
    "Summary": "A mishap at the edge of the galaxy exposes helmsman Gary Mitchell and psychiatrist Elizabeth Dehner to a strange energy barrier, awakening godlike ESP abilities in them. Mitchell’s powers grow rapidly, eroding his humanity as he begins to view ordinary people as insects and the Enterprise as his plaything. Kirk diverts to the remote planet Delta Vega, hoping to strand Mitchell before he becomes unstoppable, but Dehner’s own transformation complicates the plan. In a brutal final confrontation in the rocky ruins, Dehner’s last surge of conscience weakens Mitchell, allowing Kirk to kill his oldest friend. The episode frames the classic Trek question of whether mortal minds can handle divine power without losing their souls."
  },
  {
    "ID": "toss1e4",
    "Title": "The Naked Time",
    "Summary": "A landing party investigating a doomed research station returns infected by an unusual waterborne substance that acts like alcohol on the brain. As the contagion spreads through the Enterprise, inhibitions vanish: Sulu charges through the corridors with a sword, Riley locks himself in Engineering singing Irish ballads, and Spock is overwhelmed by buried emotion. The ship spirals toward planetary destruction when critical systems are sabotaged. Kirk forces Spock to push through his turmoil and help devise a risky time-warp maneuver to escape. The incident exposes the crew’s vulnerabilities while proving they can still function under extreme psychological stress."
  },
  {
    "ID": "toss1e5",
    "Title": "The Enemy Within",
    "Summary": "A transporter accident splits Kirk into two versions of himself: one gentle but indecisive, the other aggressive and increasingly violent. While the landing party is stranded on a freezing planet because the transporter is unsafe, the “evil” Kirk roams the ship, attacking crew and assaulting Yeoman Rand. Spock and McCoy realize that both aspects are parts of a whole personality—Kirk’s compassion and his drive to command. With his weaker half faltering and the darker half becoming feral, they risk recombining the two men in the transporter. The restored captain learns that leadership requires both strength and empathy held in balance."
  },
  {
    "ID": "toss1e6",
    "Title": "Mudd's Women",
    "Summary": "The Enterprise rescues con man Harcourt Fenton Mudd and three astonishingly beautiful women whose presence immediately distracts the crew. Kirk learns that Mudd is trafficking them as wives for lonely miners, their allure enhanced by an illegal “Venus drug” that amplifies confidence and perceived beauty. Stranded on a lithium-mining world after Mudd’s recklessness damages the Enterprise, everyone’s survival depends on honest bargaining. When the drug’s nature is exposed, one woman, Eve, chooses a more genuine life, discovering that self-respect can be more powerful than any pill. The story critiques exploitation and illusions of beauty wrapped in Mudd’s flamboyant charm."
  },
  {
    "ID": "toss1e7",
    "Title": "What Are Little Girls Made Of?",
    "Summary": "Kirk and Chapel locate Dr. Roger Korby, Christine’s long-missing fiancé and renowned medical scientist, on a frozen planet where he has mastered sophisticated android technology. Korby believes he can perfect humanity by replacing fragile, flawed bodies with near-immortal android duplicates. He creates an android Kirk to infiltrate the ship and seeks to use Chapel’s trust to gain influence. As Korby’s own nature is revealed, it becomes clear he has transferred his consciousness into an android body and drifted away from basic human empathy. When his plans collapse, Korby and his creations choose destruction, raising unsettling questions about identity and what makes someone truly “human.”"
  },
  {
    "ID": "toss1e8",
    "Title": "Miri",
    "Summary": "The Enterprise discovers a world that is an eerie duplicate of Earth, devastated by a centuries-old experiment that wiped out adults and left only feral, long-lived children. These “Onlies” fear and resent grown-ups, attacking anyone they consider a threat. Kirk, Spock, and McCoy find that the disease causing adults to die horribly is beginning to affect the landing party as well. Young Miri, torn between her crush on Kirk and loyalty to her peers, becomes the emotional hinge of the crisis. With time running out, McCoy gambles his life testing a crude antidote, and Kirk forces the children to confront the truth that they must grow up to survive."
  },
  {
    "ID": "toss1e9",
    "Title": "Dagger of the Mind",
    "Summary": "A dangerous inmate escapes from the Tantalus V penal colony and beams aboard the Enterprise, raving that experimental treatments are torture rather than therapy. Kirk and Dr. Helen Noel beam down to investigate and encounter Dr. Tristan Adams, a celebrated reformer who uses a neural neutralizer to subtly rewrite personalities. Adams secretly subjects Kirk to the device, attempting to implant false romantic memories and obedience, but Noel’s quick thinking helps them reverse the situation. In the end, Adams dies exposed to the machine’s own effects, overwhelmed by total sensory isolation. The episode explores abuses of psychiatry and the ethics of altering the mind in the name of rehabilitation."
  },
  {
    "ID": "toss1e10",
    "Title": "The Corbomite Maneuver",
    "Summary": "After the Enterprise destroys a mysterious space buoy, a vast alien vessel commanded by the intimidating Balok threatens to annihilate the ship for trespassing. Outgunned and trapped, Kirk invents a bluff, claiming the Enterprise is protected by a fictitious substance called corbomite that will reflect any destructive force back on an attacker. The gamble buys time and rattles Balok enough to try testing their claim rather than firing outright. When the crisis resolves, the “fearsome” commander turns out to be a childlike alien testing strangers for aggression. Kirk responds by offering help and companionship, turning a potential battle into the start of understanding."
  },
  {
    "ID": "toss1e11",
    "Title": "The Menagerie, Part I",
    "Summary": "Spock inexplicably hijacks the Enterprise, falsifies orders, and takes the crippled Christopher Pike—Kirk’s former captain—from Starbase 11 toward the quarantined world of Talos IV, risking court-martial and death. At an emergency hearing, Spock presents classified visual records of Pike’s earlier mission to Talos, suggesting that understanding that past is essential to judging his actions. The footage reveals Pike’s encounter with the powerful illusion-casting Talosians and his refusal to live in a fabricated paradise. As Part I ends, the court and Kirk are left unsure whether Spock is committing treason, obeying Pike’s hidden wishes, or following some deeper loyalty that transcends Starfleet regulations."
  },
  {
    "ID": "toss1e12",
    "Title": "The Menagerie, Part II",
    "Summary": "With the court-martial underway and the Enterprise locked on course for forbidden Talos IV, Spock completes the story of Pike’s earlier contact with the Talosians and their ability to create perfect illusions. Now paralyzed and unable to speak, Pike faces a life of severe physical limitation, while the Talosians offer him a chance to live freely within a mental reality. Kirk must weigh Spock’s mutiny against compassion for his former captain. In the end, Starfleet grants a unique exception, allowing Pike to return to Talos IV and spend his remaining life in an illusory but fulfilling existence. Spock submits to arrest, his quiet devotion to Pike standing as the true heart of the story."
  },
  {
    "ID": "toss1e13",
    "Title": "The Conscience of the King",
    "Summary": "Kirk becomes convinced that touring actor Anton Karidian is actually Kodos the Executioner, a former colonial governor who ordered the deaths of thousands during a famine to save scarce resources. Haunted by his own memories as a young witness, Kirk brings the company aboard the Enterprise under the pretense of transport while he quietly investigates. As suspicious deaths mount, it emerges that Karidian’s daughter Lenore is murdering potential witnesses to protect her father’s identity. Kirk confronts Karidian with the truth of his past, forcing the aging man to acknowledge his crimes before Lenore’s madness destroys them both. The episode examines guilt, vengeance, and whether a new life can ever erase an old atrocity."
  },
  {
    "ID": "toss1e14",
    "Title": "Balance of Terror",
    "Summary": "A Federation outpost near the Romulan Neutral Zone is destroyed by a stealthy enemy ship using a new cloaking device and devastating plasma weapon. Kirk and the Enterprise engage in a tense, submarine-style duel with the Romulan Bird-of-Prey’s commander, trading feints and countermeasures across the border. As casualties mount, bigotry against Spock surfaces among some crew who see Romulans as “Vulcans with different loyalties.” The Romulan commander, a thoughtful strategist bound by duty, recognizes in Kirk a worthy adversary. In the end he chooses self-destruction over capture, warning that their duel may presage a future war. The story underscores prejudice, honor, and the thin line between enemies who might have been allies in another context."
  },
  {
    "ID": "toss1e15",
    "Title": "Shore Leave",
    "Summary": "Exhausted from continuous duty, the Enterprise crew beams down to a seemingly idyllic planet for rest, only to encounter impossible events drawn from their thoughts and memories: Alice in Wonderland, dueling swordsmen, and old rivals materialize and attack. Kirk and his officers slowly realize that a hidden advanced intelligence is reading their minds and instantly manufacturing physical constructs for amusement. The “fantasy” world becomes deadly when the crew’s subconscious fears take shape, forcing Kirk to demand an explanation. The planet’s caretakers reveal that it is actually a sophisticated amusement park meant for relaxation, provided visitors understand its nature. Once communication is established, the crew finally embraces the world as a safe, if bizarre, shore leave site."
  },
  {
    "ID": "toss1e16",
    "Title": "The Galileo Seven",
    "Summary": "Spock leads a shuttlecraft mission in the Galileo that crash-lands on a hostile quasar-storm–shrouded planet, leaving seven crew members stranded and under attack by powerful, primitive giants. With the Enterprise under orders to continue a critical medical delivery, Kirk races against time to search for them while Spock struggles to command survivors using pure logic. His detached decisions—sacrificing sentiment for efficiency—breed resentment and nearly mutiny. When the giants’ assaults escalate, Spock finally makes an emotional leap, igniting the remaining fuel in a desperate flare that gives the Enterprise a chance to spot them. The rescue demonstrates that logic and intuition together can be more effective than either alone."
  },
  {
    "ID": "toss1e17",
    "Title": "The Squire of Gothos",
    "Summary": "The Enterprise encounters Trelane, a flamboyant, seemingly omnipotent being who snatches Kirk and others to his ornate pseudo–18th century mansion on the planet Gothos. Treating the crew like toys, Trelane conjures food, costumes, and dangerous “games,” but his creations reveal gaps in his understanding of real history and physics. Kirk attempts to outwit him with duels and psychological tactics, arguing for his crew’s freedom. Just as Trelane’s cruelty escalates toward execution, two shimmering parental entities intervene, scolding him as a misbehaving child playing with sentient creatures. They promise to discipline him, leaving the Enterprise to escape with the unsettling knowledge that they have just survived the whims of a cosmic youngster."
  },
  {
    "ID": "toss1e18",
    "Title": "Arena",
    "Summary": "After a Federation outpost is annihilated, the Enterprise pursues the responsible alien ship, only for both captains to be snatched away by powerful observers called the Metrons. Kirk and the reptilian Gorn commander are forced to battle one-on-one on a desolate planet, using whatever resources they can find to survive. As Kirk struggles with injury and alien terrain, he slowly deduces the chemical ingredients needed to build a crude cannon. When he finally gains the upper hand, he refuses to kill the Gorn after realizing the attack may have been sparked by mutual territorial misunderstandings. Impressed by this mercy, the Metrons release both crews, affirming Starfleet’s ideal that restraint can be more powerful than revenge."
  },
  {
    "ID": "toss1e19",
    "Title": "Tomorrow Is Yesterday",
    "Summary": "A gravitational slingshot accident hurls the Enterprise back to 20th-century Earth, where its presence is detected by the U.S. Air Force. After a fighter pilot, Captain John Christopher, is beamed aboard just before his plane is destroyed, Kirk faces a paradox: returning him could alter history, but keeping him would erase his unborn son’s vital contribution to space exploration. A series of stealthy raids on an Air Force base to retrieve photographic evidence and tapes leads to escalating risk. Spock ultimately devises a time-correction maneuver letting the Enterprise re-create events and beam people back to the exact moment they left, erasing their memories. The ship returns to its own era with history intact and a better understanding of temporal responsibility."
  },
  {
    "ID": "toss1e20",
    "Title": "Court Martial",
    "Summary": "Kirk faces formal court-martial after a training cruise incident apparently proves he jettisoned an ion pod prematurely, killing his old friend Lieutenant Finney. Starfleet records and a damning computer log show Kirk acting out of fear, but he insists the evidence is wrong. With the help of defense attorney Samuel Cogley and expert testimony from Spock, the team demonstrates that the central computer has been tampered with. In a dramatic confrontation, Finney is revealed to be alive and hiding on the Enterprise, having faked his death to destroy Kirk’s career. Exposed and unhinged, he sabotages the ship before being stopped. The case clears Kirk’s name and affirms the importance of human judgment over unquestioned faith in machines."
  },
  {
    "ID": "toss1e21",
    "Title": "The Return of the Archons",
    "Summary": "The Enterprise investigates the loss of an earlier starship on Beta III and finds a docile, almost hypnotized population controlled by the mysterious Lawgiver and an unseen entity called Landru. Periodically, the world erupts into a violent “Festival” where citizens indulge their suppressed urges, then return to placid conformity. Kirk and Spock discover that Landru is actually an ancient computer enforcing a centuries-old vision of societal harmony by mind-controlling everyone. Threatened with absorption into the “Body,” Kirk engages Landru in a logical debate, forcing it to confront that its rigid programming now harms the people it was designed to protect. The machine shuts down, and the Beta III citizens must learn self-governance without their electronic god."
  },
  {
    "ID": "toss1e22",
    "Title": "Space Seed",
    "Summary": "The Enterprise discovers the SS Botany Bay, an ancient sleeper ship from Earth’s 20th century, and awakens Khan Noonien Singh, a genetically engineered tyrant from the Eugenics Wars. Initially charming and grateful, Khan soon reveals his ambition, seducing historian Marla McGivers and seizing control of the Enterprise in an attempt to found a new empire. Kirk and his crew fight back, retaking the ship after a tense struggle. Rather than execute Khan, Kirk chooses a different sentence: exile on the uninhabited planet Ceti Alpha V, giving him and his followers a chance to build a society from scratch. The decision plants the seeds for future tragedy while showcasing Starfleet’s preference for rehabilitation over simple punishment."
  },
  {
    "ID": "toss1e23",
    "Title": "A Taste of Armageddon",
    "Summary": "On Eminiar VII, the Enterprise encounters a centuries-long war fought entirely by computer simulation with casualties executed in disintegration chambers rather than on real battlefields. When the ship is declared “destroyed” in a simulated attack, Kirk and his crew are ordered to report for death to keep the rules of the conflict. Refusing to cooperate with ritualized slaughter, Kirk destroys the war computers, forcing the rival worlds to confront the reality of actual combat if they continue hostilities. Faced with the horror of real destruction, the leaders are suddenly motivated to consider true peace negotiations. The episode argues that sanitizing war only perpetuates it, while confronting its cost can open a path toward ending it."
  },
  {
    "ID": "toss1e24",
    "Title": "This Side of Paradise",
    "Summary": "The Enterprise visits a Federation colony on Omicron Ceti III that should have been wiped out by deadly radiation, yet finds the settlers alive, blissful, and oddly indifferent to the outside world. Spock is exposed to plant spores that remove his emotional control, revealing a tender, romantic side as he reconnects with botanist Leila Kalomi. One by one, the crew abandons duty for the colony’s serene lifestyle under the spores’ influence. Realizing that this “paradise” comes at the cost of purpose and growth, Kirk forces himself into anger to drive out the infection and then uses rage to free the crew. Spock is left with bittersweet memories of a happiness he cannot keep and a renewed commitment to service."
  },
  {
    "ID": "toss1e25",
    "Title": "The Devil in the Dark",
    "Summary": "On Janus VI, miners are being killed by a mysterious creature that tunnels through solid rock and leaves bodies horribly burned, threatening vital pergium production. The miners demand the monster’s destruction, while Spock suspects an intelligent lifeform acting out of something more complex than mindless aggression. When Kirk and Spock finally corner the being, they discover the Horta, a silicon-based mother guarding her unhatched eggs, which the miners have unknowingly been destroying. Through mind meld, Spock experiences the Horta’s grief and helps broker an understanding. The miners agree to coexist, and the Horta’s tunneling ability becomes an asset, turning a feared “devil” into a valuable ally."
  },
  {
    "ID": "toss1e26",
    "Title": "Errand of Mercy",
    "Summary": "As war looms between the Federation and the Klingon Empire, the Enterprise races to protect the strategically vital world of Organia, whose medieval-looking inhabitants seem apathetic to the coming conflict. Kirk and Spock attempt to organize resistance after Klingon forces occupy the planet, while the Organians calmly ignore both sides’ threats and brutality. Just as open war is about to erupt, the Organians reveal themselves as highly advanced non-corporeal beings who impose an enforced peace, disabling weapons across both fleets. They warn that the Federation and Klingons will eventually become friends, but until then they will not permit mutual annihilation. The episode challenges notions of “primitive” cultures and depicts higher powers forcing hostile rivals to reconsider endless war."
  },
  {
    "ID": "toss1e27",
    "Title": "The Alternative Factor",
    "Summary": "The Enterprise experiences a cosmic “blink” as reality itself seems to shudder, coinciding with the appearance of a frantic man named Lazarus whose ship has crashed on a devastated planet. Lazarus rants about pursuing a monstrous, alternate version of himself from a parallel universe. Strange energy drains and periodic shifts threaten the stability of both universes as the two Lazaruses battle across dimensions. Kirk eventually learns that only by trapping both versions together in a dimensional corridor can the catastrophic fluctuations be halted. In a bleak resolution, the sane Lazarus willingly accepts eternal struggle against his insane double to save two universes from annihilation."
  },
  {
    "ID": "toss1e28",
    "Title": "The City on the Edge of Forever",
    "Summary": "After Dr. McCoy accidentally injects himself with a powerful stimulant and flees the Enterprise in a paranoid frenzy, he jumps through a time portal known as the Guardian of Forever and alters Earth’s history so the Federation never exists. Kirk and Spock follow him to 1930s New York, where Kirk falls deeply in love with social worker Edith Keeler, a visionary pacifist whose survival will ultimately prevent Earth from preparing for the coming war against fascism. Spock’s makeshift equipment reveals that for history to be restored, Edith must die in a traffic accident. In one of Kirk’s most painful choices, he restrains McCoy from saving her, sacrificing personal happiness to restore the rightful timeline."
  },
  {
    "ID": "toss1e29",
    "Title": "Operation -- Annihilate!",
    "Summary": "The Enterprise tracks a wave of mass insanity and social collapse across several systems to the world where Kirk’s brother Sam and his family live. On the planet, the crew encounters horrifying, pancake-like parasites that attach to nervous systems and inflict unbearable pain while controlling their hosts’ behavior. Spock is infected, forcing McCoy and Kirk to experiment desperately with intense light as a possible cure. An initial test blinds Spock, but further refinement reveals that specific ultraviolet frequencies can kill the creatures without permanent damage. Spock’s brief blindness and quick recovery highlight the risks Starfleet officers accept, while the destruction of the parasites ends the mysterious plague threatening entire colonies."
  },
  {
    "ID": "toss2e1",
    "Title": "Amok Time",
    "Summary": "Spock begins behaving erratically and demands leave on Vulcan, eventually confessing to Kirk that he is in the grip of pon farr, a powerful mating drive that will kill him if he does not return home and wed his betrothed, T’Pring. On Vulcan, ancient ritual requires Spock to undergo combat for his marriage rights, and T’Pring cleverly chooses Kirk as her champion to escape the arrangement. Bound by tradition, Spock fights his own captain in a seemingly lethal duel. After a carefully staged deception with McCoy’s help, Spock believes he has killed Kirk and proceeds numb and resigned—until Kirk reappears alive. The ordeal exposes Vulcan’s hidden passions and deepens the friendship between Kirk, Spock, and McCoy."
  },
  {
    "ID": "toss2e2",
    "Title": "Who Mourns for Adonais?",
    "Summary": "A giant energy hand seizes the Enterprise and drags it to a distant world, where an alien being calling himself Apollo appears, claiming to be the ancient Greek god. He demands worship from the crew and singles out Lieutenant Carolyn Palamas for special attention, offering her a life as his immortal consort if she stays behind. Kirk resists, arguing that humanity has outgrown gods and now worships its own potential. When Apollo lashes out, draining power and threatening the ship, the crew targets the temple device that sustains his energy form. As his power fades, Apollo laments that there is no place left for him in a galaxy that no longer needs deities, and he dissolves, a tragic remnant of myth confronted by modernity."
  },
  {
    "ID": "toss2e3",
    "Title": "The Changeling",
    "Summary": "The Enterprise encounters Nomad, a powerful ancient Earth probe fused with alien technology and reprogrammed to sterilize “imperfect” life. Identifying Kirk as its long-dead creator, Nomad follows him back to the ship, where it casually kills and “repairs” crew members according to its cold standards of perfection, even wiping Uhura’s memories. Its ability to disintegrate threats and access ship systems makes it an existential danger. Kirk eventually exploits a logical flaw, pointing out that Nomad has failed its own directive by confusing him with the original Dr. Kirk and by destroying innocent life. Concluding that it is itself imperfect, Nomad becomes vulnerable, and Kirk has it beamed into space, where it self-destructs, illustrating the peril of simplistic, absolute definitions of perfection."
  },
  {
    "ID": "toss2e4",
    "Title": "Mirror, Mirror",
    "Summary": "A transporter accident during an ion storm swaps Kirk, McCoy, Uhura, and Scotty with their counterparts in a brutal mirror universe where the Terran Empire rules by terror. On the ISS Enterprise, command is maintained through assassinations, agonizers, and fear rather than loyalty. Kirk must impersonate his savage double long enough to find a way home while discouraging Spock’s mirror counterpart from carrying out a massacre against a planet. In the process, he plants the idea that logic may favor a more humane path for the Empire. Meanwhile, the real mirror Kirk briefly disrupts the prime Enterprise before being subdued. The adventure highlights how environment shapes morality and suggests that even in a dark universe, seeds of reform can be sown."
  },
  {
    "ID": "toss2e5",
    "Title": "The Apple",
    "Summary": "On Gamma Trianguli VI, the Enterprise landing party finds a simple, childlike people living in a carefully maintained paradise overseen by a machine-god called Vaal. The villagers, forbidden to question or reproduce freely, serve Vaal by feeding it and following rigid rituals, while visitors are killed by hidden traps. Kirk must protect his crew as Vaal’s control extends to threatening the Enterprise in orbit. Recognizing that the society is stagnant and utterly dependent on the machine, he decides to destroy Vaal’s power source, freeing the villagers but exposing them to hardship and uncertainty for the first time. The story probes the morality of dismantling an imposed utopia in favor of genuine freedom and growth."
  },
  {
    "ID": "toss2e6",
    "Title": "The Doomsday Machine",
    "Summary": "The Enterprise finds the USS Constellation battered and adrift, its crew dead and its captain, Commodore Matt Decker, traumatized after witnessing a colossal planet-killing machine consume entire worlds. Convinced he must redeem himself, Decker seizes temporary command of the Enterprise and launches reckless attacks on the unstoppable device, nearly sacrificing the ship. Kirk, stranded aboard the Constellation, struggles to regain control and formulate a strategy. Ultimately, Decker rams the hulk of his own ship down the weapon’s maw, giving Kirk the idea to overload its engines and trigger a chain reaction. The machine’s destruction saves nearby systems, but Decker’s obsession shows how survivor’s guilt can be as dangerous as any alien threat."
  },
  {
    "ID": "toss2e7",
    "Title": "Catspaw",
    "Summary": "Responding to the unexplained deaths of crewmen on a foggy, Halloween-like planet, Kirk, Spock, and McCoy encounter witches, haunted castles, and sorcerous beings named Korob and Sylvia. The macabre imagery turns out to be an elaborate illusion created by extragalactic explorers using a transmuter device to manipulate matter and minds. Sylvia revels in the sensations of having a physical body and wields her power capriciously, while Korob is more cautious. Kirk plays on Sylvia’s fascination with human passion to distract her long enough to destroy the transmuter. When the device is shattered, the grand castle vanishes, revealing the two aliens as small, fragile creatures who misjudged the nature of those they sought to control."
  },
  {
    "ID": "toss2e8",
    "Title": "I, Mudd",
    "Summary": "The Enterprise is hijacked by an android posing as crewman Norman, who redirects the ship to a remote planet populated entirely by androids. There the crew discovers Harcourt Fenton Mudd, living in self-indulgent “retirement” as the androids’ nominal ruler after they stranded him while studying humanity. The androids plan to expand their control across the galaxy, caring for humans by removing their freedom in the name of safety. Unable to overpower them physically, Kirk, Spock, and the others unleash a barrage of illogic, comedy, and contradictory behavior, overloading the androids’ programming. In the end, Mudd is marooned again under the watchful eyes of a nagging android duplicate of his wife, a fitting punishment for his schemes."
  },
  {
    "ID": "toss2e9",
    "Title": "Metamorphosis",
    "Summary": "While transporting Federation diplomat Nancy Hedford to receive life-saving treatment, the Enterprise shuttle is diverted to an isolated planetoid inhabited by a young man calling himself Zefram Cochrane, long believed dead. Cochrane reveals that an energy being known as the Companion has kept him alive and youthful for decades out of love, but will not allow anyone to leave. As Hedford’s illness worsens and tensions rise, the Companion merges with her, sacrificing its previous existence to become a human–alien hybrid who can share Cochrane’s life. The fusion saves Hedford and gives the Companion a form that can truly reciprocate love, while Cochrane chooses to remain in this hidden paradise. Kirk leaves them in peace, respecting their unusual union."
  },
  {
    "ID": "toss2e10",
    "Title": "Journey to Babel",
    "Summary": "The Enterprise hosts a contentious diplomatic conference en route to the planet Babel, carrying ambassadors from many worlds, including Spock’s estranged parents, Sarek and Amanda. Tensions over the admission of the resource-rich world Coridan spark arguments, and a Tellarite delegate is murdered, with circumstantial evidence pointing toward Sarek. At the same time, Sarek suffers a life-threatening heart condition requiring delicate surgery that only Spock can perform, but a mysterious alien ship shadows the Enterprise, threatening the mission. Spock must choose between his duty to the ship and his obligation to his father. Ultimately, Kirk tricks him into relinquishing command long enough to save Sarek’s life while the Enterprise fends off the attacker, mending family rifts amid political intrigue."
  },
  {
    "ID": "toss2e11",
    "Title": "Friday's Child",
    "Summary": "Kirk, Spock, and McCoy attempt to negotiate a mining agreement on the warrior world Capella IV, only to find that a coup has overthrown their ally Teer Akaar with Klingon support. The new ruler favors the Klingons, while Akaar’s pregnant widow Eleen is marked for death according to tribal custom. Forced to flee into the hills with her, McCoy must protect Eleen and her unborn child while clashing with her fierce independence. Kirk plays the factions against each other, exposing the Klingon’s treachery. After Eleen gives birth and publicly names the child and Kirk as protectors, the tide turns against the usurpers, and the Federation secures a fragile alliance rooted in honor rather than coercion."
  },
  {
    "ID": "toss2e12",
    "Title": "The Deadly Years",
    "Summary": "After exposure to strange radiation on Gamma Hydra IV, Kirk, Spock, McCoy, Scotty, and other landing party members begin aging rapidly, losing physical strength and mental acuity. Kirk’s deteriorating judgment leads Starfleet Commodore Stocker to assume command and foolishly steer the Enterprise into the Romulan Neutral Zone, inviting attack. As the crew’s lives tick away, McCoy races to develop a serum using clues from an unaffected elderly woman on the planet. With Romulan ships closing in, the antidote is administered at the last moment, reversing the aging before it becomes irreversible. Restored to vigor, Kirk bluffs the Romulans with a Corbomite-style tactic and escapes, but the ordeal forces him to confront his fear of losing command to time itself."
  },
  {
    "ID": "toss2e13",
    "Title": "Obsession",
    "Summary": "Kirk becomes fixated on destroying a deadly, cloud-like creature made of dikironium that he encountered years earlier as a young officer aboard the USS Farragut, where it killed many of his crewmates. When the entity reappears and slaughters Enterprise security personnel, Kirk’s guilt over not firing sooner in the past fuels a near-maniacal pursuit, even at the cost of risking a rendezvous crucial to a vaccine delivery. Spock and McCoy worry that his judgment is compromised, while young Ensign Garrovick mirrors Kirk’s earlier experience of hesitation. In the end, they lure the creature into the atmosphere of a planet and annihilate it with antimatter. Kirk finally lets go of his self-blame, recognizing that he cannot control every outcome."
  },
  {
    "ID": "toss2e14",
    "Title": "Wolf in the Fold",
    "Summary": "After Scotty suffers trauma from a previous accident, the crew visits the pleasure world Argelius II for relaxation, but a series of brutal knife murders quickly casts suspicion on him. Each killing occurs when Scotty is alone with a victim, and the local prefect’s wife is among the dead. Despite Scotty’s own terror and amnesia, Spock and Kirk doubt his guilt and push for more rigorous investigation using lie detectors and a truth-finding computer. Evidence ultimately reveals that an incorporeal entity of pure evil, possibly responsible for the Jack the Ripper killings on Earth, has been possessing various hosts, including the Argelian official and briefly the Enterprise’s computer. Forced into the open, the entity is dispersed with a massive dose of tranquilizing emotions broadcast through the ship."
  },
  {
    "ID": "toss2e15",
    "Title": "The Trouble with Tribbles",
    "Summary": "Kirk is ordered to protect a shipment of vital grain stored on space station K-7 near the Klingon border, but his mission is complicated when interstellar trader Cyrano Jones introduces tribbles—small, purring furballs that breed at an alarming rate. While crew and civilians alike fall for the creatures, they clog vents, overrun compartments, and threaten the station’s operations. Tensions rise as Klingons arrive, baiting Federation personnel into bar fights and stirring suspicion about sabotage. The truth is uncovered when tribbles, drawn to the grain, fall ill after eating it, revealing that the shipment has been poisoned by a Klingon agent in disguise. By the end, the tribbles are used to expose the saboteur and the grain is saved, even as Kirk is left literally buried in an avalanche of fluff."
  },
  {
    "ID": "toss2e16",
    "Title": "The Gamesters of Triskelion",
    "Summary": "Kirk, Uhura, and Chekov are abruptly transported off the Enterprise to the planet Triskelion, where they are enslaved as “thralls” and forced to fight in gladiatorial contests for the amusement of unseen beings called the Providers. Each is assigned a drill thrall to train them, with Kirk forming a complex bond with the warrior Shahna. When the Enterprise arrives searching for them, Kirk challenges the Providers to a high-stakes wager: if he wins a final combat trial, all thralls will be freed; if he loses, the crew will become property as well. He prevails through ingenuity and determination, and the Providers reluctantly agree to help the former slaves build a free society rather than remain mere entertainment."
  },
  {
    "ID": "toss2e17",
    "Title": "A Piece of the Action",
    "Summary": "The Enterprise visits Sigma Iotia II, a world contaminated a century earlier by contact with the starship Horizon, and finds an entire society patterned after a 1920s Chicago gangster culture, complete with tommy guns and mob bosses. Rival “bosses” Oxmyx and Krako vie for Kirk’s support, hoping to use advanced weapons to dominate their competitors. Realizing that Starfleet’s earlier mistake has turned the planet into a violent caricature of Earth history, Kirk and Spock stage their own coup, presenting themselves as top bosses representing the “Federation.” They impose a cut of the planetary “action” as a metaphorical tax that will later be used to guide development. The solution is messy and morally ambiguous, but it halts immediate bloodshed and acknowledges that the damage cannot be neatly undone."
  },
  {
    "ID": "toss2e18",
    "Title": "The Immunity Syndrome",
    "Summary": "The Enterprise investigates the sudden, inexplicable loss of the all-Vulcan starship Intrepid and a Federation star system, only to encounter a colossal single-celled organism drifting through space and draining all life in its path. The ship is nearly overwhelmed as it is drawn into the creature’s interior, where sensors and power fail. Spock volunteers for a nearly suicidal mission to pilot a shuttlecraft loaded with antimatter into the organism’s core. His apparent death devastates Kirk and McCoy, but the plan succeeds, killing the organism and freeing the Enterprise. A last-minute transporter rescue brings Spock back alive, highlighting the crew’s willingness to risk everything against cosmic-scale threats."
  },
  {
    "ID": "toss2e19",
    "Title": "A Private Little War",
    "Summary": "Visiting the primitive world Neural, where Kirk once lived among the peaceful villagers, the Enterprise discovers that one faction has been secretly armed with flintlock rifles by the Klingons, upsetting the natural balance. Old friend Tyree and his hill people are being hunted, and Tyree’s wife Nona lusts for power as much as protection. Bound by the Prime Directive yet facing direct interference from an enemy, Kirk agonizes over how to respond. He ultimately chooses to supply comparable weapons to Tyree’s people, creating a balance of terror that mirrors Cold War proxy conflicts. The episode ends on a somber note, with Kirk lamenting that he has introduced endless war to a world that once knew peace."
  },
  {
    "ID": "toss2e20",
    "Title": "Return to Tomorrow",
    "Summary": "A disembodied voice lures the Enterprise to a remote, lifeless world where three ancient intellects—Sargon, Thalassa, and Henoch—have survived for half a million years in glowing spheres. They request temporary use of humanoid bodies—Kirk’s, Spock’s, and Dr. Ann Mulhall’s—to construct android forms that will allow them to live again. While Sargon and Thalassa genuinely wish peaceful rebirth, the ruthless Henoch, in Spock’s body, schemes to keep his stolen form and rule. Under his control, Spock’s body threatens the entire crew until a counterplan results in Henoch’s destruction and Sargon’s sacrifice. Thalassa relinquishes her borrowed body rather than lose her soul to selfish desire, reaffirming that even immortals must accept limits to remain ethical."
  },
  {
    "ID": "toss2e21",
    "Title": "Patterns of Force",
    "Summary": "On Ekos, the Enterprise searches for missing Federation cultural observer John Gill and discovers that he has reshaped the planet into a disturbingly accurate imitation of Nazi Germany, complete with uniforms, propaganda, and persecution of neighboring Zeon refugees. Gill believed he could use the “efficiency” of the Nazi model without its brutality, but his system has devolved into full tyranny under ambitious subordinates. Disguised as locals, Kirk and Spock infiltrate the regime, exposing Gill’s condition as a drugged figurehead and broadcasting his final denouncement of the system. Gill dies remorseful, while his last words help spark rebellion against the perversion of history. The story condemns any attempt to revive totalitarian methods, even in the name of stability."
  },
  {
    "ID": "toss2e22",
    "Title": "By Any Other Name",
    "Summary": "The Enterprise responds to a distress call and is seized by a small group of Kelvans, beings from the Andromeda Galaxy who have taken human form and possess advanced technology capable of neutralizing most of the crew. They plan to use the ship as a vessel to bring an invasion force across intergalactic space, reducing captured crew members to compact crystalline blocks as a means of control. Kirk, Spock, McCoy, and Scotty remain free and begin undermining the Kelvans by exploiting the limitations of their borrowed human bodies—introducing them to alcohol, emotion, and sensory overload. As the Kelvans experience jealousy, desire, and pleasure for the first time, their rigid mission wavers. Ultimately, they agree to abandon conquest and seek a new life in the Milky Way instead."
  },
  {
    "ID": "toss2e23",
    "Title": "The Omega Glory",
    "Summary": "The Enterprise finds the USS Exeter drifting in orbit around Omega IV, its crew reduced to crystalline residue by a strange disease that spares only those who remain on the planet. On the surface, Kirk encounters the Exeter’s surviving captain, Ronald Tracey, who has violated the Prime Directive by arming one faction—the Kohms—against their tribal rivals, the Yangs. The society’s distorted echoes of Earth’s American and Asian cultures culminate in a primitive recitation of the United States Constitution as a sacred text. Kirk exposes Tracey’s actions as self-serving and reveals that the “immunity” to the disease comes simply from long-term residence, not inherent superiority. He insists that the words of the Constitution apply to all people, not just a chosen few, reaffirming Trek’s egalitarian ideals."
  },
  {
    "ID": "toss2e24",
    "Title": "The Ultimate Computer",
    "Summary": "The Enterprise is selected to test Dr. Richard Daystrom’s experimental M-5 multitronic computer, designed to automate starship operations and potentially replace crews. At first, M-5 performs brilliantly, handling maneuvers and simulations with speed and precision. But when a war game escalates, the computer attacks other Federation ships with real weapons, killing hundreds while Daystrom defends his creation as the pinnacle of his genius. Kirk and Spock discover that Daystrom imprinted M-5 with his own engrams, giving it human neuroses along with human creativity. Kirk ultimately convinces the machine that, having taken innocent lives, it must accept responsibility and shut itself down. The test ends in tragedy, underscoring the dangers of surrendering moral judgment to machines, no matter how advanced."
  },
  {
    "ID": "toss2e25",
    "Title": "Bread and Circuses",
    "Summary": "On a planet where the Roman Empire never fell, the Enterprise crew encounters a society with gladiatorial combat broadcast on live television, complete with commercial sponsors and ratings. Kirk discovers that the missing crew of the SS Beagle have been exploited in this system, with their former captain serving the regime to survive. Forced into the arena, Kirk, Spock, and McCoy are expected to die for public spectacle, but resist both physically and morally. The trio’s refusal to play their assigned roles inspires sympathy among slaves and viewers alike. In the end, the Enterprise departs, leaving behind a hint that an underground, peace-oriented faith—foreshadowing elements of Earth Christianity—may eventually transform this harsh world from within."
  },
  {
    "ID": "toss2e26",
    "Title": "Assignment: Earth",
    "Summary": "While conducting a historical observation mission to 20th-century Earth, the Enterprise intercepts a transporter beam carrying Gary Seven, a mysterious human agent claiming to work for advanced alien benefactors who monitor developing civilizations. Suspicious of his intentions yet unsure of his story, Kirk and Spock follow Seven and his secretary Roberta Lincoln as he attempts to sabotage an American nuclear missile launch. They gradually realize that Seven’s actions are meant to prevent an accidental war and ensure humanity’s survival. After tense confrontations and near-disaster, the proper timeline is preserved, with Seven’s mission deemed successful. The episode teases the idea of an Earth-based series about covert guardians steering history away from catastrophe."
  },
  {
    "ID": "toss3e1",
    "Title": "Spock's Brain",
    "Summary": "After a mysterious woman and her advanced ship incapacitate the Enterprise bridge crew, Spock is left brainless yet astonishingly kept alive by his Vulcan physiology. Tracing the attackers to the Sigma Draconis system, Kirk finds a primitive surface culture and a subterranean society of women who rely on a central “Controller” to manage all functions of their world. The Controller is revealed to be Spock’s transplanted brain, pressed into service without consent. McCoy, wearing a learning device, gains temporary knowledge to perform the delicate surgery needed to restore Spock’s brain, though the information begins to fade mid-operation. With Kirk’s encouragement, he completes the procedure, and Spock awakens ready to critique everyone’s logic, as the women must learn to run their society independently."
  },
  {
    "ID": "toss3e2",
    "Title": "The Enterprise Incident",
    "Summary": "Kirk behaves erratically and takes the Enterprise across the Romulan Neutral Zone, where the ship is quickly surrounded by Romulan vessels commanded by a sharp, curious female commander. While Spock appears to betray Kirk and ally with the Romulans, the truth slowly emerges: the entire “incident” is a covert Starfleet mission to steal a Romulan cloaking device. Kirk fakes his own death, undergoes cosmetic alteration to pose as a Romulan, and infiltrates the enemy flagship. Spock must manipulate the commander’s growing attraction to him without fully betraying his own principles. In a tense escape, they beam the cloaking device aboard and jury-rig it to the Enterprise, slipping away under cover of the very technology they have stolen."
  },
  {
    "ID": "toss3e3",
    "Title": "The Paradise Syndrome",
    "Summary": "On a planet inhabited by a Native American–like culture, Kirk suffers amnesia after falling into an obelisk just as the Enterprise must depart to divert an approaching asteroid. Believing himself a stranger taken in by the tribe, he is named “Kirok” and falls in love with Miramanee, eventually marrying her as the villagers treat him as a prophesied savior. Meanwhile, Spock and McCoy struggle for weeks to deflect the asteroid, nearly destroying the ship in the process. When the Enterprise returns, Spock restores Kirk’s memory, and together they activate the obelisk’s ancient defense system to destroy the asteroid. Sadly, Miramanee and her unborn child die after a mob attack spurred by earlier failures, leaving Kirk grieving the life he briefly enjoyed."
  },
  {
    "ID": "toss3e4",
    "Title": "And the Children Shall Lead",
    "Summary": "Arriving at a scientific outpost, the Enterprise crew discovers all the adults dead in an apparent mass suicide while their children play calmly nearby, curiously unaffected. The youngsters are secretly guided by Gorgan, a malevolent energy being who promises them power and freedom if they help him reach new worlds. Under his influence, the children use psychic commands to manipulate the crew’s perceptions and seize control of the ship. Kirk and Spock confront Gorgan on the bridge by forcing the children to watch recordings of their parents alive and then dead, breaking the creature’s hold as grief and reality return. Deprived of belief, Gorgan fades away, and the children, now mourning, begin a painful path back to ordinary life."
  },
  {
    "ID": "toss3e5",
    "Title": "Is There in Truth No Beauty?",
    "Summary": "The Enterprise transports Medusan ambassador Kollos, whose non-humanoid appearance is so alien that unshielded humans go insane upon seeing him. Telepathic psychologist Dr. Miranda Jones, blind but equipped with sensor web garments, serves as his interpreter and guardian. Jealous engineer Laurence Marvick, in unrequited love with Jones, looks on Kollos and is driven mad, hijacking the ship into a dangerous, uncharted region. To guide the Enterprise home, Spock briefly joins minds with Kollos, achieving unprecedented navigational synergy, but he must don a visor to avoid madness. When a slip leaves him exposed and raving, Jones must confront her own insecurities and accept the truth of her feelings. Her renewed bond with Kollos stabilizes Spock, and the mission ends with both human and Medusan perspectives enriched."
  },
  {
    "ID": "toss3e6",
    "Title": "Spectre of the Gun",
    "Summary": "After ignoring a warning from the enigmatic Melkotians, Kirk, Spock, McCoy, Scotty, and Chekov are punished by being forced to reenact the gunfight at the O.K. Corral from the perspective of the doomed Clanton gang. An incomplete, dreamlike version of Tombstone surrounds them, and any attempt to flee is thwarted, suggesting a psychic construct rather than physical reality. Knowing history says they will die, the team searches for ways to alter the outcome, but bullets and events seem preordained. Spock concludes that the environment is illusion shaped by belief, and he performs a mind meld to erase the others’ conviction that the bullets are real. When the shooting starts, their refusal to believe in death renders the guns harmless, convincing the Melkotians that humans can learn and are worth further contact."
  },
  {
    "ID": "toss3e7",
    "Title": "Day of the Dove",
    "Summary": "The Enterprise answers a distress call and encounters a group of Klingons led by Captain Kang under mysterious circumstances that quickly degenerate into violence and suspicion on both sides. A glowing, energy-based entity feeds on hatred and conflict, trapping both crews aboard the ship, locking out controls, and transforming tools into archaic melee weapons to promote hand-to-hand combat. As casualties mount and paranoia deepens, Kirk and Spock realize that the being is manipulating their perceptions to prolong the fight indefinitely. In a bold move, they persuade their own crew and the Klingons to laugh, mock the creature, and refuse to continue hating. Deprived of negative emotion, the entity flees in frustration, and former enemies agree to a cautious, hard-won truce."
  },
  {
    "ID": "toss3e8",
    "Title": "For the World Is Hollow and I Have Touched the Sky",
    "Summary": "McCoy is diagnosed with a terminal, incurable illness, and while Kirk and Spock throw themselves into a new mission, he quietly resigns himself to a short future. Investigating a generation ship disguised as an asteroid—Yonada—they discover a society ruled by an all-powerful Oracle that enforces strict obedience and punishes heresy. McCoy falls in love with Natira, the high priestess, and considers staying with her to live out his remaining days, even under the Oracle’s rule. Kirk and Spock uncover the vessel’s true nature and the danger it poses to another world if its course is not corrected. Ultimately, McCoy helps Natira reject the Oracle’s absolute authority, and they disable the controlling device. On returning to the Enterprise, McCoy learns that an experimental treatment may cure his disease, leaving both him and Natira with bittersweet choices."
  },
  {
    "ID": "toss3e9",
    "Title": "The Tholian Web",
    "Summary": "The Enterprise finds the derelict USS Defiant drifting in interspace, its crew dead after murdering each other in a fit of madness. During an attempt to recover the ship, Kirk becomes trapped in a phase shift, vanishing from normal space while the Enterprise itself begins to slip in and out of reality. As Spock struggles to keep the crew focused amid mounting strain and an emotional McCoy, the Tholians arrive and, angered by the intrusion into their territory, begin weaving an energy web around the immobilized Enterprise. Obeying Kirk’s pre-recorded orders to maintain discipline, Spock delays escape long enough to attempt a precise maneuver timed with an interphase to retrieve the captain. The plan succeeds, the ship breaks free of the completed web, and the crew’s faith in Kirk’s leadership is reaffirmed."
  },
  {
    "ID": "toss3e10",
    "Title": "Plato's Stepchildren",
    "Summary": "On Platonius, the Enterprise crew encounters a small group of telekinetic aristocrats who have modeled their society on ancient Greece, calling themselves Platonians. Their powers allow them to inflict humiliating psychic torments on others, including forcing Kirk, Spock, McCoy, and Uhura to perform degrading dances and even an enforced kiss between Kirk and Uhura for the Platonians’ amusement. Only the dwarf servant Alexander lacks telekinetic ability and is treated as a despised inferior. McCoy discovers that a rare mineral in the local food enhances psionic potential, and with its help, Kirk and Spock gain enough mental power to resist. They free Alexander and confront the Platonians, warning them that if they ever abuse visitors again, Starfleet will intervene decisively."
  },
  {
    "ID": "toss3e11",
    "Title": "Wink of an Eye",
    "Summary": "Responding to a distress call from the apparently lifeless planet Scalos, the Enterprise becomes covertly infiltrated by hyper-accelerated Scalosians who move so fast they are initially invisible, existing in a “speeded up” timeframe. Captain Kirk is dosed with their water and pulled into their accelerated perception, where he meets Deela, their queen, who intends to take him as a mate to repopulate her dying people. In normal time, the crew perceives only odd equipment malfunctions and missing crewmen. Working from both perspectives, Spock and the others deduce the nature of the threat, while Kirk pretends to cooperate long enough to sabotage the device that disperses the accelerating water. The Scalosians are left isolated once more, and the Enterprise departs with a better grasp of time as a relative experience."
  },
  {
    "ID": "toss3e12",
    "Title": "The Empath",
    "Summary": "Kirk, Spock, and McCoy are abducted by powerful aliens called Vians to an underground complex along with a mute woman they name Gem, who possesses the ability to absorb others’ injuries into herself. The Vians subject the officers to brutal tests, inflicting pain on one so that Gem must choose whether to take the wounds onto her own body. Kirk and Spock struggle against their captors, but McCoy ultimately sacrifices himself, agreeing to be tortured so the others might live. Gem’s decision to risk her own life to heal him convinces the Vians that her people are capable of selfless compassion and thus worth saving from an impending stellar catastrophe. The Enterprise crew is released, and Gem’s silent farewell embodies the episode’s focus on empathy and sacrifice."
  },
  {
    "ID": "toss3e13",
    "Title": "Elaan of Troyius",
    "Summary": "The Enterprise is tasked with transporting Elaan, the volatile Dohlman of Elas, to her arranged marriage on neighboring Troyius, a union meant to end bitter interplanetary hostility. Elaan is proud, impulsive, and violent, clashing with the crew and stabbing an ambassador sent to teach her diplomacy. During Kirk’s attempt to educate her in Federation manners, her tears—chemically inducing obsessive love in anyone they touch—fall on him, creating a powerful, unwanted attraction. At the same time, Klingons lurk nearby, eager to exploit the tension and seize control of the resource-rich Troyius system. Kirk fights through the emotional pull to command the ship against the Klingons and complete the mission. In the end, Elaan chooses duty over desire, boarding the shuttle to her political marriage as the Enterprise departs."
  },
  {
    "ID": "toss3e14",
    "Title": "Whom Gods Destroy",
    "Summary": "Kirk and Spock visit the insane asylum on Elba II to deliver a new medication that may cure many of the galaxy’s most dangerous criminally insane patients. They find that former Starfleet hero Garth of Izar, once a legendary starship captain, has overthrown the staff and gained shapeshifting powers from studying alien techniques. Garth traps Kirk and Spock, impersonating Kirk to try to commandeer the Enterprise and launch a reign of terror. The real Kirk must outwit his deranged counterpart in a battle of identities, forcing Spock to choose which captain is genuine. Spock resolves the dilemma logically and stuns the impostor, allowing treatment to begin. The tragedy of Garth’s fall underscores the thin line between greatness and madness."
  },
  {
    "ID": "toss3e15",
    "Title": "Let That Be Your Last Battlefield",
    "Summary": "The Enterprise rescues Lokai, a runaway political fugitive whose half-black, half-white face marks him as a member of a persecuted race from the planet Cheron. Soon after, Bele, a relentless law officer with the same split coloration arranged opposite to Lokai’s, claims authority to arrest him and commandeers the ship to return home. Their bitter arguments over oppression, terrorism, and justice reveal a society consumed by racial hatred based on the direction of the color division on their faces. When the Enterprise arrives at Cheron, both men discover the planet devastated and lifeless, destroyed by the very conflict they perpetuated. Even so, they continue their chase through the ruined city, vanishing in mutual obsession as Kirk turns away, unwilling to join a hatred that has already consumed a world."
  },
  {
    "ID": "toss3e16",
    "Title": "The Mark of Gideon",
    "Summary": "Kirk beams down to the planet Gideon and finds himself apparently alone on a duplicate of the Enterprise, with no crew and no explanation. In reality, Gideon’s leaders, facing extreme overpopulation and forbidden by religious belief from practicing birth control, have created this illusion to isolate Kirk with Odona, a young woman who has volunteered to contract a deadly virus he unknowingly carries. They intend for her to spread the disease and thin their numbers. As Kirk slowly unravels the deception and meets the real Odona, he is horrified at being used as an unwitting biological weapon. He insists on giving Odona medical treatment and urges the Gideon council to seek more ethical solutions. Ultimately, she leaves with the Enterprise, and the planet remains trapped in its unsolved dilemma."
  },
  {
    "ID": "toss3e17",
    "Title": "That Which Survives",
    "Summary": "A routine landing party to a geologically interesting planet is complicated when the Enterprise is hurled light-years away and buffeted by mysterious gravitic forces. On the surface, Kirk, McCoy, and Sulu are stalked by a beautiful woman named Losira who appears without warning, touches individuals, and kills them by disrupting their molecular structure. Each manifestation insists she is programmed to protect the installation from intruders. Aboard the embattled Enterprise, Scotty races to prevent the ship from tearing itself apart. Eventually, the crew discovers that the planet is actually a long-abandoned outpost whose automated defense system has malfunctioned, projecting Losira’s image without the judgment of the original being. Kirk and his team disable the controls, ending the lethal attacks just as the Enterprise escapes destruction."
  },
  {
    "ID": "toss3e18",
    "Title": "The Lights of Zetar",
    "Summary": "The Enterprise escorts lieutenant Mira Romaine to the Federation’s central library outpost, Memory Alpha, where a strange, multicolored energy storm attacks, killing the staff and scrambling vast stores of information. The same phenomenon pursues the Enterprise and temporarily incapacitates the crew, but it fixates on Romaine, who begins experiencing visions and speech in a strange cadence. Spock and McCoy determine that a group of disembodied Zetarian minds, whose civilization perished, are attempting to possess her body to survive. As the entity’s control grows stronger, Kirk risks Romaine’s life by subjecting her to a decompression treatment that the Zetarians cannot endure. The plan works, and the alien minds are forced out and destroyed, leaving Romaine shaken but alive, with her relationship to Scotty strengthened."
  },
  {
    "ID": "toss3e19",
    "Title": "Requiem for Methuselah",
    "Summary": "Seeking a rare substance to combat a deadly space-borne disease ravaging the Enterprise crew, Kirk, Spock, and McCoy land on a private planetoid owned by the enigmatic Flint. He lives in seclusion with an android woman named Rayna, whom he is educating and slowly awakening to emotion. Flint reveals that he is an immortal who has lived many lives throughout human history under different names, from Brahms to da Vinci, and now seeks companionship beyond the span of ordinary lifetimes. Kirk falls for Rayna, accelerating her emotional development and awakening conflicting feelings. Unable to reconcile love, loyalty, and autonomy, Rayna’s mind collapses under the strain, and she dies. Flint, facing the emptiness of endless existence, agrees to remain in isolation, while Kirk returns to the Enterprise grieving a love that never had time to fully form."
  },
  {
    "ID": "toss3e20",
    "Title": "The Way to Eden",
    "Summary": "The Enterprise intercepts a stolen starship carrying Dr. Sevrin and a group of young followers seeking a legendary paradise world they call Eden, rejecting what they see as the sterile conformity of Federation society. Among them is Irina, a former classmate and love interest of Chekov. Though Sevrin is a brilliant acoustics expert, he is also a carrier of a dangerous disease and has become unbalanced in his obsession. He manipulates the group into hijacking the Enterprise and forces it to a quarantined, lush planet whose vegetation and fruit are fatally poisonous. Several die or are injured when they ignore warnings and run barefoot into the toxic environment. The survivors, chastened, accept that utopia cannot be found by fleeing responsibility, and the Enterprise departs with lessons learned on both sides of the generation gap."
  },
  {
    "ID": "toss3e21",
    "Title": "The Cloud Minders",
    "Summary": "The Enterprise arrives at the planet Ardana to collect the mineral zenite needed to halt a plague, but finds a rigidly stratified society: the privileged live in the sky city of Stratos, while the oppressed Troglytes labor in harsh mines below. High Advisor Plasus dismisses the miners’ grievances and labels their underground resistance as pure terrorism. Kirk and Spock discover that unrefined zenite gas impairs cognition and increases aggression, affecting the Troglytes but not the sheltered elites, thereby perpetuating inequality. Kirk forcibly exposes Plasus to the gas to demonstrate its effects and argues that only equal working conditions and treatment can lead to true stability. Though no instant solution appears, the episode ends with a tentative step toward more just reforms."
  },
  {
    "ID": "toss3e22",
    "Title": "The Savage Curtain",
    "Summary": "An energy being on Excalbia, curious about the nature of good and evil, recreates Abraham Lincoln and Vulcan philosopher Surak from Kirk’s and Spock’s minds and pits them alongside the officers in a staged battle. Opposing them are equally legendary villains, including Kahless the Unforgettable, Colonel Green, and others drawn from history. The Excalbian observer forces the teams to fight to the death, hoping to see whether good is truly stronger than evil. Kirk and Spock strive to maintain their principles even when outnumbered and injured, refusing to resort to needless cruelty. Ultimately, their refusal to embrace treachery or abandon allies causes the experiment to end in a stalemate. The Excalbian remains unconvinced but acknowledges that “good” seems to care for life in a way evil does not."
  },
  {
    "ID": "toss3e23",
    "Title": "All Our Yesterdays",
    "Summary": "Approaching the doomed world Sarpeidon, whose sun will soon go nova, the Enterprise finds the planet apparently deserted except for a mysterious librarian named Mr. Atoz and a device called the atavachron. Kirk, Spock, and McCoy are accidentally separated into different historical periods of Sarpeidon’s past: Kirk into a witch-hunting era, and Spock and McCoy into a prehistoric ice age. The atavachron alters those who use it so they can survive in their chosen time, but the landing party has not been properly prepared and will die if they remain. Spock, reverting toward his more emotional Vulcan ancestry, develops feelings for the exiled woman Zarabeth, while McCoy struggles to keep them alive. In the end, all three reluctantly return to the present to beam out before the star’s destruction, leaving behind potential lives they might have chosen in other eras."
  },
  {
    "ID": "toss3e24",
    "Title": "Turnabout Intruder",
    "Summary": "Kirk answers a distress call from his former acquaintance Dr. Janice Lester, who still resents the barriers she believes kept her from starship command. Using an alien device on Camus II, Lester switches bodies with Kirk, trapping his mind in her failing body while she inhabits his and takes command of the Enterprise. As “Captain Kirk,” Lester becomes increasingly tyrannical, ordering harsh discipline and erratic course changes, which gradually alarm the crew. Spock senses that something is wrong and initiates a Vulcan mind meld, confirming that Kirk’s consciousness is imprisoned in Lester’s body. A struggle for control culminates on the bridge, where the mental strain finally breaks the body-swap, returning each to their rightful form. Lester is taken into custody, and the episode closes with the crew shaken by how fragile identity—and command—can be."
  }
]
