[
  {
    "ID": "toss1e1",
    "Series": "TOS",
    "Season": 1,
    "Episode": 1,
    "Title": "The Man Trap",
    "Summary": "On planet M-113, the Enterprise crew visits Dr. Robert and Nancy Crater for routine medical checkups, only to discover that a shapeshifting creature which needs salt to survive is hiding among them. The being assumes different appearances to lure victims, preying on crew members and leaving behind bodies drained of salt. Kirk and McCoy struggle to reconcile their friendship with the Craters and their responsibility to protect the crew, as it becomes clear Nancy was long ago replaced by the creature. In the end, McCoy is forced to shoot the being in Nancy’s form, underlining the tragedy of a unique lifeform destroyed because it could not coexist safely with humans."
  },
  {
    "ID": "toss1e2",
    "Series": "TOS",
    "Season": 1,
    "Episode": 2,
    "Title": "Charlie X",
    "Summary": "The Enterprise rescues Charlie Evans, a teenage castaway who survived alone for years after a transport crash and is now being delivered to a Federation colony. At first awkward and eager to please, Charlie quickly reveals godlike psychokinetic powers granted by the Thasians, casually erasing people and warping reality whenever he feels mocked or rejected. Kirk tries to teach him discipline, empathy, and the meaning of being part of a family or crew, but Charlie’s emotional immaturity and possessiveness spiral out of control. When he becomes too dangerous to restrain, the Thasians appear and reclaim him, leaving the Enterprise with the haunting knowledge that Charlie has essentially been sentenced to eternal isolation for the safety of others."
  },
  {
    "ID": "toss1e14",
    "Series": "TOS",
    "Season": 1,
    "Episode": 14,
    "Title": "Balance of Terror",
    "Summary": "When a series of outpost destructions along the Romulan Neutral Zone draws the Enterprise into a tense pursuit, Kirk finds himself in a cat‑and‑mouse duel with an unseen Romulan Bird‑of‑Prey. The battle plays out like a submarine engagement in space, with both commanders probing for weakness while trying to read the other’s intent through limited sensor data and intercepted communications. Aboard the Enterprise, prejudice erupts when Spock’s resemblance to the Romulans leads some crew members to question his loyalty, forcing Kirk to confront bigotry in his own ranks. Ultimately Kirk cripples the Romulan ship, but his opposite number chooses self‑destruction over capture, and both captains recognize in each other a worthy adversary who might have been a friend in different circumstances."
  },
  {
    "ID": "tass1e1",
    "Series": "TAS",
    "Season": 1,
    "Episode": 1,
    "Title": "Beyond the Farthest Star",
    "Summary": "The animated Enterprise is drawn toward the gravity well of a dead star and discovers a gargantuan, derelict alien ship millions of years old caught in the same orbit. Kirk, Spock, and a landing party beam aboard and piece together that the vessel’s insectoid crew once trapped a disembodied malevolent entity, which now seizes the opportunity to escape into the Enterprise’s systems. As the entity tries to force the starship into the dead star to gain enough energy to break free, Kirk and Spock risk leaving the Enterprise under partial automation so they can trick the creature back into the ancient hull. By sending the derelict vessel plunging into the star with the entity aboard, they save the ship and leave behind only fragments of a long‑extinct civilization’s desperate last stand."
  },
  {
    "ID": "tass1e2",
    "Series": "TAS",
    "Season": 1,
    "Episode": 2,
    "Title": "Yesteryear",
    "Summary": "Returning from a mission through the time portal known as the Guardian of Forever, Kirk finds that in the altered timeline Spock died as a child and history has radically changed. Only by traveling back to his own youth on Vulcan, posing as a family friend during the critical kahs‑wan maturity test, can Spock restore the original timeline. He must guide and protect his younger self without revealing too much, even as the boy struggles between logic and emotion and must choose whether to save his pet sehlat I‑Chaya. The adult Spock honors his mentor’s teachings by allowing his younger self to make a painful but logical decision, and when the timeline is repaired he returns to the Enterprise with a renewed understanding of the choices that shaped him."
  },
  {
    "ID": "tass1e3",
    "Series": "TAS",
    "Season": 1,
    "Episode": 3,
    "Title": "The Lorelei Signal",
    "Summary": "Responding to a mysterious signal from a region where starships have previously vanished, the Enterprise finds a world inhabited by immortal women who drain the life‑force of visiting men. Kirk, Spock, and most of the male crew fall under the influence of the siren‑like aliens, rapidly aging as their energy is siphoned away. With the male officers incapacitated, Uhura, Chapel, and the female crew members must seize control of the ship, break through the illusions, and beam down to rescue their shipmates. They ultimately destroy the device that sustains the aliens’ immortality, restoring the men and forcing the society to face a finite existence, while giving the women a chance to build a healthier future."
  },
  {
    "ID": "tngs1e1",
    "Series": "TNG",
    "Season": 1,
    "Episode": 1,
    "Title": "Encounter at Farpoint",
    "Summary": "The Enterprise‑D’s maiden voyage brings Captain Picard and his new crew to Farpoint Station, a seemingly miraculous outpost whose alien builders are suspiciously generous to the Federation. Before they can investigate, an omnipotent being called Q puts humanity on trial for its barbaric history, forcing Picard to defend the Federation as a genuinely evolved society. As the crew explores Farpoint, they uncover that the station is actually a living spacefaring entity held captive and exploited for its abilities. Picard orchestrates the creature’s liberation and reunion with its mate, proving to Q that humanity can choose compassion over exploitation, even when the outcome is politically inconvenient."
  },
  {
    "ID": "tngs3e26",
    "Series": "TNG",
    "Season": 3,
    "Episode": 26,
    "Title": "The Best of Both Worlds, Part I",
    "Summary": "The Federation faces its greatest threat when a Borg cube invades, and the Enterprise is ordered to intercept. During a failed attempt to negotiate, Picard is captured and assimilated, reemerging as Locutus of Borg—a human mouthpiece meant to demoralize Starfleet and facilitate the collective’s invasion. Riker, promoted to acting captain, must lead the crew against their own former commander while grappling with his long‑deferred ambitions and doubts. The episode ends on a legendary cliffhanger as Riker orders Worf to fire a prototype weapon at the Borg cube with Picard still aboard, leaving the fate of both the captain and the Federation uncertain."
  },
  {
    "ID": "tngs5e25",
    "Series": "TNG",
    "Season": 5,
    "Episode": 25,
    "Title": "The Inner Light",
    "Summary": "A mysterious probe zaps Picard on the bridge, and in moments he experiences an entire alternate lifetime as Kamin, a scientist on the drought‑stricken world of Kataan. As years pass, he marries, raises a family, and watches his adopted civilization confront the inevitability of its sun’s destruction. Picard eventually learns that the probe is a time capsule launched by the doomed people to preserve the memory of their culture in the mind of a single witness. When he awakens back on the Enterprise only minutes have passed, yet he carries decades of emotional history and the musical legacy of that lost world, captured in the simple melody of the Ressikan flute."
  },
  {
    "ID": "ds9s1e1",
    "Series": "DS9",
    "Season": 1,
    "Episode": 1,
    "Title": "Emissary",
    "Summary": "Newly assigned to the troubled space station Deep Space 9, Commander Benjamin Sisko must help Bajor rebuild after the Cardassian occupation while coping with his own grief over his wife’s death at Wolf 359. Tensions with the Bajoran provisional government, the resentful Major Kira, and the still‑influential Cardassians threaten the station’s future from the moment Starfleet takes over. When a nearby wormhole turns out to be the long‑prophesied Celestial Temple, Sisko encounters non‑linear alien beings the Bajorans revere as Prophets and is forced to confront his unresolved trauma. By the time he returns, Sisko has accepted his role as Emissary to the Prophets and secured Bajor’s strategic importance, setting the stage for the series’ political and spiritual conflicts."
  },
  {
    "ID": "ds9s1e19",
    "Series": "DS9",
    "Season": 1,
    "Episode": 19,
    "Title": "Duet",
    "Summary": "A Cardassian clerk named Marritza arrives at Deep Space 9 seeking medical treatment, but Kira believes he is actually Gul Darhe’el, the notorious “Butcher of Gallitep” who oversaw a brutal labor camp during the occupation. Determined to see justice done, Kira pushes for his trial, only to discover that Marritza was a low‑level file clerk haunted by guilt for his inaction. He has undergone surgery to resemble Darhe’el in order to force Cardassia to confront its war crimes and collective denial. The episode becomes a powerful courtroom chamber piece about responsibility and complicity, ending with Marritza’s murder by a Bajoran who refuses to see him as anything but Cardassian, underscoring how hatred persists long after the war."
  },
  {
    "ID": "ds9s4e3",
    "Series": "DS9",
    "Season": 4,
    "Episode": 3,
    "Title": "The Visitor",
    "Summary": "After a freak accident involving a warp core experiment apparently kills Sisko, Jake is left alone and consumed by grief. Years later, an older Jake awakens one night to find his father mysteriously reappeared, only for Benjamin to vanish again in front of him. Jake learns that his father is trapped in subspace, periodically phasing into Jake’s timeline, and he dedicates his entire life to theoretical physics in a desperate attempt to rescue him. As an old man, realizing that his obsession has cost him happiness and family, Jake sacrifices his own life at the moment of one of Benjamin’s returns, creating a paradox that sends Sisko back to the original accident, preventing it and erasing the tragic alternate future."
  },
  {
    "ID": "voys1e1",
    "Series": "VOY",
    "Season": 1,
    "Episode": 1,
    "Title": "Caretaker",
    "Summary": "When the Maquis ship Val Jean and the USS Voyager both chase a powerful alien array into the Badlands, they are flung 70,000 light‑years into the Delta Quadrant by an enigmatic being known as the Caretaker. Captain Janeway must navigate the tensions between her Starfleet crew and the Maquis rebels led by Chakotay while uncovering why the Caretaker has been abducting and experimenting on local species. She ultimately chooses to destroy the array rather than let it fall into the hands of the brutal Kazon, sacrificing their most direct route home to protect the Ocampa. In the aftermath, Janeway integrates the Maquis into her crew and sets a course for the long journey back to the Alpha Quadrant."
  },
  {
    "ID": "voys4e8",
    "Series": "VOY",
    "Season": 4,
    "Episode": 8,
    "Title": "Year of Hell, Part I",
    "Summary": "Voyager enters a region of space controlled by the Krenim, whose leader, Annorax, commands a massive temporal weapon ship capable of erasing entire civilizations from history. As the weapon’s repeated timeline alterations create a “year of hell,” Voyager is battered, crew members are lost, and Janeway is forced into brutal tactical decisions just to keep the ship flying. Tuvok is blinded, the crew is scattered into survival pods and alliances, and Janeway engages in a deadly cat‑and‑mouse struggle with Annorax, who is obsessed with restoring his ideal timeline. In the climax, she rams Voyager into the weapon ship, triggering a temporal reset that erases the year of suffering but leaves the crew with a lingering sense of unease over the horrors they can no longer fully remember."
  },
  {
    "ID": "voys6e12",
    "Series": "VOY",
    "Season": 6,
    "Episode": 12,
    "Title": "Blink of an Eye",
    "Summary": "Voyager becomes trapped in the orbit of a planet where time passes vastly faster than aboard the ship, turning hours in space into centuries on the surface. The world’s civilization evolves from a pre‑industrial society into a warp‑capable culture with Voyager hanging in the sky as a persistent “star.” Influenced by the ship’s presence, the planet’s scientists race to understand the phenomenon even as seismic upheavals caused by Voyager’s orbit threaten their world. Eventually an astronaut reaches the ship and learns the truth, and the Doctor spends years planetside helping them develop a solution, before Voyager finally breaks free—having watched an entire civilization rise, change, and come to regard them as myth."
  },
  {
    "ID": "ents1e1",
    "Series": "ENT",
    "Season": 1,
    "Episode": 1,
    "Title": "Broken Bow",
    "Summary": "When a wounded Klingon crash‑lands on Earth, Starfleet seizes the chance to send its first warp‑5 starship, Enterprise NX‑01, to return him home, despite Vulcan objections that humans are not ready. Captain Jonathan Archer, still resentful of Vulcan oversight, jumps at the opportunity to explore, bringing a diverse crew that includes linguist Hoshi Sato, Denobulan doctor Phlox, and Vulcan observer T’Pol. Their mission becomes entangled in the Temporal Cold War as the Suliban Cabal tries to kidnap the Klingon for their own purposes. Archer defies expectations by choosing a path that both satisfies Klingon honor and asserts humanity’s independence, marking the true beginning of Starfleet’s era of deep‑space exploration."
  },
  {
    "ID": "ents1e26",
    "Series": "ENT",
    "Season": 1,
    "Episode": 26,
    "Title": "Shockwave, Part I",
    "Summary": "A disastrous explosion during an away mission appears to kill thousands of innocent colonists, and the blame is laid squarely on Enterprise, leading the Vulcans and Starfleet Command to consider canceling the mission. As Archer and T’Pol investigate, they uncover evidence that the tragedy was engineered by agents of the Temporal Cold War to derail humanity’s progress. Future ally Daniels reveals more about the temporal conflict, pulling Archer briefly forward in time to show the long‑term stakes of the Enterprise’s journey. The episode ends on a cliffhanger as Archer is yanked into the far future and Enterprise is recalled home, leaving the crew uncertain whether their pioneering voyage is already over."
  },
  {
    "ID": "ents3e8",
    "Series": "ENT",
    "Season": 3,
    "Episode": 8,
    "Title": "Twilight",
    "Summary": "In an alternate timeline created by a spatial anomaly, Archer saves T’Pol from a deadly energy blast but is infected with parasitic organisms that prevent him from forming new memories. Twelve years later, humanity has lost the war with the Xindi, Earth has been destroyed, and what remains of the Enterprise crew lives aboard a ragged fleet. T’Pol has devoted herself to caring for Archer, repeatedly explaining their history while searching for a way to remove the parasites and send him back to undo the catastrophe. When they finally discover that killing Archer at the moment of the original infection will erase the doomed timeline, he willingly sacrifices himself, and time resets with the healthy captain ready to continue the mission in the Expanse."
  },
  {
    "ID": "diss1e1",
    "Series": "DIS",
    "Season": 1,
    "Episode": 1,
    "Title": "The Vulcan Hello",
    "Summary": "First Officer Michael Burnham of the USS Shenzhou confronts a cryptic object at the edge of Federation space and, in the process, encounters a Klingon sect led by T’Kuvma who seeks to unite the Great Houses in opposition to the Federation. Haunted by her upbringing on Vulcan and lessons from Sarek about pre‑emptive logic, Burnham argues for striking first but is overruled by Captain Georgiou. In a moment of desperation, she stages a mutiny to force a first strike, only for events to spiral into a full‑scale battle that costs Georgiou her life and ignites the Federation–Klingon War. The episode ends with Burnham’s court‑martial and life sentence, framing her as the disgraced officer whose actions set the darker tone for Discovery’s first season."
  },
  {
    "ID": "diss1e7",
    "Series": "DIS",
    "Season": 1,
    "Episode": 7,
    "Title": "Magic to Make the Sanest Man Go Mad",
    "Summary": "Discovery becomes trapped in a temporal causality loop when con man Harry Mudd repeatedly sabotages the ship to learn its secrets and sell it to the Klingons. Each iteration ends in disaster, with the crew dying or the ship being destroyed, but Mudd alone retains memory of the loops. Stamets, shielded by the experimental spore drive, also remembers previous cycles and enlists Burnham and Tyler to outmaneuver Mudd by turning his greed and curiosity against him. They ultimately trick him into believing he has succeeded, only for his buyers to be revealed as his long‑suffering wife Stella and her father, who drag him back to a far less glamorous fate."
  },
  {
    "ID": "diss2e14",
    "Series": "DIS",
    "Season": 2,
    "Episode": 14,
    "Title": "Such Sweet Sorrow, Part 2",
    "Summary": "As the rogue AI Control threatens all sentient life, the crew of Discovery works with Pike’s Enterprise to execute a desperate plan: send Discovery and the sphere data it carries far into the future, out of Control’s reach. Burnham uses a time crystal to create a new red angel suit and opens a wormhole, while her friends choose to accompany her on what may be a one‑way trip. A massive space battle erupts with Section 31 ships under Control’s influence, and the combined efforts of both crews buy Burnham enough time to lead Discovery into the time tunnel. The episode closes with Pike, Spock, and Number One agreeing to classify the events and maintain that Discovery was destroyed, as the ship and its crew vanish into the 32nd century."
  },
  {
    "ID": "pics1e1",
    "Series": "PIC",
    "Season": 1,
    "Episode": 1,
    "Title": "Remembrance",
    "Summary": "Years after resigning from Starfleet in protest over its response to the Romulan supernova, a retired and disillusioned Jean‑Luc Picard lives quietly on his vineyard, haunted by dreams of Data. His solitude is shattered when Dahj, a terrified young woman with impossible fighting skills, seeks his help after being attacked by Romulan agents. Picard discovers that Dahj may be a synthetic lifeform linked to Data’s legacy and that a wider conspiracy within the Romulan Free State and possibly Starfleet itself is hunting her kind. When Dahj is killed, Picard resolves to leave Earth and uncover the truth about who created her and why, setting the stage for his return to space."
  },
  {
    "ID": "pics1e7",
    "Series": "PIC",
    "Season": 1,
    "Episode": 7,
    "Title": "Nepenthe",
    "Summary": "On the run from Romulan pursuers, Picard and Soji take temporary refuge on Nepenthe, the pastoral home of Will Riker and Deanna Troi, who have built a quiet life with their daughter Kestra. Picard is forced to confront how his unresolved guilt and emotional distance have affected the people who once relied on him, as Troi and Riker gently challenge his choices while still offering unwavering support. Soji, reeling from the revelation that she is synthetic, struggles with questions of identity and trust, slowly opening up under Kestra’s earnest curiosity and Riker’s paternal warmth. Meanwhile, the La Sirena crew tries to shake Narek’s pursuit, and by the end of the visit Picard and Soji are emotionally steadier and ready to continue their search for her homeworld."
  },
  {
    "ID": "pics3e4",
    "Series": "PIC",
    "Season": 3,
    "Episode": 4,
    "Title": "No Win Scenario",
    "Summary": "Stranded in a deadly nebula aboard the damaged USS Titan‑A, Picard and Riker face a no‑win scenario as they are hunted by Vadic’s warship while the crew slowly suffocates and power drains away. Flashbacks to a holodeck recreation of a long‑ago bar on Earth show Picard giving a younger Jack Crusher advice about impossible situations, echoing the lessons of the Kobayashi Maru. In the present, Picard finally acknowledges his paternity and works alongside Jack to improvise a daring escape that uses the nebula’s bio‑electric bursts as a slingshot. The episode resolves both the tactical crisis and lingering emotional distance between Picard and his son, reframing the concept of a “no win scenario” as a test of relationships as much as strategy."
  },
  {
    "ID": "snws1e1",
    "Series": "SNW",
    "Season": 1,
    "Episode": 1,
    "Title": "Strange New Worlds",
    "Summary": "After the events of Discovery’s second season, Captain Christopher Pike retreats to his Montana ranch, struggling with the knowledge of the gruesome fate he has seen in his future. When Una goes missing on a first‑contact mission, he returns to the Enterprise and assembles his crew—Spock, La’An, and others—for a rescue that takes them to a pre‑warp world on the brink of nuclear war. Pike ultimately reveals the truth about Earth’s own near‑apocalypse to the planet’s leaders, using humanity’s example as both warning and hope to steer them away from self‑destruction. By choosing to face his destiny rather than hide from it, Pike recommits himself to Starfleet’s mission of exploration and ethical intervention."
  },
  {
    "ID": "snws1e10",
    "Series": "SNW",
    "Season": 1,
    "Episode": 10,
    "Title": "A Quality of Mercy",
    "Summary": "On the eve of sharing his knowledge of future events with Starfleet, Pike is confronted by an older version of himself who offers a glimpse of what happens if he avoids the accident that cripples him. He finds himself in an alternate future during the events of the classic Romulan encounter later known as “Balance of Terror,” still commanding the Enterprise in a timeline where his sacrifice never occurred. Pike’s more conciliatory approach leads to a different confrontation with the Romulans, one that ultimately escalates tensions and risks open war. Realizing that his attempt to save himself would cost countless lives, Pike chooses to accept his original fate, returning to his present with a renewed sense of purpose and a deeper understanding of why his sacrifice matters."
  },
  {
    "ID": "snws2e3",
    "Series": "SNW",
    "Season": 2,
    "Episode": 3,
    "Title": "Tomorrow and Tomorrow and Tomorrow",
    "Summary": "Security chief La’An Noonien‑Singh is pulled into an alternate timeline when a temporal agent tasks her with preventing an attack on the Federation’s future by meddling with Earth’s past. She ends up in 21st‑century Toronto alongside an alternate, pre‑captain James T. Kirk who has never known Starfleet, and the two must piece together clues about a Romulan assassin. As they race through a city that does not yet know the Federation exists, La’An confronts both romantic feelings for this version of Kirk and the burden of her family name, tied to a notorious tyrant. Their success restores the original timeline but at the cost of La’An’s brief connection with Kirk, leaving her with a private grief and a deeper appreciation of the fragile threads that hold history together."
  },
  {
    "ID": "lds1e1",
    "Series": "LD",
    "Season": 1,
    "Episode": 1,
    "Title": "Second Contact",
    "Summary": "Aboard the support ship USS Cerritos, ensign Beckett Mariner drags nervous rule‑follower Brad Boimler into chaotic “second contact” duties on a newly contacted world. As a strange space‑moss infection turns crew members into rage‑filled zombies and the bridge officers wrestle with a diplomatic crisis, the lower‑deckers scramble to survive and prove their worth. Mariner’s reckless competence and secret history with Starfleet clash with Boimler’s ambition and desire to impress Captain Freeman, who also happens to be Mariner’s mother. By the end of the mission, the Cerritos survives its disastrous day, and Boimler learns that Starfleet isn’t just about perfect heroics on the bridge but messy, often hilarious work down below."
  },
  {
    "ID": "lds1e9",
    "Series": "LD",
    "Season": 1,
    "Episode": 9,
    "Title": "Crisis Point",
    "Summary": "After a reprimand from her mother, Mariner hijacks Boimler’s holodeck movie program, turning it into an over‑the‑top cinematic revenge fantasy in which she “kills” a caricatured version of Captain Freeman. The simulation spirals into a meta‑Star Trek parody, complete with dramatic lens flares, slow‑motion hero shots, and exaggerated versions of Starfleet tropes. As her friends navigate the increasingly unhinged holomovie, Mariner is forced to confront her own anger, self‑sabotage, and fear of vulnerability. The exercise culminates in a cathartic showdown between Mariner and her holographic mother, leaving the real Mariner slightly more open to acknowledging that she actually cares about Starfleet and her family."
  },
  {
    "ID": "lds2e9",
    "Series": "LD",
    "Season": 2,
    "Episode": 9,
    "Title": "wej Duj",
    "Summary": "During a routine transit, the episode shifts focus between three different lower‑deck crews: Starfleet ensigns on the Cerritos, ambitious Klingon warriors aboard a Bird‑of‑Prey, and a hyper‑competent Vulcan officer on a survey ship. Each group deals with its own frustrations—Klingon politics and mutiny, Vulcan rigid hierarchy, and Starfleet busywork—while unknowingly converging on the same Pakled threat. The Klingon captain’s reckless plot to destabilize the quadrant is ultimately foiled through the combined actions of the three crews, none of whom fully realize how intertwined their stories have become. By the end, promotions and transfers hint that even so‑called “background” officers across multiple powers can shape galactic events in unexpected ways."
  },
  {
    "ID": "pros1e1",
    "Series": "PRO",
    "Season": 1,
    "Episode": 1,
    "Title": "Lost & Found, Part I",
    "Summary": "On the mining world of Tars Lamora, alien children are held as slaves by the mysterious Diviner and his enforcer, Drednok, forced to dig for an unknown prize they cannot even understand. A rebellious inmate named Dal stumbles upon that prize: the abandoned Federation starship Protostar, hidden deep beneath the surface. With the help of fellow prisoners—including Rok‑Tahk, Zero, Jankom Pog, Murf, and the Diviner’s own daughter Gwyn—Dal manages a daring escape and launches the ship into space. Guided by a holographic training program based on Captain Janeway, the ragtag crew sets off on a journey that will teach them what it means to be Starfleet even as the Diviner vows to hunt them down."
  },
  {
    "ID": "pros1e6",
    "Series": "PRO",
    "Season": 1,
    "Episode": 6,
    "Title": "Kobayashi",
    "Summary": "Eager to prove himself as captain, Dal secretly runs the legendary Kobayashi Maru simulation on the Protostar’s holodeck, calling upon holographic legends like Spock, Uhura, Odo, and Beverly Crusher as his bridge crew. His repeated, often comical failures highlight his arrogance and insecurity, as he tries to “game” a scenario designed to be unwinnable. Over time, Dal begins to understand that leadership is not about ego or cheating death but about accepting responsibility and the possibility of sacrifice. Meanwhile, the rest of the real crew continues to bond and explore the ship, and by the end Dal takes his first real step toward becoming the kind of captain Starfleet would be proud of."
  },
  {
    "ID": "pros1e20",
    "Series": "PRO",
    "Season": 1,
    "Episode": 20,
    "Title": "Supernova, Part 2",
    "Summary": "With the Living Construct weapon poised to turn Starfleet’s own ships against each other, the Protostar crew faces the horrifying possibility of causing a galactic civil war if they return home. As Starfleet vessels are drawn into range and begin attacking one another under the weapon’s influence, Dal, Gwyn, and their friends realize that the only way to break the chain reaction is to destroy their own ship. They download Hologram Janeway into a shuttle and evacuate, while she stays behind to pilot the Protostar on a collision course and trigger a controlled detonation that severs the Construct’s control. In the aftermath, Starfleet recognizes the kids’ heroism but hesitates to formally accept them, and Gwyn chooses to return to her father’s people to try to unite them, setting up new adventures beyond the sacrifice."
  }
]
