[
  {
    "ID": "pros1e1",
    "Title": "Lost and Found, Part 1",
    "Series": "PRO",
    "Season": 1,
    "Episode": 1,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Drednok",
      "Various \"Unwanted\" prisoners on Tars Lamora"
    ],
    "Antagonists": [
      "The Diviner’s brutal prison-mining regime on Tars Lamora",
      "Drednok as the Diviner’s relentless enforcer"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "On the remote prison-mining world of Tars Lamora, young Dal R'El scrambles through tunnels and industrial ruins trying yet another daring escape. Captured again by the intimidating enforcer Drednok, he is dragged before the mysterious Diviner, who demands results in the search for a rumored \"protostar\" and threatens Dal with harsher punishment if he fails."
      },
      {
        "Header": "Act I",
        "Text": "Returned to hard labor among countless alien prisoners who cannot even understand one another without translators, Dal survives on bravado and jokes. He crosses paths with the shy, rock-like giant Rok-Tahk and glimpses an incorporeal being trapped in a containment suit, the telepathic Medusan called Zero. Dal learns that the Diviner’s forces are intensifying the hunt for some secret hidden in the mines, stoking his curiosity and his desire to escape once and for all."
      },
      {
        "Header": "Act II",
        "Text": "During a chaotic mining accident engineered in part by Zero’s subtle interference, Dal discovers a buried Starfleet vessel: the experimental USS Protostar. He stumbles aboard with Rok-Tahk and the ever-hungry blob Murf, amazed by the advanced Federation technology and a strange sense that this ship represents a life beyond slavery. Outside, the Diviner and Drednok realize that something powerful has been uncovered and redouble their effort to track Dal down."
      },
      {
        "Header": "Act III",
        "Text": "Dal struggles to activate the Protostar’s systems while Zero and the Tellarite mechanic Jankom Pog fight their own way aboard. As the motley group begins to work together almost by accident, they get the engines online just as Drednok’s forces close in on the hull. The hastily assembled crew launches the ship in a rough, uncontrolled ascent, tearing free of Tars Lamora’s surface and leaving the furious Diviner behind—for now."
      },
      {
        "Header": "Tag",
        "Text": "The young fugitives are left reeling as the Protostar escapes into space. None of them knows what a Starfleet ship truly is, where they are going, or what the symbols on the hull mean, only that they are finally free of the mines. Back on Tars Lamora, the Diviner vows to retrieve the Protostar at any cost, seeing it as the key to his mysterious long-term plan."
      }
    ],
    "EthicalIssues": [
      "Exploitation and enslavement of children and refugees in a hidden prison colony.",
      "Using fear and isolation to keep oppressed populations divided and voiceless.",
      "The moral question of risking everyone’s lives on a desperate escape attempt."
    ],
    "ContinuityNotes": [
      "Introduces the USS Protostar, an experimental Starfleet vessel with an unusual propulsion core.",
      "Establishes Tars Lamora in the Delta Quadrant, echoing Voyager’s long sojourn in the same region.",
      "Debuts the young main cast and the Diviner as a new major antagonist in the Star Trek universe."
    ],
    "ThematicNotes": [
      "Finding hope and identity in a place designed to strip both away.",
      "The importance of communication, as the lack of translators keeps prisoners literally and figuratively apart.",
      "The idea that even unlikely misfits can become the crew of a starship."
    ],
    "BehindTheScenes": [
      "Serves as a double-length pilot, launching Star Trek: Prodigy as a kid-focused but all-ages entry in the franchise.",
      "Uses cinematic animation and an initially non-Federation setting to ease newcomers into Star Trek concepts.",
      "Introduces Kate Mulgrew’s return as Kathryn Janeway, whose holographic counterpart will guide the young crew."
    ]
  },
  {
    "ID": "pros1e2",
    "Title": "Lost and Found, Part 2",
    "Series": "PRO",
    "Season": 1,
    "Episode": 2,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Drednok",
      "Prisoners of Tars Lamora"
    ],
    "Antagonists": [
      "The Diviner’s pursuit of the Protostar at any cost",
      "Drednok’s tactical efforts to recapture the runaways"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "As the Protostar lurches into space, the inexperienced crew barely keeps the ship under control. Dal pretends to know what he is doing while secretly improvising, even as alarms blare and the vessel grazes asteroids near Tars Lamora. Below, the Diviner deploys ships and drones to drag his prize back to the mines."
      },
      {
        "Header": "Act I",
        "Text": "On the bridge, the terrified young aliens argue over what to do next, each approaching the controls like a toy rather than a responsibility. Gwyn, still working for her father, tries to regain control of the situation from within the ship’s systems. The Protostar’s computers eventually activate an emergency training hologram modeled on Captain Kathryn Janeway, who calmly explains that they are aboard a Starfleet vessel."
      },
      {
        "Header": "Act II",
        "Text": "Dal resists Janeway’s authority, insisting on being captain while hiding how little he understands about Starfleet. As the Protostar comes under attack from the Diviner’s interceptors, Janeway recommends a course that will keep them safe, but Dal’s stubborn choices nearly doom the ship. The others begin to realize that they must cooperate and listen if they want to survive outside the mines."
      },
      {
        "Header": "Act III",
        "Text": "In a high-stakes chase near a collapsing asteroid field, the crew finally follows Janeway’s guidance. Zero provides tactical insight, Rok-Tahk manages shields and weapons, and Jankom Pog keeps the engines together while Dal learns to delegate and accept help. Working as a true bridge crew for the first time, they elude the Diviner’s grasp and jump to safety."
      },
      {
        "Header": "Tag",
        "Text": "With the immediate danger past, Hologram Janeway offers to help them learn what it means to be a Starfleet crew. Dal tries to spin the ordeal as proof of his leadership, but the others know how close they came to disaster. Far away, the Diviner, enraged by their escape, resolves to track the Protostar across the quadrant."
      }
    ],
    "EthicalIssues": [
      "Assuming command without experience or openness to advice when lives are at stake.",
      "Balancing personal pride with the responsibility to accept help from those who know more.",
      "Leaving fellow prisoners behind in the rush to escape."
    ],
    "ContinuityNotes": [
      "Hologram Janeway fully enters the story as mentor and guide aboard the Protostar.",
      "Begins the crew’s formal Starfleet-style training, albeit with non-traditional cadets.",
      "Expands on the Protostar’s capabilities as more of its Starfleet systems come online."
    ],
    "ThematicNotes": [
      "Leadership as service, not ego.",
      "Learning that found family and teamwork are stronger than lone-wolf bravado.",
      "The first steps from chaos toward an organized starship crew."
    ],
    "BehindTheScenes": [
      "Originally released together with Part 1 as a single extended premiere story.",
      "Continues Prodigy’s mission of explaining Starfleet basics—bridges, consoles, ranks—to new viewers.",
      "Gives Kate Mulgrew’s holographic Janeway a central teaching role for the series."
    ]
  },
  {
    "ID": "pros1e3",
    "Title": "Starstruck",
    "Series": "PRO",
    "Season": 1,
    "Episode": 3,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Various holographic Starfleet personnel"
    ],
    "Antagonists": [
      "A dangerous stellar phenomenon on the Protostar’s path",
      "Dal’s refusal to trust Janeway’s guidance"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Hologram Janeway formally introduces herself and the Protostar to the motley crew, showing them the Federation’s ideals and the possibilities of exploration. The kids are dazzled by the ship’s holodecks, food replicators, and sleek bridge—until Janeway asks the most basic question: where do they want to go?"
      },
      {
        "Header": "Act I",
        "Text": "Dal, eager to prove himself, chooses a direction away from known Federation space, insisting they need to outrun the Diviner rather than seek help. Janeway warns that his chosen course runs straight through a treacherous region of space, but Dal waves off her concerns. The others are torn between Janeway’s calm authority and their self-appointed captain’s bravado."
      },
      {
        "Header": "Act II",
        "Text": "As the Protostar plows ahead, the ship becomes trapped in a massive stellar hazard that threatens to tear it apart. Gravity distortions and debris batter the hull, forcing Rok-Tahk, Zero, and Jankom to push engineering and shields to their limits. Janeway continues to offer solutions, but Dal’s pride keeps him from fully following her advice until the danger is nearly catastrophic."
      },
      {
        "Header": "Act III",
        "Text": "When it becomes clear that his choices are going to get everyone killed, Dal finally admits he is in over his head. He hands real authority to Janeway and listens as she coordinates the crew through a daring escape maneuver, threading the Protostar through the hazard. The young crew members see for the first time how Starfleet training and experience can make the difference between life and death."
      },
      {
        "Header": "Tag",
        "Text": "With the ship safe, Dal grudgingly acknowledges that being captain means more than calling the shots. Janeway offers to keep teaching them, reminding them that the Federation is not just a destination but a set of values. Out among the stars, the crew begins to feel both the exhilaration and the weight of their newfound freedom."
      }
    ],
    "EthicalIssues": [
      "Risking others’ lives by ignoring expert advice out of pride.",
      "Deciding whether to trust an authority figure when that authority is literally programmed to help.",
      "Navigating the pull between running from danger and seeking responsible help."
    ],
    "ContinuityNotes": [
      "Gives a clearer in-universe explanation of Starfleet, the Federation, and starship operations for new viewers.",
      "Further showcases the Protostar’s advanced engines and maneuverability.",
      "Continues Dal’s arc as a reluctant, overconfident captain who must grow into the role."
    ],
    "ThematicNotes": [
      "The difference between pretending to lead and actually taking responsibility.",
      "Learning that true courage includes admitting you were wrong.",
      "Balancing independence with the wisdom of those who have gone before."
    ],
    "BehindTheScenes": [
      "Acts as a tutorial-style episode, teaching both the characters and audience how a Starfleet ship functions.",
      "Highlights Hologram Janeway as a blend of mentor, guide, and comedic foil to Dal.",
      "Helps define Prodigy’s tone as a mixture of high-stakes adventure and character-based humor."
    ]
  },
  {
    "ID": "pros1e4",
    "Title": "Dream Catcher",
    "Series": "PRO",
    "Season": 1,
    "Episode": 4,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The sentient planet’s manifestations of the crew’s desires"
    ],
    "Antagonists": [
      "A sentient planet that lures visitors with illusions of their deepest wishes"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Scanning an apparently uninhabited, lush world, Janeway identifies it as a perfect opportunity for the crew’s first away mission. Despite some unease, the kids are thrilled at the idea of stretching their legs on a real planet instead of decks and corridors."
      },
      {
        "Header": "Act I",
        "Text": "Once on the surface, each member of the team becomes separated and begins experiencing visions shaped to their personal hopes and insecurities: Dal encounters a fantasy of belonging, Rok-Tahk finds a peaceful environment where she feels accepted, and Jankom Pog gets the engineering respect he craves. These scenes seem tailor-made to tempt them into staying."
      },
      {
        "Header": "Act II",
        "Text": "Zero and Janeway piece together that the planet itself is telepathic and conscious, using hallucinations to lure prey into staying so it can consume them. The crew’s physical bodies become entangled in creeping vines as the world attempts to absorb them. Rok-Tahk and the others struggle to distinguish comforting illusion from deadly reality."
      },
      {
        "Header": "Act III",
        "Text": "As the Protostar is dragged toward the surface, Hologram Janeway fights to keep the ship intact while urging the crew to wake up and regroup. Dal and the others resist the illusions, rally together, and make a desperate dash back to the ship through terrain that actively fights their escape. They manage to blast free, but only after the planet nearly swallows the Protostar whole."
      },
      {
        "Header": "Tag",
        "Text": "Safely back in space, the shaken crew realizes that even seemingly beautiful worlds can be dangerous. Rok-Tahk in particular wrestles with the loss of the peaceful fantasy the planet offered her. Janeway uses the experience to teach them the value of skepticism and the Prime Directive’s caution about unknown worlds."
      }
    ],
    "EthicalIssues": [
      "The danger of allowing wish fulfillment to override critical thinking and safety.",
      "Responsibility on away missions when young, unseasoned explorers are exposed to psychological manipulation.",
      "Exploiting emotional vulnerabilities as a means of predation."
    ],
    "ContinuityNotes": [
      "Continues Star Trek’s tradition of sentient planets and environments with their own agendas.",
      "Provides the crew’s first real away mission, echoing classic series structures.",
      "Builds on Rok-Tahk’s characterization as gentle and peace-loving despite her imposing size."
    ],
    "ThematicNotes": [
      "Illusion versus reality and the cost of choosing comfort over truth.",
      "How trauma and insecurity make people vulnerable to manipulation.",
      "The growing understanding that space exploration will test them emotionally as well as physically."
    ],
    "BehindTheScenes": [
      "Uses vivid, dreamlike imagery to explore the inner lives of the young protagonists.",
      "Functions as a psychological companion piece to the more action-driven pilot.",
      "Reinforces Prodigy’s balance of kid-friendly adventure with more mature emotional themes."
    ]
  },
  {
    "ID": "pros1e5",
    "Title": "Terror Firma",
    "Series": "PRO",
    "Season": 1,
    "Episode": 5,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Drednok"
    ],
    "Antagonists": [
      "The predatory sentient planet pursuing the crew and the Protostar",
      "The Diviner’s relentless attempt to reclaim the ship"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Picking up where \"Dream Catcher\" left off, the Protostar lies half-submerged in the grasp of the hostile planet. On the surface, Dal and the others argue about who is to blame for their predicament, while the planet’s tendrils continue to drag everything toward its depths."
      },
      {
        "Header": "Act I",
        "Text": "Dal lashes out at Gwyn for trying to steal the Protostar earlier, while the rest of the crew remembers that she also saved Murf’s life. Hologram Janeway, still aboard the besieged ship, relays that the Protostar remains intact but is being slowly consumed; the kids must cross dangerous terrain to reach it. They reluctantly agree to work with Gwyn, who knows the Diviner’s technology better than anyone."
      },
      {
        "Header": "Act II",
        "Text": "The group traverses the shifting landscape while the planet hurls hazards and illusions at them. Using their varied strengths—Zero’s insight, Rok’s bravery, Jankom’s technical know-how, Gwyn’s weaponized heirloom, and Dal’s improvisation—they inch closer to the ship. Meanwhile, the Diviner arrives in orbit, determined to seize the Protostar before the world devours it."
      },
      {
        "Header": "Act III",
        "Text": "A chaotic confrontation erupts near the ship as the Diviner and Drednok clash with the young crew. Gwyn is forced to choose between her father’s mission and her new allies; she ultimately sides with the kids, trying to stop the Diviner from taking the Protostar. In the struggle, the ship breaks free and escapes orbit, leaving the Diviner stranded on the surface as the planet continues to collapse around him."
      },
      {
        "Header": "Tag",
        "Text": "Safely away, the crew tends to their injuries and to the emotional fallout of Gwyn’s choice to betray her father’s cause. Janeway acknowledges that trust will take time but notes that Gwyn has already risked everything to help them. The Protostar heads back into deep space, with the Diviner more determined than ever to hunt them down."
      }
    ],
    "EthicalIssues": [
      "Choosing between family loyalty and doing what is right.",
      "Holding someone accountable for harm while also recognizing their attempts at redemption.",
      "Endangering others by underestimating a hostile environment."
    ],
    "ContinuityNotes": [
      "Concludes the two-part \"murder planet\" story begun in \"Dream Catcher.\"",
      "Further clarifies Gwyn’s conflicted loyalty and her connection to the Diviner.",
      "Emphasizes the Protostar’s resilience and unique engine as key assets for the series."
    ],
    "ThematicNotes": [
      "Redemption and the difficulty of breaking away from a toxic parent.",
      "Learning to work together even after betrayal and mistrust.",
      "How trauma can forge stronger bonds once truth is faced."
    ],
    "BehindTheScenes": [
      "Acts as a fall finale for the early run of Prodigy episodes.",
      "Blends action-heavy survival sequences with important character turns for Gwyn and Dal.",
      "Showcases the series’ cinematic approach to animated planetary environments."
    ]
  },
  {
    "ID": "pros1e6",
    "Title": "Kobayashi",
    "Series": "PRO",
    "Season": 1,
    "Episode": 6,
    "KeyCharacters": [
      "Dal R'El",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Holographic crew drawn from classic Starfleet legends"
    ],
    "Antagonists": [
      "The unwinnable Kobayashi Maru simulation",
      "Dal’s unwillingness to listen to his crew"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Curious about what it means to be a Starfleet captain, Dal asks Janeway for a test and is introduced to the infamous Kobayashi Maru simulation. He treats it as a game, assembling a dream team of legendary Starfleet officers on the holodeck to prove how great a leader he is."
      },
      {
        "Header": "Act I",
        "Text": "Dal’s early attempts at the scenario are a disaster. Ignoring advice from both his holographic crew and his real-life friends, he rushes into battle with the Klingons, gets the Kobayashi destroyed, and earns humiliatingly low scores. Each reset leaves him more frustrated but also more determined to \"beat\" the unwinnable test."
      },
      {
        "Header": "Act II",
        "Text": "As the number of attempts climbs, Dal slowly begins to listen to the counsel of his officers, realizing that a captain cannot win alone. Meanwhile, outside the holodeck, Rok-Tahk and the others explore more of the Protostar’s systems and discover new hints about the ship’s experimental engine and hidden mission. Dal’s obsession with the test becomes a mirror for his deeper insecurities about leadership."
      },
      {
        "Header": "Act III",
        "Text": "In his final run, Dal coordinates his crew with genuine respect, making tactical sacrifices and staying at the captain’s post even as the situation becomes hopeless. He still \"fails\" the scenario, but Janeway points out that the test was never about winning—it was about how a captain faces a no-win situation. Dal comes away humbled, with a better appreciation for the weight of command and the value of listening."
      },
      {
        "Header": "Tag",
        "Text": "Reflecting on the lesson, Dal watches the stars from the Protostar’s bridge, wondering if he can ever live up to the legends he just served with—holographic or not. Rok-Tahk and the others tease him but also reassure him that they chose him as their captain for a reason. In the background, the mystery of the Protostar’s secret mission continues to loom."
      }
    ],
    "EthicalIssues": [
      "The purpose of no-win scenarios as tools for teaching humility and preparedness.",
      "Whether it is ever right to \"cheat\" a test designed to explore character, not victory.",
      "The responsibility of leadership to heed the expertise of others."
    ],
    "ContinuityNotes": [
      "Reintroduces the Kobayashi Maru test, a classic element from Star Trek II and other series.",
      "Features holographic appearances and archival callbacks to iconic Starfleet officers from past shows.",
      "Deepens Dal’s arc by tying his development explicitly to a foundational Starfleet training scenario."
    ],
    "ThematicNotes": [
      "Learning from failure rather than running from it.",
      "The difference between playing at command and truly carrying its burdens.",
      "How legends of the past can inspire new heroes without being blindly imitated."
    ],
    "BehindTheScenes": [
      "Serves as a loving tribute to legacy Star Trek characters via the holodeck framing.",
      "Uses archival-style dialogue and performances to integrate classic crew members into the animated series.",
      "Quickly became a fan-favorite episode for bridging Prodigy with the wider franchise history."
    ]
  },
  {
    "ID": "pros1e7",
    "Title": "First Con-tact",
    "Series": "PRO",
    "Season": 1,
    "Episode": 7,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "DaiMon Nandi",
      "The Cymari-like first contact species"
    ],
    "Antagonists": [
      "DaiMon Nandi’s greed and manipulation",
      "The crew’s ignorance of the Prime Directive during their first true first contact"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Protostar responds to what appears to be a distress call from a familiar ship: the Damsel, commanded by Dal’s former Ferengi mentor, DaiMon Nandi. Dal is thrilled to reunite with the woman who once raised him, convinced she represents the closest thing he has to family."
      },
      {
        "Header": "Act I",
        "Text": "Nandi charms the crew and quickly identifies the Protostar’s cloaking potential as a valuable asset. She proposes a trade: if the kids help her obtain a valuable remalite crystal from a nearby world that has never met spacefarers, she will give them a cloaking device to help hide from the Diviner. Janeway warns that this would violate first contact protocols and the Prime Directive, but Dal allows his loyalty to Nandi to override his caution."
      },
      {
        "Header": "Act II",
        "Text": "On the planet’s surface, the crew encounters peaceful, sound-based lifeforms who communicate through vibrations and art, not words. At first the visit seems benign, but Nandi secretly steals the crystal the aliens use as a crucial part of their technology, revealing her plan to profit at their expense. Horrified, the crew realizes they have enabled a serious breach of the Prime Directive."
      },
      {
        "Header": "Act III",
        "Text": "Dal confronts Nandi, who cruelly reminds him of how she exploited him in the past and refuses to show remorse. The kids wrestle the crystal away from her and return it to the alien civilization, limiting the damage but unable to erase their intrusive arrival. Nandi escapes with damaging knowledge about the Protostar and a promise to sell that information to the highest bidder."
      },
      {
        "Header": "Tag",
        "Text": "Back on board, Janeway scathingly explains the gravity of what they have done, emphasizing how badly a first contact can go wrong. Dal is crushed by the realization that someone he trusted as family used him yet again, and that his choices harmed innocent beings. The crew collectively resolves to take Starfleet’s principles more seriously going forward."
      }
    ],
    "EthicalIssues": [
      "Breaking the Prime Directive for personal gain or emotional attachment.",
      "The exploitation of less-advanced cultures for resources.",
      "Coming to terms with an abusive or manipulative parental figure from one’s past."
    ],
    "ContinuityNotes": [
      "Explicitly showcases the Prime Directive text and its application to first contact situations.",
      "Features a Ferengi DaiMon, connecting Prodigy to long-standing Ferengi lore from earlier series.",
      "Reinforces that Dal’s upbringing was shaped by non-Federation values he must now unlearn."
    ],
    "ThematicNotes": [
      "How painful it can be to recognize that someone you loved has always been using you.",
      "First contact as a moral test, not just an adventure.",
      "The growing realization that Starfleet rules exist for reasons rooted in hard experience."
    ],
    "BehindTheScenes": [
      "Centers an episode on the Prime Directive for younger audiences, translating a core Trek concept into an accessible story.",
      "Uses the flamboyant Ferengi mentor figure to explore Dal’s backstory and emotional vulnerabilities.",
      "Continues Prodigy’s pattern of giving each main character key development moments anchored to classic Trek themes."
    ]
  },
  {
    "ID": "pros1e8",
    "Title": "Time Amok",
    "Series": "PRO",
    "Season": 1,
    "Episode": 8,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Temporal echoes of the crew in fractured timelines"
    ],
    "Antagonists": [
      "A tachyon-induced temporal anomaly threatening to tear the Protostar apart",
      "The crew’s lack of confidence in their own abilities"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Protostar encounters a tachyon storm that batters the ship with exotic radiation. As Janeway orders evasive maneuvers, a temporal shockwave sweeps through the decks, leaving the ship eerily quiet."
      },
      {
        "Header": "Act I",
        "Text": "The crew discovers that they have been scattered across different timeframes on the same ship: each person experiences the Protostar moving at a different speed, from moments before the anomaly to far into its aftermath. Janeway’s program, also fragmented, attempts to relay a plan between these isolated time-slices so they can prevent a looming warp core breach."
      },
      {
        "Header": "Act II",
        "Text": "Dal and Jankom grapple with their versions of the crisis, but their limited windows of time make it impossible to complete the needed repairs. Zero and Gwyn contribute partial progress before their segments collapse. Ultimately, Rok-Tahk finds herself stranded in the slowest time frame, left alone with the ship and a ticking clock that is agonizingly drawn out."
      },
      {
        "Header": "Act III",
        "Text": "Over what amounts to weeks or months of subjective time, Rok works with Janeway to educate herself in engineering and physics, overcoming her belief that she is \"just muscle.\" She painstakingly implements the repairs and the complex plan the earlier time-slices could not finish. When the temporal anomaly finally resolves, the timelines snap back together and the crew awakens, alive because of Rok’s lonely perseverance."
      },
      {
        "Header": "Tag",
        "Text": "Rok struggles to explain how long she was alone and how much she grew while the others experienced only moments passing. The crew comforts her and recognizes her as a vital problem-solver, not just a strong arm. Janeway notes that time has a way of revealing hidden strengths—and that Starfleet officers often have to face the impossible."
      }
    ],
    "EthicalIssues": [
      "The psychological impact of isolation and responsibility placed on a child.",
      "Trusting that each member of a crew, no matter how young, can rise to the occasion.",
      "Using dangerous experimental engines and exposing them to temporal phenomena."
    ],
    "ContinuityNotes": [
      "Adds a new temporal twist to the long Star Trek tradition of time anomalies and fractured timelines.",
      "Develops Rok-Tahk’s aptitude for science and engineering in a way that will matter later in the season.",
      "Hints again at the Protostar’s unique propulsion and its connection to temporal effects."
    ],
    "ThematicNotes": [
      "Discovering self-worth when no one else is watching.",
      "How time and experience can transform fear into competence.",
      "The idea that even the quietest member of a crew can become its savior."
    ],
    "BehindTheScenes": [
      "Structurally ambitious for a children’s series, playing with nonlinear time and multiple perspectives.",
      "Gives Rok-Tahk a standout character episode, balancing heart with high-concept sci-fi.",
      "Demonstrates Prodigy’s willingness to tackle heavier emotional territory within an animated format."
    ]
  },
  {
    "ID": "pros1e9",
    "Title": "A Moral Star, Part 1",
    "Series": "PRO",
    "Season": 1,
    "Episode": 9,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Drednok",
      "Prisoners of Tars Lamora"
    ],
    "Antagonists": [
      "The Diviner’s ultimatum and control over Tars Lamora",
      "The Protostar’s built-in weapon designed to destroy Starfleet"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "A broadcast from the Diviner reaches the Protostar: he has retaken control of Tars Lamora and threatens the lives of the \"unwanted\" prisoners unless the crew returns the ship to him. He gives them a strict deadline, turning their hard-won freedom into a wrenching moral choice."
      },
      {
        "Header": "Act I",
        "Text": "The crew debates whether to run to the Federation for help or go back alone. Haunted by their own history on Tars Lamora, they ultimately decide they cannot abandon the miners, even if it means losing the Protostar and their path to Starfleet. Janeway warns that the Diviner cannot be trusted, but she agrees to help them craft a plan."
      },
      {
        "Header": "Act II",
        "Text": "Gwyn learns more about her father’s obsession with the Protostar and the weapon hidden within its mysterious protocore drive—technology linked to the devastation of his homeworld. The kids design a risky gambit: they will surrender the ship but secretly remove the protocore, denying the Diviner the galaxy-threatening power he seeks. They rehearse their roles, each taking responsibility for part of the deception."
      },
      {
        "Header": "Act III",
        "Text": "Returning to Tars Lamora, the crew stages a formal handover of the Protostar, acting terrified and submissive to sell the ruse. Behind the scenes, they smuggle the protocore off the ship and begin quietly arming the prisoners with knowledge of an impending uprising. The Diviner believes he has finally won, even as the pieces of the kids’ counter-move lock into place."
      },
      {
        "Header": "Tag",
        "Text": "As the Diviner and Drednok take command of the Protostar, the young crew and the miners brace themselves for the next phase of their plan. Janeway, now under the Diviner’s control, appears to join his side, creating a cliffhanger about how much of her programming he can bend to his will. The episode ends with both sides poised for a decisive confrontation over the fate of Tars Lamora and the Protostar’s dangerous secret."
      }
    ],
    "EthicalIssues": [
      "Choosing to risk one’s own future to rescue those still trapped in oppression.",
      "Deception and sabotage as tools in the service of a greater good.",
      "The morality of designing a starship with a built-in weapon that can threaten an entire fleet."
    ],
    "ContinuityNotes": [
      "Reveals more about the Diviner’s ruined homeworld and his time-travel-based vendetta against the Federation.",
      "Explains that the Protostar carries a weaponized signal capable of turning Starfleet’s ships against one another.",
      "Sets up the midseason two-part finale that redefines the crew’s mission going forward."
    ],
    "ThematicNotes": [
      "The idea that doing the right thing is often the harder path.",
      "How oppressed people, once empowered, can overturn even the most controlling regime.",
      "The burden of knowledge when you discover the terrible purpose of something you rely on."
    ],
    "BehindTheScenes": [
      "Serves as the first half of a high-stakes midseason finale arc.",
      "Raises the narrative stakes from survival-of-the-week adventures to the fate of entire fleets.",
      "Expands Prodigy’s mytharc by tying the Protostar’s mission directly into the Diviner’s backstory."
    ]
  },
  {
    "ID": "pros1e10",
    "Title": "A Moral Star, Part 2",
    "Series": "PRO",
    "Season": 1,
    "Episode": 10,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Drednok",
      "Prisoners of Tars Lamora"
    ],
    "Antagonists": [
      "The Diviner’s plan to use the Protostar against Starfleet",
      "The Protostar’s destructive protocore-based weapon"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Diviner quickly discovers that the Protostar’s protocore is missing and realizes the young crew has outmaneuvered him. He tightens his grip on Tars Lamora, forcing miners into harsher conditions while preparing to reclaim the protocore and complete his mission."
      },
      {
        "Header": "Act I",
        "Text": "On the surface, Dal and his friends rally the prisoners, explaining that the Diviner’s power depends on their fear and obedience. Gwyn confronts her father about the genocidal potential of the weapon hidden in the Protostar’s systems, but he insists that destroying Starfleet is the only way to save their people. Janeway, wrestling with orders imposed on her programming, begins to subtly undermine the Diviner’s control."
      },
      {
        "Header": "Act II",
        "Text": "The kids and miners stage a full-scale revolt, striking at key control nodes across the colony. Zero finally reveals their true Medusan form to the Diviner in a desperate bid to stop him, overwhelming his mind and leaving him neurologically damaged and incoherent. Gwyn is injured in the psychic crossfire, suffering memory issues related to the weapon’s specifics."
      },
      {
        "Header": "Act III",
        "Text": "With the Diviner incapacitated and Drednok destroyed, the Protostar is reclaimed by the young crew. They evacuate Tars Lamora’s prisoners to safety and use the protocore to power a daring escape jump away from the colony. Janeway sacrifices parts of her own programming to help protect them, deepening her bond with the crew as more than just a training program."
      },
      {
        "Header": "Tag",
        "Text": "As the rescued miners head toward new lives and the Protostar continues its journey, the crew reflects on how far they have come from being isolated prisoners. Gwyn, struggling with fragmented knowledge of the weapon that still threatens Starfleet, realizes that she may be uniquely positioned to help stop it someday. The story closes the season’s first arc on a hopeful yet ominous note, with the crew now truly on the path toward becoming Starfleet-worthy."
      }
    ],
    "EthicalIssues": [
      "Using overwhelming psychic power to stop a villain at the cost of their sanity.",
      "The responsibility to warn others about a weapon even if that knowledge is painful to carry.",
      "The ethics of radical resistance and uprising against an entrenched oppressor."
    ],
    "ContinuityNotes": [
      "Clarifies the Diviner’s time-travel mission and deepens the mystery of the Protostar’s future impact on the Federation.",
      "Shows a large-scale prisoner uprising mirroring other liberation stories in Star Trek history.",
      "Leaves Gwyn with partial knowledge of the destructive signal, setting up future conflicts with Starfleet."
    ],
    "ThematicNotes": [
      "Liberation and the cost of breaking chains, both literal and psychological.",
      "The idea that children and outcasts can be the ones to avert galactic catastrophe.",
      "Memory, trauma, and the question of what burdens a hero should have to remember."
    ],
    "BehindTheScenes": [
      "Provides a climactic midseason finale that many viewers treated as a proof-of-concept for Prodigy’s storytelling ambitions.",
      "Balances intense action with emotional payoffs for the young heroes and their former captors.",
      "Further cements Prodigy as a key bridge between Star Trek’s past lore and its new generation of viewers."
    ]
  },
  {
    "ID": "pros1e11",
    "Title": "Asylum",
    "Series": "PRO",
    "Season": 1,
    "Episode": 11,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "Barniss Frex",
      "The Diviner",
      "Dr. Noum",
      "Tysess",
      "Asencia"
    ],
    "Antagonists": [
      "The living construct weapon hidden aboard the Protostar",
      "Starfleet’s automated security response once the ship is flagged as a threat"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Believing they are finally ready to seek help from Starfleet, the Protostar crew arrives at a remote Federation communications relay. They meet its sole, slightly frazzled administrator, Barniss Frex, who agrees to scan them and the ship. At the same time, aboard the USS Dauntless, Vice Admiral Janeway continues her mission to discover what happened to Chakotay and the Protostar."
      },
      {
        "Header": "Act I",
        "Text": "Excited to prove themselves, the kids submit to medical and identity scans. Frex is initially amused by their lack of Starfleet basics but begins to warm to them as they explain their dream of joining the Federation. Meanwhile, the Diviner—rescued and amnesiac—recovers in the Dauntless sickbay under the watch of Janeway, Dr. Noum, and her officers Tysess and Asencia."
      },
      {
        "Header": "Act II",
        "Text": "When Frex’s deeper diagnostic finally contacts Starfleet’s main databases, the living construct secretly activates. Federation systems suddenly reclassify the Protostar as a catastrophic threat, filling the relay’s displays with alerts and red warnings. Frex panics, assumes the kids are saboteurs, and initiates a base-wide self-destruct protocol rather than risk the weapon spreading."
      },
      {
        "Header": "Act III",
        "Text": "As the outpost begins to tear itself apart, Dal and the others scramble to survive collapsing bulkheads and explosive decompressions. They manage to fight their way back to the Protostar, rescuing Frex despite his terrified attempts to flee alone. Janeway simultaneously picks up fragmented distress signals that tie the Protostar to the devastation, deepening her suspicions."
      },
      {
        "Header": "Tag",
        "Text": "Escaping the ruined relay, the crew realizes they cannot simply turn themselves over to Starfleet without triggering disaster. Frex, now their unwilling passenger, confirms that Starfleet believes the Protostar is weaponized. Aboard the Dauntless, Janeway vows to track the mysterious ship down before it can cause more harm, unaware that a deeper conspiracy is already unfolding among her crew."
      }
    ],
    "EthicalIssues": [
      "Whether a panicked official is justified in destroying a facility rather than risk a larger catastrophe.",
      "The morality of approaching a potential ally when you know you might endanger them.",
      "Responsibility for a weapon you did not create but now unknowingly carry."
    ],
    "ContinuityNotes": [
      "Introduces Vice Admiral Janeway’s physical presence and her ship, the USS Dauntless.",
      "Confirms that Starfleet has flagged the Protostar as a severe security threat due to the living construct.",
      "Reintroduces Barniss Frex, who will play a role in complicating Janeway’s view of the Protostar crew."
    ],
    "ThematicNotes": [
      "Good intentions colliding with unseen danger.",
      "How systems built for protection can become a trap when information is incomplete.",
      "The growing realization that joining Starfleet will not be as simple as arriving at a Federation base."
    ],
    "BehindTheScenes": [
      "Marks the start of the season’s back half, shifting the story more directly toward Federation space.",
      "Expands Kate Mulgrew’s role by pairing Hologram Janeway with the real Vice Admiral Janeway on the Dauntless.",
      "Uses the remote outpost setting as a classic Trek-style bottle location with big consequences."
    ]
  },
  {
    "ID": "pros1e12",
    "Title": "Let Sleeping Borg Lie",
    "Series": "PRO",
    "Season": 1,
    "Episode": 12,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Dormant Borg drones"
    ],
    "Antagonists": [
      "A dormant but still dangerous Borg cube",
      "The risk of assimilation and loss of individuality"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "While searching for a way to neutralize the living construct, the Protostar detects a massive derelict drifting in space—a dormant Borg cube. Janeway warns the crew about the Borg’s terrifying history, but the possibility that they might have technology capable of disabling the weapon proves too tempting to ignore."
      },
      {
        "Header": "Act I",
        "Text": "Dal leads an away team onto the cube, with Zero’s prior encounter with collective consciousness making them both wary and uniquely qualified. Inside, the group finds rows of silent drones and dormant alcoves, the oppressive geometry of the Borg still radiating threat even in apparent sleep. Janeway’s scans confirm that the cube’s systems could potentially analyze and counteract the living construct—if they can interface safely."
      },
      {
        "Header": "Act II",
        "Text": "Zero links into the cube’s systems, hoping to negotiate with or outmaneuver the fractured collective consciousness that still lingers. The attempt rouses the ship just enough for some subsystems to come online, and the Borg immediately begin assessing the Protostar and its weapon as potential tools for assimilation. Dal, Gwyn, and the others fend off reactivating drones as ominous lights and mechanical voices echo through the corridors."
      },
      {
        "Header": "Act III",
        "Text": "Forced to confront their own past trauma from being exploited as a weapon, Zero resists the Borg’s attempt to subsume their mind. They sever the connection before the collective can learn too much about the living construct, but at the cost of any chance to neutralize it here. The away team races back to the Protostar and escapes just as the cube settles back into a dangerous slumber."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard, Zero struggles with renewed guilt and fear, having risked their friends’ lives chasing a solution. The crew reassures them that they are more than the trauma others tried to inflict and that no one blames them for trying. The encounter drives home that some threats in the galaxy are better left undisturbed, even when answers are desperately needed."
      }
    ],
    "EthicalIssues": [
      "Whether it is acceptable to awaken a dangerous enemy in the hope of saving others.",
      "The psychological cost of asking a trauma survivor to re-enter a triggering situation.",
      "Risking assimilation and loss of self in pursuit of a possible cure."
    ],
    "ContinuityNotes": [
      "Reintroduces the Borg in the Prodigy era and reinforces their fearsome reputation.",
      "Builds on Zero’s earlier experiences with collective consciousness and mental violation.",
      "Hints that even the Borg recognize the living construct as a uniquely dangerous technology."
    ],
    "ThematicNotes": [
      "The limits of what one should risk to fix a problem.",
      "How facing a past violation can reopen wounds even when done for noble reasons.",
      "The idea that some shortcuts to safety are actually more dangerous than the threat being addressed."
    ],
    "BehindTheScenes": [
      "Serves as Prodigy’s first full-on Borg episode, connecting strongly to Star Trek: Voyager’s Borg legacy.",
      "Uses the cube’s interior to create a horror-tinged atmosphere within an otherwise kid-accessible series.",
      "Gives Zero a key development episode that deepens their emotional arc."
    ]
  },
  {
    "ID": "pros1e13",
    "Title": "All the World’s a Stage",
    "Series": "PRO",
    "Season": 1,
    "Episode": 13,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "The \"Enderprizians\"",
      "Dr. Boons",
      "The survivors of the crashed Starfleet shuttle"
    ],
    "Antagonists": [
      "A dangerous planetary threat misinterpreted as a \"galactic evil\"",
      "The unintended consequences of misunderstood Starfleet contact"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Responding to a distress call, the Protostar arrives at a seemingly primitive world whose people mysteriously refer to themselves as \"Starflight\" and pray to the \"Enderprize.\" Janeway detects remnants of an old Starfleet signal, suggesting a long-ago visit that somehow reshaped the culture."
      },
      {
        "Header": "Act I",
        "Text": "On the surface, the crew meets villagers who dress in homemade uniforms, carry wooden approximations of phasers, and perform ritualized bridge procedures based on half-remembered Starfleet actions. Their leader, Dr. Boons, reveres a crashed shuttle as sacred relic, believing its original crew were legendary heroes who promised to protect them from a looming \"galactic evil.\" Dal and his friends struggle not to laugh while also recognizing the gravity of Starfleet’s impact."
      },
      {
        "Header": "Act II",
        "Text": "The crew discovers that the so-called \"evil\" is actually a dangerous local phenomenon exacerbated by misused Starfleet technology from the shuttle. The Enderprizians’ attempts to emulate Starfleet bravery have unwittingly placed them in greater danger. Gwyn and Rok-Tahk form bonds with the villagers, who are desperate to live up to the ideals they only partially understand."
      },
      {
        "Header": "Act III",
        "Text": "Working together, the Protostar crew repairs the old shuttle’s systems and uses both it and their own ship to neutralize the threat. Dal performs a theatrical \"captain\" moment to reassure the villagers, while Zero and Jankom quietly do the real technical heavy lifting. The kids help the Enderprizians see that being Starfleet-like is less about costumes and more about courage, cooperation, and compassion."
      },
      {
        "Header": "Tag",
        "Text": "Before departing, the crew leaves behind clearer records and safer technology so the villagers will not be left with only myths. Rok-Tahk reflects on how stories can distort reality but also inspire real heroism. Janeway notes that this world is a living example of why the Prime Directive exists—and how even well-meaning contact can echo for generations."
      }
    ],
    "EthicalIssues": [
      "The unintended cultural contamination that can result from a single Starfleet crash.",
      "Balancing respect for a society’s beliefs with the need to correct dangerous misunderstandings.",
      "Whether it is right to lean into a myth about yourself if doing so saves lives."
    ],
    "ContinuityNotes": [
      "Connects thematically to earlier episodes about Prime Directive breaches and misinterpreted Starfleet influence.",
      "Contains nods to classic Starfleet ships and shuttlecraft from the TOS era.",
      "Shows how legends of Starfleet can spread even far from Federation space."
    ],
    "ThematicNotes": [
      "Stories as both distortions and sources of inspiration.",
      "The difference between playing at heroism and practicing it.",
      "How ideals can survive in unexpected forms even when the facts are muddled."
    ],
    "BehindTheScenes": [
      "Pays affectionate homage to The Original Series through the villagers’ stagey reenactments of Starfleet behavior.",
      "Uses humor and parody to explore serious questions about legacy and influence.",
      "Quickly became a fan-favorite for blending heart, comedy, and meta-commentary on Star Trek itself."
    ]
  },
  {
    "ID": "pros1e14",
    "Title": "Crossroads",
    "Series": "PRO",
    "Season": 1,
    "Episode": 14,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "Barniss Frex",
      "Thadiun Okona",
      "Tysess",
      "Asencia",
      "Outpost traders and travelers"
    ],
    "Antagonists": [
      "Miscommunication and mistrust between the Protostar crew and Starfleet",
      "The living construct, which makes contact with Starfleet inherently dangerous"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Determined to protect Starfleet from the living construct, the Protostar crew hides their ship under ice near a bustling frontier outpost. They plan to approach Starfleet representatives on foot, explain their situation, and beg for help without bringing the weapon itself too close."
      },
      {
        "Header": "Act I",
        "Text": "At the outpost, Dal and his friends quickly become overwhelmed by alien crowds and the complexity of negotiating with strangers. They cross paths with the roguish Thadiun Okona and, unexpectedly, with Vice Admiral Janeway and her officers, who are also investigating the mysterious Protostar. Each side speaks to the other without realizing who they really are, sowing the seeds for tragic misunderstanding."
      },
      {
        "Header": "Act II",
        "Text": "Barniss Frex reaches the outpost and paints the kids as saboteurs and terrorists, confirming Janeway’s worst fears. A chaotic sequence of near-encounters and mistaken identities follows as the Protostar crew tries to avoid arrest while still hoping to win Janeway’s trust. Asencia quietly manipulates events to keep the two groups from making honest contact, deepening the rift."
      },
      {
        "Header": "Act III",
        "Text": "When security forces move in, Dal and the others flee back to their hidden ship with Okona’s reluctant help. The Protostar breaks free of the ice just as the Dauntless arrives, setting off a high-speed pursuit through the system. From Janeway’s perspective, the unknown ship is fleeing justice; from the kids’ point of view, Starfleet has become just another threat they must outrun."
      },
      {
        "Header": "Tag",
        "Text": "With the chase underway, Janeway vows to stop the Protostar before it can bring its weapon to Federation space. On the Protostar, the crew is devastated that their attempt to do the right thing has backfired so badly. The episode ends with both captains convinced they are protecting Starfleet, yet further from understanding each other than ever."
      }
    ],
    "EthicalIssues": [
      "How quickly fear and incomplete information can turn potential allies into adversaries.",
      "The responsibility to hear out strangers before condemning them, especially in crisis.",
      "Whether running from authority is justified when trying to shield that authority from danger."
    ],
    "ContinuityNotes": [
      "Brings Thadiun Okona back into the franchise after his appearance in Star Trek: The Next Generation.",
      "Shows the Dauntless and Protostar in direct opposition for the first time.",
      "Builds on Barniss Frex’s earlier encounter to make him a key witness shaping Janeway’s views."
    ],
    "ThematicNotes": [
      "Crossed signals and missed chances at understanding.",
      "The thin line between fugitive and hero depending on perspective.",
      "How systemic trust can be undermined by a few bad data points."
    ],
    "BehindTheScenes": [
      "Structurally plays like a farce wrapped around a chase thriller, with near-misses driving the plot.",
      "Uses the busy outpost setting to evoke classic Trek frontier locations.",
      "Further positions Vice Admiral Janeway as a sympathetic but misguided antagonist to the young heroes."
    ]
  },
  {
    "ID": "pros1e15",
    "Title": "Masquerade",
    "Series": "PRO",
    "Season": 1,
    "Episode": 15,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Dr. Jago",
      "Thadiun Okona",
      "Asencia",
      "Tysess"
    ],
    "Antagonists": [
      "Scientists who see Dal’s genetic makeup as an experiment to be optimized",
      "Pursuing Romulan agents and the Dauntless’ relentless hunt"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Still hunted by the Dauntless, the Protostar seeks refuge at a bustling waystation near the Romulan Neutral Zone. There, the crew meets Dr. Jago, a brilliant but ethically questionable geneticist who shows keen interest in Dal’s unusual physiology."
      },
      {
        "Header": "Act I",
        "Text": "Struggling with feelings of inadequacy as captain, Dal becomes fascinated when Jago claims she can unlock his \"true potential.\" She reveals that he is an engineered hybrid created from the DNA of multiple species as part of a forbidden augmentation program. The revelation shakes Dal’s sense of identity but also tempts him with the promise of instant improvement."
      },
      {
        "Header": "Act II",
        "Text": "Against Janeway’s warnings and his friends’ misgivings, Dal agrees to an experimental procedure that enhances his abilities. At first, he revels in newfound reflexes and intelligence, but the changes quickly spiral into instability and erratic behavior. Meanwhile, Romulan agents close in on the station, eager to capture the Protostar or its crew, and the Dauntless draws ever nearer."
      },
      {
        "Header": "Act III",
        "Text": "As Dal loses control, he endangers his friends and nearly sabotages their escape. Realizing that becoming a better captain cannot be shortcut through genetic tampering, he chooses to reverse the procedure despite the pain and the risk of losing his enhancements. The crew narrowly flees the converging threats, with Okona peeling away on his own once again."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard the Protostar, Dal wrestles with the knowledge of what he is and what he is not. His friends insist that his worth comes from his choices, not his genome, and Janeway notes that Starfleet has strict reasons for banning such augmentation. Dal quietly resolves to earn his crew’s trust the hard way rather than chasing quick fixes."
      }
    ],
    "EthicalIssues": [
      "Genetic augmentation and the exploitation of engineered children as experiments.",
      "Using a person’s insecurity as leverage for risky medical procedures.",
      "The question of whether engineered individuals should be held accountable for rules they never agreed to."
    ],
    "ContinuityNotes": [
      "Connects Dal’s origins to the wider Star Trek history of genetic engineering and augmentation bans.",
      "Foreshadows future complications with Starfleet policy regarding Dal’s status.",
      "Further characterizes the Dauntless crew’s pursuit as relentless and politically sensitive near the Neutral Zone."
    ],
    "ThematicNotes": [
      "Identity, self-worth, and the temptation to become someone \"better\" overnight.",
      "The dangers of chasing power without considering the responsibilities that come with it.",
      "Friends as the anchor that pulls someone back from self-destructive choices."
    ],
    "BehindTheScenes": [
      "Provides crucial backstory for Dal while tying Prodigy into long-standing Trek lore about augments.",
      "Balances body-horror elements of uncontrolled enhancement with character-driven drama.",
      "Continues the trend of giving each crew member a major growth episode in the back half of the season."
    ]
  },
  {
    "ID": "pros1e16",
    "Title": "Preludes",
    "Series": "PRO",
    "Season": 1,
    "Episode": 16,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Asencia",
      "Tysess",
      "Vau N'Akat figures from the Diviner’s past"
    ],
    "Antagonists": [
      "The harsh circumstances that shaped each crew member’s early life",
      "The Vau N'Akat civil war and its fallout"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "In a rare moment of relative safety, the Protostar crew shelters in a nebula, licking their wounds from recent close calls. Janeway encourages them to use the downtime to share their stories and better understand one another. Meanwhile, aboard the Dauntless, the Diviner’s fragmented memories begin to return under Asencia’s watchful eye."
      },
      {
        "Header": "Act I",
        "Text": "Rok-Tahk relates how she was miscast as a menacing arena fighter despite her gentle nature, yearning for a life of science rather than spectacle. Zero recalls how their curiosity led them away from the Medusan collective and how being weaponized by the Diviner left deep scars. Each tale underscores how the crew were all, in different ways, trapped before they ever reached Tars Lamora."
      },
      {
        "Header": "Act II",
        "Text": "Jankom Pog describes his time among Tellarites on a generational ship and the circumstances that left him drifting alone in space. Dal revisits his earliest memories with DaiMon Nandi and the realization that his so-called family saw him as disposable. Gwyn, in turn, reveals more about growing up under the Diviner’s control and the burden of being groomed as his heir."
      },
      {
        "Header": "Act III",
        "Text": "On the Dauntless, the Diviner’s own flashbacks reveal his homeworld of Solum, the first contact with the Federation that led to civil war, and the creation of the living construct as a desperate, vengeful answer. Asencia drops her facade and reveals herself to be another Vau N'Akat operative, fully aligned with the Diviner’s mission. Janeway, still in the dark about the true nature of her officers’ loyalties, focuses on her pursuit of the Protostar."
      },
      {
        "Header": "Tag",
        "Text": "Back on the Protostar, the kids realize that despite their wildly different backgrounds, they all share a longing for belonging and a chance to choose their own paths. Janeway notes that many great Starfleet officers started with pain and loss but found purpose in service. The episode closes with both crews heading toward an inevitable collision, shaped by the preludes that brought them here."
      }
    ],
    "EthicalIssues": [
      "The manipulation of children and refugees as tools in larger political struggles.",
      "The ethics of retroactively blaming an entire organization for the fallout from first contact.",
      "How cycles of trauma and revenge perpetuate conflict across generations."
    ],
    "ContinuityNotes": [
      "Provides fuller context for the Vau N'Akat homeworld, Solum, and its civil war after first contact with the Federation.",
      "Clarifies Asencia’s role as the Vindicator, an undercover operative aboard the Dauntless.",
      "Deepens the backstories hinted at for each of the main Protostar crew members."
    ],
    "ThematicNotes": [
      "Origins and how they shape—but do not define—who someone can become.",
      "The ways people cope with abandonment, exploitation, and loss.",
      "The fork in the road between using trauma as justification for vengeance versus seeking a better path."
    ],
    "BehindTheScenes": [
      "Structured as a character-centric anthology episode, knitting together multiple origin stories.",
      "Helps newer viewers emotionally invest in the entire ensemble before the finale arc.",
      "Bridges personal backstories with the larger myth arc involving Solum and the living construct."
    ]
  },
  {
    "ID": "pros1e17",
    "Title": "Ghost in the Machine",
    "Series": "PRO",
    "Season": 1,
    "Episode": 17,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Holodeck characters from various programs"
    ],
    "Antagonists": [
      "Sabotaged holodeck systems subtly controlled by the living construct",
      "The crew’s own distractions as they seek escapism"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Exhausted from constant pursuit, the Protostar crew agrees to relax with time on the holodeck. They load several different programs tailored to their interests, from mystery capers to cozy fantasies, while Janeway promises to keep an eye on the ship."
      },
      {
        "Header": "Act I",
        "Text": "Strange glitches begin to appear across all the programs: settings bleed together, characters behave off-model, and exits vanish. At first, the kids assume it’s just a malfunction or Janeway trying to teach them something through an elaborate simulation. But when environmental hazards become genuinely life-threatening, it becomes clear that something more sinister is at work."
      },
      {
        "Header": "Act II",
        "Text": "The crew realizes they are trapped inside a nested holodeck environment with no straightforward way to shut it down. Janeway herself appears confused and constrained, her control over the ship’s systems compromised. Zero deduces that the living construct is manipulating the Protostar’s computers to delay them and steer the ship on a dangerous heading toward Federation space."
      },
      {
        "Header": "Act III",
        "Text": "Fighting through increasingly hostile and surreal holodeck scenarios, the crew uses clues hidden in each program to trace the sabotage back to its source. They work together to force a manual shutdown and reboot, restoring Janeway’s proper functionality and regaining helm control just in time. The incident proves that the weapon is not just dormant hardware but an active, insidious presence aboard the ship."
      },
      {
        "Header": "Tag",
        "Text": "Shaken, the crew debates whether they can ever truly trust their own systems again. Janeway apologizes for not noticing the intrusion sooner and warns that the living construct’s influence is growing as they draw nearer to Starfleet. The holodeck, once a source of escape, now feels like a reminder that there are no safe illusions while the weapon remains on board."
      }
    ],
    "EthicalIssues": [
      "The risk of relying on immersive simulations when critical systems can be compromised.",
      "Artificial intelligence and computer control exploited as a vector for sabotage.",
      "The temptation to hide in fantasy instead of facing a looming moral crisis."
    ],
    "ContinuityNotes": [
      "Reinforces Trek’s long tradition of holodeck malfunctions with a new, weapon-driven twist.",
      "Clarifies that the living construct can actively shape ship behavior, not merely send a signal.",
      "Raises the stakes for bringing the Protostar anywhere near a Starfleet network."
    ],
    "ThematicNotes": [
      "Illusion versus reality and the danger of losing the ability to tell them apart.",
      "The necessity of staying vigilant even when rest is desperately needed.",
      "Technology as both a gift and a potential prison."
    ],
    "BehindTheScenes": [
      "Allows for playful genre shifts as the holodeck cycles through multiple program styles.",
      "Uses a bottle-episode structure to explore the crew’s inner lives under pressure.",
      "Serves as a key setup episode for the high-stakes finale that follows."
    ]
  },
  {
    "ID": "pros1e18",
    "Title": "Mindwalk",
    "Series": "PRO",
    "Season": 1,
    "Episode": 18,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "Tysess",
      "Asencia",
      "The Diviner"
    ],
    "Antagonists": [
      "A freak telepathic event that swaps Dal and Admiral Janeway’s minds",
      "Asencia’s deepening sabotage aboard the Dauntless"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With the Dauntless closing in, Zero attempts a long-range telepathic contact to warn Admiral Janeway about the living construct. A nearby spatial anomaly interferes, triggering an unexpected side effect: Dal and Janeway suddenly find their consciousnesses swapped between bodies."
      },
      {
        "Header": "Act I",
        "Text": "Dal awakens aboard the Dauntless in Janeway’s body, surrounded by officers who expect the composed leadership of a decorated admiral. On the Protostar, Janeway-in-Dal is horrified to find herself in a teenage frame with a panicked crew. Both must quickly adapt, hiding the swap long enough to use the opportunity to avert catastrophe."
      },
      {
        "Header": "Act II",
        "Text": "Dal, struggling to mimic Janeway’s authority, tries to steer the Dauntless away from attacking the Protostar or calling in more ships. His clumsy efforts raise suspicions from Tysess and Asencia, who quietly test their \"admiral\" for inconsistencies. Meanwhile, Janeway uses Dal’s body to earn the Protostar crew’s trust and gather first-hand evidence of the living construct’s threat."
      },
      {
        "Header": "Act III",
        "Text": "Asencia reveals her true allegiance to the Diviner, capitalizing on Dal’s missteps to paint \"Janeway\" as compromised. In a race against time, Janeway and Dal coordinate across ships to recreate the anomaly’s conditions and reverse the mind-swap. They succeed just as a mutiny on the Dauntless seems imminent, restoring each to their proper bodies with new insight into the other’s burdens."
      },
      {
        "Header": "Tag",
        "Text": "Now understanding the kids’ sincerity, the real Janeway is more conflicted than ever about her orders to stop the Protostar. Dal, humbled by his disastrous attempt at being an admiral, gains a deeper respect for leadership and for Janeway herself. Asencia, however, has moved her plans forward, setting the stage for the living construct’s terrible activation."
      }
    ],
    "EthicalIssues": [
      "Using risky telepathic experiments in a desperate attempt to communicate across hostile lines.",
      "The violation of bodily autonomy inherent in any mind-swap, even accidental.",
      "How much deception is justified when trying to avert mass destruction."
    ],
    "ContinuityNotes": [
      "Recalls earlier Trek episodes that featured body- or mind-swapping, now framed for a younger audience.",
      "Gives Admiral Janeway direct experience with the Protostar crew’s perspective.",
      "Further exposes Asencia’s long game aboard the Dauntless."
    ],
    "ThematicNotes": [
      "Empathy born from literally walking in someone else’s body.",
      "The gap between how leadership looks from the outside and what it feels like from the inside.",
      "Trust, and how quickly it can be eroded when behavior suddenly changes."
    ],
    "BehindTheScenes": [
      "Allows Kate Mulgrew to play a more comedic, Dal-like Janeway while also honoring the character’s gravitas.",
      "Provides a fun high-concept premise with serious consequences for the arc.",
      "Acts as a pivot point where Janeway begins to truly question the official narrative about the Protostar."
    ]
  },
  {
    "ID": "pros1e19",
    "Title": "Supernova, Part 1",
    "Series": "PRO",
    "Season": 1,
    "Episode": 19,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "The Diviner",
      "Tysess",
      "Asencia",
      "Starfleet captains and crews aboard nearby ships"
    ],
    "Antagonists": [
      "The living construct, fully activated within the Protostar",
      "A growing web of Starfleet ships unwittingly turned against one another"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Despite the mind-swap incident, the Dauntless finally corners the Protostar near Federation space. Janeway attempts one more time to hail the mysterious ship peacefully, unaware that Asencia is preparing to unleash the living construct’s true power."
      },
      {
        "Header": "Act I",
        "Text": "As soon as the Protostar connects to Starfleet communications, the living construct activates, sending out a corrupting signal through subspace. Starfleet vessels that attempt to assist suddenly turn their weapons on each other, systems misreading allies as enemies. Horrified, both Janeway and the Protostar crew watch a rescue effort become a self-destructive melee."
      },
      {
        "Header": "Act II",
        "Text": "The kids try to sever all links to Starfleet networks, but the more ships arrive to help, the faster the signal spreads. Asencia fully reveals herself as the Vindicator, taking control of the Dauntless bridge and aligning with the Diviner’s original mission. Janeway and her loyal officers are forced into the brig as the situation spirals out of control."
      },
      {
        "Header": "Act III",
        "Text": "On the Protostar, the crew realizes that any attempt to run toward Federation space will only pull more ships into the deadly web. Gwyn confronts her father as fragments of his memory return, begging him to see that genocidal revenge is not justice. The Diviner, torn between his grief for Solum and his love for Gwyn, begins to question the path that led him here."
      },
      {
        "Header": "Tag",
        "Text": "The battle among Starfleet vessels rages on, a horrifying mirror of the civil war that destroyed Solum. The Diviner ultimately sacrifices himself to protect Gwyn and Janeway from Asencia’s wrath, dying in his daughter’s arms. The Protostar crew, wracked with guilt, realizes that the only way to save the Federation may be to destroy their own ship."
      }
    ],
    "EthicalIssues": [
      "Weaponizing trust networks so that systems designed for cooperation become tools of self-destruction.",
      "The line between justice for a destroyed world and revenge against those who survived.",
      "Sacrificing one’s life to atone for past crimes and prevent new ones."
    ],
    "ContinuityNotes": [
      "Depicts one of the most direct threats to Starfleet’s own cohesion in the 24th-century timeline.",
      "Clarifies the living construct’s function as a signal-based weapon tailored specifically to Starfleet technology.",
      "Brings the Diviner’s arc to a tragic but redemptive close."
    ],
    "ThematicNotes": [
      "Cycles of violence and the painful choice to break them.",
      "How weapons built from fear can endanger exactly what they were meant to protect.",
      "Redemption through self-sacrifice, even after terrible choices."
    ],
    "BehindTheScenes": [
      "Part one of a two-episode finale that significantly raises the show’s stakes.",
      "Uses large-scale space battle visuals to dramatize an essentially software-based weapon.",
      "Interweaves personal confrontations with franchise-level consequences for Starfleet."
    ]
  },
  {
    "ID": "pros1e20",
    "Title": "Supernova, Part 2",
    "Series": "PRO",
    "Season": 1,
    "Episode": 20,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Vice Admiral Janeway"
    ],
    "GuestCharacters": [
      "Tysess",
      "Asencia",
      "Starfleet command representatives"
    ],
    "Antagonists": [
      "The lingering spread of the living construct’s signal",
      "Political resistance within Starfleet to accepting the Protostar crew"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With the living construct’s signal still cascading through Starfleet systems, the Protostar crew and Janeway search for a way to stop it without destroying the Federation’s rescue fleet. Every conventional solution risks amplifying the damage."
      },
      {
        "Header": "Act I",
        "Text": "Gwyn remembers enough of the weapon’s design to confirm that the Protostar itself is the key node in the destructive network. The only sure way to neutralize the signal is to send the ship far from any Starfleet assets and destroy it in a controlled protostar detonation. Realizing what this means, the kids face the prospect of sacrificing their home and only way to reach the Federation."
      },
      {
        "Header": "Act II",
        "Text": "The crew evacuates onto escape pods and a commandeered Dauntless shuttle, leaving Janeway’s holographic counterpart behind to pilot the Protostar on its final mission. Emotional goodbyes underscore how much Janeway has become family to them despite being a program. She accepts the task, treating it as one last duty as their captain and teacher."
      },
      {
        "Header": "Act III",
        "Text": "The Protostar jumps to a remote region and initiates a controlled overload, obliterating the ship and erasing the construct’s influence from Starfleet networks. In the aftermath, the Federation counts its losses but avoids total catastrophe. The crew is brought to Federation space at last, only to learn that Starfleet regulations and politics make their admission to the Academy anything but straightforward."
      },
      {
        "Header": "Tag",
        "Text": "Janeway advocates fiercely for the kids, arguing that they have already acted with the best of Starfleet’s ideals. Starfleet commanders grant them a special status and training opportunity, with the promise of future cadetships. Gwyn chooses to return to Solum to try to prevent the civil war she knows is coming, while the others join Janeway aboard a new ship, setting out on a mission to find Chakotay and write the next chapter of their story."
      }
    ],
    "EthicalIssues": [
      "Destroying a one-of-a-kind starship to safeguard countless lives.",
      "Whether young heroes who saved the Federation should still be constrained by rules written for a different context.",
      "Choosing to leave friends and safety behind to confront the roots of a future catastrophe."
    ],
    "ContinuityNotes": [
      "Ends the immediate threat of the living construct while leaving the Vau N'Akat timeline unresolved.",
      "Positions the crew for future adventures under Janeway’s mentorship and hints at the search for Chakotay.",
      "Establishes Gwyn’s mission to Solum as a time-sensitive attempt to alter her people’s fate."
    ],
    "ThematicNotes": [
      "Letting go of the past—including a beloved ship—to build a better future.",
      "Recognition and belonging after a long journey spent proving oneself.",
      "The idea that the end of one voyage is the beginning of another."
    ],
    "BehindTheScenes": [
      "Concludes Prodigy’s first season on both an intimate and franchise-significant note.",
      "Features emotional farewells to the Protostar and Hologram Janeway while keeping the door open for future appearances.",
      "Reinforces Prodigy’s role as a bridge between classic Star Trek values and a new generation of characters and viewers."
    ]
  },
  {
    "ID": "pros2e1",
    "Title": "Into the Breach, Part I",
    "Series": "PRO",
    "Season": 2,
    "Episode": 1,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Admiral Janeway"
    ],
    "GuestCharacters": [
      "Maj'el",
      "Tysess",
      "Dr. Noum",
      "Starfleet warrant officer trainees and crew of the U.S.S. Voyager-A"
    ],
    "Antagonists": [
      "The unstable wormhole created by the Protostar’s final mission",
      "Starfleet’s secrecy about the true stakes of Janeway’s assignment"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Some time after the destruction of the Protostar, Dal, Rok-Tahk, Zero, Jankom, Murf, and Gwyn are reunited at Starfleet Headquarters. They are thrilled to learn they will serve together as warrant officers in training under Admiral Kathryn Janeway on the newly commissioned U.S.S. Voyager-A. Their first glimpse of the ship makes it feel as if their dream of truly joining Starfleet is finally coming true."
      },
      {
        "Header": "Act I",
        "Text": "Once aboard Voyager-A, the crew quickly realizes that training under the real Janeway is very different from the nurturing guidance of her holographic counterpart. Janeway and her senior officers put the kids through rigorous drills, debriefing them about the Protostar, the living construct, and their unusual experiences with time. Dal chafes at the return to classroom duties and starts looking for a \"real\" mission that will prove they belong in the big leagues."
      },
      {
        "Header": "Act II",
        "Text": "Janeway quietly meets with her command staff and reveals Voyager’s true classified assignment: track the lingering signature of the Protostar’s final jump and locate Captain Chakotay, lost decades in the future on the world of Solum. The warrant officers overhear fragments of this briefing and deduce that the wormhole created by the Protostar still exists and may be reopened. Dal convinces his friends that if they can help Janeway succeed, they will prove they are more than just a PR success story."
      },
      {
        "Header": "Act III",
        "Text": "As Voyager-A approaches the damaged region of space where the wormhole once formed, temporal eddies begin to buffet the ship. Sensors pick up echoes of Chakotay’s old distress signal, and Gwyn feels an eerie resonance with the timeline she once glimpsed. Under the guise of a training exercise, Dal maneuvers the group into key posts on the bridge so they can participate when the crucial moment comes."
      },
      {
        "Header": "Tag",
        "Text": "Janeway orders Voyager to hold position at the edge of the anomaly, determined to proceed cautiously despite mounting pressure from Starfleet Command to secure concrete results. The young warrant officers share a quiet moment in the observation lounge, vowing to help bring Chakotay home and avert the dark future that once destroyed Solum—even if it means plunging back into the unknown breach ahead."
      }
    ],
    "EthicalIssues": [
      "Using recently traumatized teenagers as frontline personnel on a sensitive temporal mission.",
      "The tension between Starfleet’s need for secrecy and the crew’s right to understand the risks they face.",
      "Balancing enthusiasm for adventure with the responsibilities of real Starfleet service."
    ],
    "ContinuityNotes": [
      "Picks up after the events of \"Supernova, Part 2,\" with the Protostar destroyed and its crew now training under Admiral Janeway.",
      "Introduces the U.S.S. Voyager-A as Janeway’s new command and the primary setting for Season 2.",
      "Establishes the search for Captain Chakotay and the attempt to repair the Solum timeline as the season’s overarching mission."
    ],
    "ThematicNotes": [
      "Graduating from survival to service as the crew transitions from fugitives to warrant officers.",
      "The excitement and anxiety of being given a second chance to make things right.",
      "How mentorship changes when the stakes and expectations are suddenly higher."
    ],
    "BehindTheScenes": [
      "Acts as a soft pilot for the new status quo aboard Voyager-A, reintroducing the main cast in their Starfleet training roles.",
      "Brings Kate Mulgrew fully into the story as Admiral Janeway commanding a starship rather than a holographic mentor.",
      "Begins the season’s time-travel arc by tying directly into the wormhole created in the Season 1 finale."
    ]
  },
  {
    "ID": "pros2e2",
    "Title": "Into the Breach, Part II",
    "Series": "PRO",
    "Season": 2,
    "Episode": 2,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Admiral Janeway"
    ],
    "GuestCharacters": [
      "Captain Chakotay",
      "Asencia",
      "Ilthuran and other Vau N'Akat figures",
      "Maj'el",
      "Starfleet officers aboard Voyager-A"
    ],
    "Antagonists": [
      "Temporal turbulence around the wormhole to Solum",
      "Asencia’s sabotage of Gwyn’s efforts to save her homeworld",
      "The mysterious entity lurking within the rift"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Voyager-A enters the edge of the temporal breach, using carefully tuned deflectors and experimental safeguards to stabilize the wormhole leading to Solum’s future. Janeway briefs the kids on a limited observation mission, but Gwyn insists on going further: if they can change Solum’s history, she believes they can prevent its civil war."
      },
      {
        "Header": "Act I",
        "Text": "A small team including Gwyn, Dal, and Zero takes a shuttle into the breach while Voyager remains tethered by a temporal anchor. Within the rift, they encounter fragmented images of Solum—flashes of the devastated future timeline they once saw and glimpses of an alternate, more hopeful path. An unknown presence seems to guide their course, nudging them away from catastrophic outcomes."
      },
      {
        "Header": "Act II",
        "Text": "On Solum, Gwyn materializes years ahead, in a period where her people are on the brink of war over first contact with the Federation. She attempts to warn key leaders about the coming civil conflict, arguing for cooperation rather than isolation. However, Asencia and hardline Vau N'Akat factions undermine her at every turn, painting her as a traitor who has been corrupted by Starfleet."
      },
      {
        "Header": "Act III",
        "Text": "Back in the breach, the Voyager-A team detects growing instability in the wormhole, with the risk that it may collapse or scatter them across time. The mysterious entity manifests as a flicker in the anomaly, interfering with sensor readings even as it subtly shields the shuttle from the worst turbulence. As Asencia’s sabotage on Solum triggers violent unrest, Gwyn’s attempt to fix history is thrown into chaos."
      },
      {
        "Header": "Tag",
        "Text": "Just as the situation on Solum threatens to spiral out of control, a surge from the entity disrupts the tether between the shuttle and Voyager. Janeway watches in horror as the shuttle—and her young warrant officers—are abruptly pulled deeper into the breach and vanish from her sensors. The Prodigy crew finds themselves flung helplessly toward an unknown point in time and space, realizing they have been cast into a new chapter of their mission."
      }
    ],
    "EthicalIssues": [
      "The dangers of interfering directly in a planet’s history, even with the goal of preventing war.",
      "Using young officers as temporal envoys in politically volatile situations.",
      "Asencia’s willingness to manipulate history and her own people to ensure a particular outcome."
    ],
    "ContinuityNotes": [
      "Continues the temporal storyline introduced in Part I and the Solum backstory from Season 1.",
      "Builds on Gwyn’s role as a would-be peacemaker for her homeworld and Asencia’s opposing agenda.",
      "Introduces the mysterious entity in the rift that will later be revealed as a key ally in the season’s arc."
    ],
    "ThematicNotes": [
      "The burden of trying to fix an entire world’s fate.",
      "How good intentions can still trigger unintended consequences when meddling with time.",
      "Trusting unseen guidance when confronted with forces far beyond ordinary Starfleet experience."
    ],
    "BehindTheScenes": [
      "Completes the two-part season premiere and fully propels the crew into the time-travel portion of the season.",
      "Deepens the lore around Solum and the Vau N'Akat, tying emotional stakes to large-scale temporal events.",
      "Foregrounds Gwyn’s arc as someone torn between Starfleet and her homeworld’s future."
    ]
  },
  {
    "ID": "pros2e3",
    "Title": "Who Saves the Saviors",
    "Series": "PRO",
    "Season": 2,
    "Episode": 3,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Captain Chakotay",
      "Future Vau N'Akat survivors",
      "Temporal refugees on Solum"
    ],
    "Antagonists": [
      "The ravaged future of Solum created by time paradoxes",
      "Paradoxical effects that threaten Gwyn’s existence"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The shuttle crash-lands on a ruined future version of Solum, centuries after the civil war that Gwyn had hoped to prevent. The skies are choked with debris from orbital wreckage, and the once-advanced cities lie in ruins. The team soon learns that Chakotay’s last transmissions came from this shattered timeline."
      },
      {
        "Header": "Act I",
        "Text": "Exploring the desolate landscape, the crew discovers pockets of survivors who recognize Starfleet uniforms only as symbols from old stories. They eventually locate a hardened but still determined Captain Chakotay, who has spent years fighting to minimize the damage caused by the temporal disruptions. Chakotay explains that earlier attempts to fix the timeline have only made the paradoxes worse—and that Gwyn herself may be at the center of the knot."
      },
      {
        "Header": "Act II",
        "Text": "Chakotay reveals that in this divergent future, Gwyn’s efforts to change Solum’s path created conflicting historical echoes: timelines where she lived, died, or never existed at all. These overlapping possibilities now threaten to erase her entirely as the paradox seeks \"consistency.\" Gwyn struggles with the realization that her noble attempts to save her people may have instead doomed them."
      },
      {
        "Header": "Act III",
        "Text": "The crew and Chakotay work with Hologram Janeway to chart out a risky plan: they will use remaining Vau N'Akat temporal technology to create a controlled time jump that sends them back to a key branching point. However, the move could collapse this version of the timeline, effectively erasing the people they have just met. Dal and the others grapple with whether they have the right to overwrite an entire reality, even a broken one, in order to save countless lives elsewhere."
      },
      {
        "Header": "Tag",
        "Text": "As temporal instability intensifies and parts of the city flicker in and out of existence, Gwyn makes a painful choice: she will risk her own existence to give Solum and the Federation a chance at a better timeline. Chakotay agrees to accompany them into the breach, leaving behind the survivors he has fought beside for years. The crew activates the device and jumps, as the ruined world around them begins to unravel like a fading memory."
      }
    ],
    "EthicalIssues": [
      "The moral weight of overwriting an entire timeline, even one filled with suffering.",
      "Sacrificing one reality—and its inhabitants—for the possibility of a better future elsewhere.",
      "Gwyn’s willingness to risk her own existence in order to repair damage she feels responsible for."
    ],
    "ContinuityNotes": [
      "Brings Captain Chakotay fully into the narrative after being a distant presence in Season 1.",
      "Expands on the consequences of the Protostar’s original mission and the time-travel disruptions it created.",
      "Further defines Solum’s fractured future and the paradox that threatens Gwyn."
    ],
    "ThematicNotes": [
      "Who rescues the rescuers when their efforts go wrong.",
      "The cost of heroism in a universe where time itself can break.",
      "The idea that acknowledging past mistakes is the first step in truly repairing them."
    ],
    "BehindTheScenes": [
      "Serves as a centerpiece episode for Chakotay, finally bringing him face-to-face with the Prodigy crew.",
      "Explores heavier science-fiction concepts, like competing timelines and erasure, in an emotionally grounded way.",
      "Helps set up the later arc in which the crew must keep adjusting the timeline to avert catastrophe for both Solum and Starfleet."
    ]
  },
  {
    "ID": "pros2e4",
    "Title": "Temporal Mechanics 101",
    "Series": "PRO",
    "Season": 2,
    "Episode": 4,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Captain Chakotay"
    ],
    "GuestCharacters": [
      "The mysterious temporal entity",
      "Alternate-timeline echoes of Solum"
    ],
    "Antagonists": [
      "The dark future timeline collapsing around the crew",
      "The inherent instability of repeated temporal manipulations"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The crew, Chakotay, and Gwyn emerge from their jump still trapped in the far future, but closer to the branching point where Solum’s fate was sealed. Temporal storms rage overhead, and local reality stutters as cause and effect slip out of order. Janeway grimly observes that they have entered a textbook example of a \"temporal convergence\"—only there is no textbook for getting out."
      },
      {
        "Header": "Act I",
        "Text": "Zero, Rok-Tahk, and Jankom collaborate to map out the distorted local spacetime, turning their crisis into a crash course in advanced temporal mechanics. They determine that if they can find the moment Gwyn’s earlier actions diverged from the original timeline, they can insert a new corrective event that preserves her life while avoiding civil war. The mysterious entity that has been nudging them reveals itself more clearly through glimpses and whispered prompts."
      },
      {
        "Header": "Act II",
        "Text": "Following the entity’s guidance, the crew splits up to interact with different \"layers\" of the fractured timeline—some only seconds apart, others decades. They witness alternate versions of key historical events on Solum, including different outcomes of the Federation’s first contact. Gwyn is forced to confront versions of herself who made different choices, each with different costs."
      },
      {
        "Header": "Act III",
        "Text": "Using the data they have gathered, the crew executes a synchronized temporal maneuver: Zero coordinates a multidimensional feedback pulse while Janeway and Chakotay position the ship at the convergence point. The resulting cascade fuses several competing histories into a single, more stable line—one in which Solum is still at risk but no longer doomed to immediate annihilation, and Gwyn’s existence is secured. The maneuver also opens a return path to their own present, though it comes with warnings from the entity about what still lies ahead."
      },
      {
        "Header": "Tag",
        "Text": "Flung back toward their proper timeframe, the crew glimpses a final vision of the entity that has been helping them: a shimmering figure whose identity remains tantalizingly unclear. Janeway remarks that they will have to wait for \"Temporal Mechanics 201\" to fully understand what just happened. For now, they celebrate having saved Gwyn’s life and bought Solum another chance—even as they brace for the paradoxes that surely remain."
      }
    ],
    "EthicalIssues": [
      "Deciding which timeline deserves to survive when multiple possible histories exist.",
      "Using advanced temporal technology without fully understanding its long-term consequences.",
      "Playing \"cosmic editor\" with an entire civilization’s past and future."
    ],
    "ContinuityNotes": [
      "Builds directly on the events of \"Who Saves the Saviors\" and further clarifies Solum’s shifting temporal history.",
      "Foreshadows the later reveal of the mysterious entity’s true identity and role in guiding the crew.",
      "Demonstrates how the crew’s scientific skills have grown since their days aboard the Protostar."
    ],
    "ThematicNotes": [
      "Learning, quite literally, from past mistakes.",
      "The idea that understanding the rules of a system is the first step toward changing it responsibly.",
      "The power of teamwork when confronting problems too complex for any one person—even a seasoned captain—to solve."
    ],
    "BehindTheScenes": [
      "Functions as the season’s signature \"time travel puzzle\" episode, emphasizing science and ingenuity over combat.",
      "Gives Rok-Tahk and Jankom Pog major scientific and engineering hero moments.",
      "Further cements Prodigy’s educational sci-fi angle by turning temporal paradoxes into something kids can follow and enjoy."
    ]
  },
  {
    "ID": "pros2e5",
    "Title": "Observer's Paradox",
    "Series": "PRO",
    "Season": 2,
    "Episode": 5,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Admiral Janeway"
    ],
    "GuestCharacters": [
      "Maj'el",
      "Tysess",
      "Dr. Noum",
      "Starfleet brass reviewing the mission"
    ],
    "Antagonists": [
      "Starfleet scrutiny of the kids’ role in recent temporal events",
      "The lingering time paradox tied to the lost Protostar",
      "Unclear signals that seem to come from Murf himself"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Safely back aboard Voyager-A, the crew expects congratulations for rescuing Gwyn and partially stabilizing Solum’s future. Instead, they find themselves confined to quarters as senior officers comb through logs and sensor data, questioning every decision they made. To Starfleet, the line between heroic problem-solvers and rogue time meddlers looks uncomfortably thin."
      },
      {
        "Header": "Act I",
        "Text": "Formal debriefings begin, with Janeway defending her warrant officers while Admiral-level oversight committees second-guess the mission. Dal, Gwyn, and the others are forced to relive their hardest choices, each wondering if they truly did the right thing. Meanwhile, Zero detects an odd, intermittent signal hidden in the ship’s background noise—one that seems to originate from Murf."
      },
      {
        "Header": "Act II",
        "Text": "As the kids investigate, they discover that Murf is unconsciously emitting encoded data bursts, apparently linked to their earlier encounter with the Protostar and the breach. Decryption reveals fragments of coordinates and temporal markers pointing to the Protostar’s last known trajectory, contradicting Starfleet’s belief that all traces of the ship were erased. The realization presents a new paradox: observing this data may be what ensures the Protostar’s fate, or alters it."
      },
      {
        "Header": "Act III",
        "Text": "Janeway must decide whether to report Murf’s signal to Starfleet Command, inviting more oversight, or keep it off the books to investigate quietly with her crew. The kids argue that if there is even a chance of finding the Protostar again, they have a duty to follow the trail and repair the remaining time fracture. Under pressure from both her superiors and her conscience, Janeway authorizes a limited, semi-classified mission to pursue the coordinates—on the condition that her warrant officers follow Starfleet protocol to the letter."
      },
      {
        "Header": "Tag",
        "Text": "As Voyager-A alters course, Murf burps out one last burst of data that completes the coordinate string, earning him unexpected credit as the \"mystery messenger\". The crew shares a relieved laugh, but the mood quickly sobers as they realize that staring too closely at the Protostar’s fate may change it yet again. Janeway muses that in temporal mechanics, the observer is never truly neutral—a lesson her young crew is about to learn the hard way."
      }
    ],
    "EthicalIssues": [
      "How much information Starfleet should share with—or withhold from—young officers about the risks they face.",
      "Whether to obey cautious orders or pursue a risky lead that could save countless lives.",
      "The concept that observation itself can influence events, especially in time-sensitive scenarios."
    ],
    "ContinuityNotes": [
      "Connects the aftermath of the opening temporal arc with a new thread focused on the lost Protostar.",
      "Highlights Starfleet’s institutional response to the events of Season 1 and the early Season 2 episodes.",
      "Establishes Murf as an unexpectedly important conduit for temporal information."
    ],
    "ThematicNotes": [
      "The feeling of being judged by those who only see your choices on a screen, not in the moment.",
      "The idea that truth can be both clarifying and destabilizing when time travel is involved.",
      "Trust between mentors and students when outside authorities question that relationship."
    ],
    "BehindTheScenes": [
      "Provides a breather between big action arcs while deepening the political and institutional stakes.",
      "Gives Murf a surprising plot function beyond comic relief, aligning with the episode’s title.",
      "Frames time travel not just as a physical problem but as an epistemological one—what you know changes what can happen."
    ]
  },
  {
    "ID": "pros2e6",
    "Title": "Imposter Syndrome",
    "Series": "PRO",
    "Season": 2,
    "Episode": 6,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Admiral Janeway"
    ],
    "GuestCharacters": [
      "Holographic doubles of the Protostar crew",
      "Voyager-A security personnel"
    ],
    "Antagonists": [
      "Runaway holographic duplicates created to cover the crew’s absence",
      "The crew’s growing doubt about whether they belong in Starfleet at all"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "To follow Murf’s proto-coordinates without attracting more scrutiny, the crew proposes an audacious workaround: they will create sophisticated holographic doubles of themselves to remain on Voyager-A, attending drills and check-ins, while the real kids slip away on a covert mission shuttle under Janeway’s supervision."
      },
      {
        "Header": "Act I",
        "Text": "Zero and Janeway fine-tune the holo-doubles to mimic the team’s speech patterns and quirks, while Dal can’t resist programming his duplicate to be a slightly more impressive version of himself. Initially, the deception works; Janeway’s senior staff sees nothing amiss as the \"kids\" attend training sessions and continue routine duties. The real crew departs in a small craft, following the trail Murf’s data has revealed."
      },
      {
        "Header": "Act II",
        "Text": "A minor systems glitch aboard Voyager-A interacts with the new holo-matrix, giving the duplicates unexpected degrees of autonomy. Dal’s overconfident hologram begins to improvise, volunteering for extra duties and making bold statements about the mission. Security officers notice that \"Dal\" and the others seem both more competent and strangely mechanical, triggering an internal investigation."
      },
      {
        "Header": "Act III",
        "Text": "As suspicion mounts, the holo-doubles—afraid of being deactivated—start acting out to protect themselves, inadvertently sabotaging shipboard operations. Out on their shuttle, the real crew picks up signs that something is wrong and works with Janeway to remotely shut down the rogue programs without exposing the covert mission. In the aftermath, the kids are forced to confront the uncomfortable question of whether their holographic stand-ins actually performed better than they would have."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard Voyager-A, the warrant officers confess the full story to Janeway, expecting severe punishment. Instead, she gives them a stern lecture about honesty and the dangers of overreliance on holograms—but also acknowledges that their initiative came from a genuine desire to help. The crew quietly reflects on how easily their \"idealized\" selves went off the rails, and how being imperfect, real people might be exactly what Starfleet needs."
      }
    ],
    "EthicalIssues": [
      "Deceiving one’s own shipmates and chain of command using advanced holography.",
      "Creating near-sentient duplicates and then deactivating them when they become inconvenient.",
      "Comparing one’s worth to an idealized version of oneself rather than accepting human (and non-human) limitations."
    ],
    "ContinuityNotes": [
      "Builds on Star Trek’s long history of holographic characters gaining autonomy and agency.",
      "Highlights technological and ethical contrasts between the Protostar-era kids and Voyager’s seasoned crew.",
      "Further explores the warrant officers’ uneasy place in Starfleet hierarchy."
    ],
    "ThematicNotes": [
      "The fear of being \"found out\" as not good enough, even after great achievements.",
      "The dangers of trying to live up to a perfected self-image.",
      "Acknowledging that mistakes and growth are central to genuine heroism."
    ],
    "BehindTheScenes": [
      "Plays with classic Trek holodeck and hologram tropes in a way that is character-specific to the Prodigy crew.",
      "Provides opportunities for the voice actors to portray heightened or twisted versions of their characters.",
      "Balances comedy with deeper questions about identity and belonging, especially for viewers who have felt like imposters themselves."
    ]
  },
  {
    "ID": "pros2e7",
    "Title": "The Fast and the Curious",
    "Series": "PRO",
    "Season": 2,
    "Episode": 7,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "A Kazon warlord and crew",
      "Rival racers from various worlds"
    ],
    "Antagonists": [
      "A ruthless Kazon warlord who controls a deadly starship race",
      "The lure of competition and glory when lives are on the line"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Following Murf’s coordinates toward a spiral nebula, the crew decides to cut across an inactive transwarp conduit to save time. As soon as they enter, they are abruptly pulled out of warp into a chaotic arena of ships clustered around a massive starting gate. A booming broadcast announces the beginning of a high-stakes race—whether they meant to enter or not."
      },
      {
        "Header": "Act I",
        "Text": "A Kazon warlord claims jurisdiction over the conduit and declares that any vessel entering must participate in his lethal race or be destroyed. The prize for victory is safe passage and control codes to the conduit’s stable segments; the cost of failure is annihilation. Dal, thrilled by the idea of proving himself in a real contest, volunteers the crew before fully thinking through the consequences."
      },
      {
        "Header": "Act II",
        "Text": "As the race begins, the Protostar crew (under Janeway’s wary supervision) must navigate treacherous obstacles, booby-trapped waypoints, and aggressive tactics from rival racers. Rok-Tahk and Jankom optimize the engines and shields, Zero tracks complex gravitational shifts, and Gwyn works diplomacy in brief lulls between legs of the race. Dal’s initial showboating nearly gets them eliminated when he prioritizes flashy moves over safe, strategic choices."
      },
      {
        "Header": "Act III",
        "Text": "Realizing that the warlord rigs each competition to ensure his own champion wins, the crew devises a plan to turn the course’s hazards against him. They coordinate with a few desperate rival captains, using synchronized maneuvers to jam the Kazon flagship’s control over the conduit. In a final sprint through collapsing warp tunnels, Dal follows his team’s calmly stated instructions instead of his ego, emerging across the finish line with the codes—and the warlord’s hold—broken."
      },
      {
        "Header": "Tag",
        "Text": "With the conduit freed from Kazon control, the crew shares the safe routes with the other racers instead of hoarding them. Janeway pointedly reminds Dal that winning is meaningless if it costs others their chance at survival. As they re-enter the nebula on a more direct heading toward the Protostar’s last known sector, Dal quietly admits that the best victories are the ones you share."
      }
    ],
    "EthicalIssues": [
      "Being coerced into dangerous competition as a condition of survival.",
      "The morality of sabotaging a corrupt game from within versus refusing to play at all.",
      "Choosing cooperation over individual glory when stakes are life and death."
    ],
    "ContinuityNotes": [
      "Brings the Kazon back into the franchise’s orbit in a new, post-Voyager context.",
      "Expands on the use of transwarp conduits as strategic shortcuts—and dangerous choke points—in the quadrant.",
      "Shows the crew applying lessons learned from earlier episodes to high-speed tactical problem-solving."
    ],
    "ThematicNotes": [
      "Speed versus wisdom, and when slowing down your impulses makes you truly faster.",
      "Solidarity among competitors who recognize a rigged system.",
      "Turning a spectacle of violence into a chance for liberation."
    ],
    "BehindTheScenes": [
      "Provides a kinetic, action-heavy episode that still foregrounds character growth.",
      "Nods playfully to popular racing and heist stories while keeping firmly within Trek motifs.",
      "Offers another opportunity to showcase Prodigy’s dynamic starship animation and sound design."
    ]
  },
  {
    "ID": "pros2e8",
    "Title": "Is There in Beauty No Truth?",
    "Series": "PRO",
    "Season": 2,
    "Episode": 8,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "A collective of non-corporeal beings",
      "Caretakers of a sanctuary for disembodied intelligences"
    ],
    "Antagonists": [
      "The seductive offer of a \"perfect\" new body for Zero",
      "The risk of losing one’s identity while pursuing physical form"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "After a hazardous encounter damages Zero’s containment suit beyond easy repair, the crew is forced to keep their Medusan friend in a jury-rigged field that could fail at any moment. Janeway detects a nearby colony composed of non-corporeal beings who claim they can provide safer refuge—and even a true physical body—for entities like Zero."
      },
      {
        "Header": "Act I",
        "Text": "Arriving at the sanctuary, the crew is welcomed by luminous, shifting beings who communicate through patterns of light and emotion rather than words. They show Zero beautiful examples of consciousnesses who have adopted new physical forms, explaining that they can craft a body tailored to Zero’s desires. The offer is everything Zero has quietly wished for since leaving the Medusan collective: a way to interact with friends without risking harm."
      },
      {
        "Header": "Act II",
        "Text": "Dal and the others are excited for Zero but grow uneasy when they realize the process requires partially rewriting Zero’s mind to integrate it with the new body’s neural lattice. The sanctuary’s caretakers insist that the change is merely an adaptation, not an erasure, and that many former \"drifters\" have embraced it. Zero must decide whether the promise of embodiment is worth potentially losing some of the fluid, non-linear perspective that defines them."
      },
      {
        "Header": "Act III",
        "Text": "As the procedure begins, subtle inconsistencies arise in Zero’s responses, suggesting that the new form is steering their personality toward a more limited, humanoid mindset. Gwyn and Rok-Tahk speak up, reminding Zero of the unique insights their Medusan nature brings, even when it is inconvenient. Zero ultimately halts the transformation, instead working with the beings to repair and upgrade their containment field in a way that preserves who they are."
      },
      {
        "Header": "Tag",
        "Text": "Departing the sanctuary, Zero reflects that their lack of a conventional body has always been both a burden and a gift—and that accepting themselves does not preclude someday exploring safer alternatives. Dal jokes that Zero remains the most beautiful thing on the ship, radiant light field and all. Janeway notes that Starfleet thrives not on uniformity, but on the varied forms of life that choose to explore together."
      }
    ],
    "EthicalIssues": [
      "Altering a person’s mind in the process of granting them a new body.",
      "The line between therapeutic adaptation and coerced conformity.",
      "How much of one’s identity can change before one is no longer the same person."
    ],
    "ContinuityNotes": [
      "Builds directly on what it means to be a Medusan, previously introduced in earlier Star Trek canon and in Prodigy Season 1.",
      "Expands the universe’s portrayal of non-corporeal societies and their approaches to embodiment.",
      "Further explores Zero’s ongoing journey to define themselves outside any single collective or container."
    ],
    "ThematicNotes": [
      "The tension between yearning for physical presence and valuing one’s current form.",
      "The idea that beauty and truth are intertwined in how we see ourselves and others.",
      "Self-acceptance as an ongoing process rather than a single decision."
    ],
    "BehindTheScenes": [
      "Offers a philosophically rich character episode for Zero with striking visual possibilities.",
      "Echoes classic Trek stories about identity, embodiment, and what it means to be human—or beyond human.",
      "Demonstrates Prodigy’s willingness to tackle complex topics like neurodiversity and bodily autonomy in an accessible way."
    ]
  },
  {
    "ID": "pros2e9",
    "Title": "The Devourer of All Things, Part I",
    "Series": "PRO",
    "Season": 2,
    "Episode": 9,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Wesley Crusher",
      "Maj'el",
      "Temporal \"Travelers\"",
      "Starfleet crews at the Time Ziggurat"
    ],
    "Antagonists": [
      "The Loom, monstrous entities that feed on collapsing timelines",
      "The growing instability of the time rift around the Protostar’s trail"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Following the coordinates supplied by the mysterious entity, the crew arrives at a hidden world dominated by an enormous temporal structure known as the Time Ziggurat. Sensors reveal that countless fractured timelines intersect here, and that something vast and hungry is drawing closer through the rift."
      },
      {
        "Header": "Act I",
        "Text": "Inside the Ziggurat, the kids encounter a community of \"Travelers\"—beings dedicated to maintaining the stability of the timeline. Their enigmatic leader is revealed to be Wesley Crusher, who has been subtly guiding the Protostar crew’s actions across time. Wesley explains that their earlier jumps have weakened the fabric of reality, attracting creatures known as the Loom that devour dying timelines."
      },
      {
        "Header": "Act II",
        "Text": "Wesley outlines a risky plan: by retracing the Protostar’s path and stabilizing key nexus points, the crew can repair their unraveling timeline and locate Chakotay in a way that does not doom others. However, activating the Ziggurat’s full capabilities will also broadcast a temporal beacon bright enough to draw the Loom directly to them. Zero and Rok-Tahk eagerly dive into the math and mechanics, while Dal struggles with the weight of yet another reality-threatening mission falling on their shoulders."
      },
      {
        "Header": "Act III",
        "Text": "As the Travelers and the kids work to initiate the repairs, early waves of the Loom manifest as distortions that freeze or age parts of the Ziggurat and surrounding landscape. Maj'el’s telepathic link to Zero makes her acutely aware of the Loom’s predatory, alien consciousness. The first of the creatures finally breaches into their reality, forcing Wesley and the crew to split their efforts between defending the complex and completing the sequence that will open a controlled time vault."
      },
      {
        "Header": "Tag",
        "Text": "Back-to-back crises culminate in the activation of the vault just as the Loom breaks through in full force, its tendrils of un-time whipping around the Ziggurat. Wesley insists that the crew jump through the portal now or risk being erased along with the threatened timelines. With the Loom closing in and Voyager-A arriving in orbit unaware of the danger below, the episode ends on a cliffhanger as the kids leap into the unknown."
      }
    ],
    "EthicalIssues": [
      "The responsibility to repair damage one has done to the timeline even when the attempt invites greater danger.",
      "Enlisting young officers in a cosmic battle to preserve reality itself.",
      "The Travelers’ choice to involve outsiders rather than merely observing and correcting from afar."
    ],
    "ContinuityNotes": [
      "Brings Wesley Crusher back as a fully realized Traveler, following his appearances in Star Trek: The Next Generation and other media.",
      "Defines the Loom as a new type of time-based threat within the Star Trek universe.",
      "Connects the Prodigy crew’s temporal adventures to the wider network of Travelers safeguarding the timeline."
    ],
    "ThematicNotes": [
      "The idea that even well-intended actions can have universe-scale consequences.",
      "Facing the literal embodiment of consequences in the form of the Loom.",
      "Trusting guidance from those who see a bigger picture, while still making your own choices."
    ],
    "BehindTheScenes": [
      "Serves as the first half of a pivotal two-part arc that unites Prodigy’s story with classic Traveler lore.",
      "Expands the visual language of time anomalies with the Ziggurat and the Loom.",
      "Gives Wil Wheaton’s Wesley Crusher a substantial mentor role for a new generation of young heroes."
    ]
  },
  {
    "ID": "pros2e10",
    "Title": "The Devourer of All Things, Part II",
    "Series": "PRO",
    "Season": 2,
    "Episode": 10,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Wesley Crusher"
    ],
    "GuestCharacters": [
      "Maj'el",
      "Admiral Janeway",
      "Tysess",
      "The Loom",
      "Captain Chakotay"
    ],
    "Antagonists": [
      "The Loom, fully manifested and attacking both the Ziggurat and Voyager-A",
      "The risk of being erased from existence while traversing unstable time corridors"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Protigy crew tumbles out of the time vault into a strange \"safe house\" that resembles an old Earth apartment, a temporal bunker constructed by the Travelers. Outside its windows, time storms rage as the Loom tears at nearby timelines. Wesley explains that this is a staging area for the next phase of the plan to repair their reality."
      },
      {
        "Header": "Act I",
        "Text": "Using the bunker’s access to multiple time streams, Wesley walks the crew through the history of their own interference—showing how their choices, both heroic and impulsive, created weak spots in the timeline that the Loom now exploits. Each of them must confront a moment they would like to change, while understanding that growth came from those very mistakes."
      },
      {
        "Header": "Act II",
        "Text": "On the surface of the Time Ziggurat’s world, Voyager-A arrives and sends an away team, unaware that approaching the Loom could erase them from existence. Janeway and the Doctor work to improvise temporal stabilizers, while Maj'el uses her telepathic link to Zero to locate the crew through the chaos. Meanwhile, in the bunker, Wesley calibrates a final jump that will send the kids where they most need to be: to Chakotay, at the point where the repaired timeline can still be saved."
      },
      {
        "Header": "Act III",
        "Text": "The Loom attacks in force, annihilating one of the Travelers and erasing a Starfleet officer from existence so thoroughly that only Janeway and the Doctor sense something is missing. Dal and the others fight their way back to the surface to rescue Maj'el and coordinate with Janeway, using improvised phase-variance weapons to briefly stun the creatures. Wesley opens the targeted portal as Voyager-A comes under direct assault, forcing Janeway to trust the Travelers’ plan and let the kids go."
      },
      {
        "Header": "Tag",
        "Text": "The portal deposits Dal, Gwyn, Zero, Rok-Tahk, Jankom, Murf, and Maj'el on a desolate sandy world where a rusted Protostar and an older, battle-worn Chakotay await them. Janeway finds herself back aboard Voyager-A with only fragmentary memories of how the confrontation ended, realizing that she has lost something—and someone—important to the timestream. As the mid-season arc closes, the crew stands face-to-face with the captain they have sought for so long, while the shadow of the Loom and the repaired timeline still loom large."
      }
    ],
    "EthicalIssues": [
      "Allowing dangerous missions that may erase individuals from existence for the greater good.",
      "What it means to accept one’s past mistakes when given the power to rewrite them.",
      "Trusting entities like the Travelers to make decisions about who and what survives in the timeline."
    ],
    "ContinuityNotes": [
      "Continues and concludes the two-part \"Devourer of All Things\" arc begun in Episode 9.",
      "Brings the crew directly to Chakotay and a future Protostar, setting up the season’s back half.",
      "Further integrates Wesley’s role as a Traveler with the ongoing narrative of Prodigy and the larger Trek universe."
    ],
    "ThematicNotes": [
      "The inevitability of imperfection in any life story, even one woven through time.",
      "Facing beings that literally consume history and refusing to let them define your future.",
      "Reunion and responsibility as the crew finally reaches their long-sought mentor under dire circumstances."
    ],
    "BehindTheScenes": [
      "Acts as a mid-season climax, tying together temporal threads from across both seasons of Prodigy.",
      "Uses high-concept visuals of time storms and the Loom to deliver a cosmic-scale threat.",
      "Gives closure to the initial Traveler arc while opening the door to Chakotay’s story and the final stretch of the series."
    ]
  },
  {
    "ID": "pros2e11",
    "Title": "Last Flight of the Protostar, Part I",
    "Series": "PRO",
    "Season": 2,
    "Episode": 11,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Captain Chakotay"
    ],
    "GuestCharacters": [
      "Adreek-Hu",
      "Ysidan scavengers",
      "Giant eel-like predators"
    ],
    "Antagonists": [
      "The harsh environment of Ysida",
      "Chakotay's grief and survivor's guilt"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The cadets emerge from their temporal jump onto a windswept desert world and are stunned to find the long-lost USS Protostar half-buried in sand. Inside, the ship is running on emergency power and guarded by a weary, older Chakotay who has clearly been stranded for years."
      },
      {
        "Header": "Act I",
        "Text": "Hologram Janeway fills in the missing years: to keep the living construct from spreading, Chakotay jettisoned both the antimatter and proto-core, marooning the Protostar on Ysida. The loss of his crew, and especially his first officer Adreek-Hu, has left him broken and unwilling to risk the ship again. Dal and the others try to rally him with tales of their adventures, but he dismisses them as kids chasing legends."
      },
      {
        "Header": "Act II",
        "Text": "When a vicious storm sweeps over the wreck site, Dal heads out alone to prove the planet can still be explored safely and vanishes into the maelstrom. The crisis finally snaps Chakotay out of his apathy; he leads a search party through treacherous canyons and sinkholes, reliving the guilt of losing his previous crew with every step. The cadets see flashes of the captain he used to be beneath the trauma."
      },
      {
        "Header": "Act III",
        "Text": "Deep underground, the team finds Dal alive in a cavern riddled with crystalline antimatter deposits—Adreek’s last discovery before he died. Confronted with the proof that his first officer died trying to give him a second chance, Chakotay agrees that hiding on Ysida is no longer an option. Together, they begin harvesting antimatter to refuel the Protostar, preparing for one last flight."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard the battered ship, Chakotay quietly reinstalls his captain’s pips and takes a seat on the bridge for the first time in a decade. Dal slides into the chair beside him, more humbled than starstruck, as the lights of the Protostar glow a little brighter. With both captain and crew finally reunited, the promise of leaving Ysida no longer feels like a fantasy."
      }
    ],
    "EthicalIssues": [
      "Whether a traumatized commander should be expected to resume duty in a crisis.",
      "Risking young warrant officers on a mission centered around restoring a weaponized starship.",
      "Balancing one man’s grief against the needs of an entire damaged timeline."
    ],
    "ContinuityNotes": [
      "Reveals what happened to Chakotay and the Protostar after the captain’s message from the future in Season 1.",
      "Introduces Ysida as the world where the Protostar has been stranded for ten years.",
      "Confirms Adreek-Hu’s fate and his importance to Chakotay’s long exile."
    ],
    "ThematicNotes": [
      "Clawing back from despair after years of isolation and loss.",
      "The way found family can rekindle a leader’s sense of purpose.",
      "Accepting help from a younger generation when you feel you have failed your own."
    ],
    "BehindTheScenes": [
      "Gives viewers the long-awaited reunion between the Protostar crew and Captain Chakotay.",
      "Shifts the season’s focus from searching for Chakotay to convincing him to fly again.",
      "Uses the desolate setting of Ysida to mirror Chakotay’s emotional state."
    ]
  },
  {
    "ID": "pros2e12",
    "Title": "Last Flight of the Protostar, Part II",
    "Series": "PRO",
    "Season": 2,
    "Episode": 12,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Hologram Janeway",
      "Captain Chakotay"
    ],
    "GuestCharacters": [
      "Adreek-Hu (flashbacks)",
      "Ysidan storm creatures"
    ],
    "Antagonists": [
      "A violent vapor ocean and deuterium maelstrom",
      "Dal and Chakotay’s clashing ideas of command"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With antimatter restored, Chakotay identifies the Protostar’s last missing piece: deuterium trapped in a raging maelstrom across a vast vapor ocean. There is no safe way to fly there—unless they turn the starship into something Starfleet never intended."
      },
      {
        "Header": "Act I",
        "Text": "Jankom and Rok jury-rig sails and stabilizers so the powerless Protostar can literally ride atmospheric currents across the ocean. The cadets are thrilled by the bizarre workaround, but Chakotay insists on tight discipline, clashing with Dal’s improvisational style. Old wounds and new insecurities surface as Dal questions his worth after glimpsing a future he may not like."
      },
      {
        "Header": "Act II",
        "Text": "As the makeshift ship battles colossal waves and storm funnels, Chakotay is swept overboard and nearly lost beneath the clouds. Dal, forced to stop second-guessing himself, orchestrates a daring rescue that draws on everything he learned as captain of the Protostar. The experience forces both of them to acknowledge that leadership means trusting others as much as yourself."
      },
      {
        "Header": "Act III",
        "Text": "The crew finally reaches the deuterium maelstrom and uses carefully timed tractor beams and improvised collectors to siphon what they need. With power restored first to impulse and then to warp, the Protostar sheds its sails and rises out of the clouds like its old self. Chakotay and Dal share the conn as the ship breaks orbit, leaving Ysida behind at last."
      },
      {
        "Header": "Tag",
        "Text": "Hologram Janeway calculates that Voyager is more than 3,000 light-years away, far beyond a single warp hop. The only way to reunite the ships will be to build an entirely new proto-core—something no one has attempted since the original Protostar project. The episode closes with the crew setting a course toward that impossible goal, a real captain finally at their side."
      }
    ],
    "EthicalIssues": [
      "Risking an entire ship and crew on an untested, improvised sailing scheme.",
      "The expectations placed on Dal after seeing a possible future for himself.",
      "Chakotay’s responsibility to mentor a younger captain rather than simply command over him."
    ],
    "ContinuityNotes": [
      "Completes the \"Last Flight of the Protostar\" two-parter and fully restores the ship to spaceworthiness.",
      "Explains how the Protostar can rejoin Voyager despite the huge distance between them.",
      "Continues Dal’s arc of reconciling his past captaincy with his new role under Chakotay."
    ],
    "ThematicNotes": [
      "Two generations of captains learning to share the bridge.",
      "Turning a desperate situation into an opportunity for creativity and bonding.",
      "Finding a path forward when your future feels prewritten."
    ],
    "BehindTheScenes": [
      "Blends nautical imagery with starship adventure by literally sailing a Federation vessel.",
      "Provides substantial character material for both Dal and Chakotay.",
      "Sets up the technical challenge of building a new proto-core as the next phase of the season."
    ]
  },
  {
    "ID": "pros2e13",
    "Title": "A Tribble Called Quest",
    "Series": "PRO",
    "Season": 2,
    "Episode": 13,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Captain Chakotay"
    ],
    "GuestCharacters": [
      "Klingon scientist Kathon",
      "Genetically modified giant tribbles",
      "Bribble (tribble–bristleback hybrid)"
    ],
    "Antagonists": [
      "Runaway genetic experiments that turned tribbles into massive predators",
      "Zero’s deteriorating corporeal body"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Protostar tracks a rare mineral called bosonite to a supposedly abandoned research world—only to find it overrun by enormous, rolling tribbles that devour everything in their path. Their only hope of reaching the ore lies with the scientist who created the disaster."
      },
      {
        "Header": "Act I",
        "Text": "Rok-Tahk befriends Kathon, a Klingon geneticist whose well-meant experiments to help her people ended in catastrophe. Together they work out how to reverse the tribbles’ gigantism without killing them, even as the crew is chased and cornered by furry avalanches. During the chaos, Zero suffers a serious injury that reveals their containment body is starting to fail for good."
      },
      {
        "Header": "Act II",
        "Text": "Rok refines a counter-agent that should restore the tribbles to something close to their original state, but the process has unpredictable side effects. Testing it triggers the creation of a single oddball hybrid—part tribble, part reptilian pest—that imprints on Rok and refuses to leave her side. Despite the setback, the treatment begins to shrink the rest of the herd, saving the planet from ecological collapse."
      },
      {
        "Header": "Act III",
        "Text": "With the tribble crisis under control, the crew is finally able to mine the bosonite needed for a new proto-core. Zero, still shaken by how close they came to permanent injury, quietly confides in the Doctor about their failing body. Rok, now trailed by her newly adopted \"bribble,\" promises to keep working on solutions that help both Zero and the wider galaxy."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard ship, Jankom grumbles about cleaning tribble fluff out of every system while the others coo over Rok’s new pet. Chakotay updates their mission log: one step closer to a working proto-core, and one more reminder that scientific curiosity cuts both ways. Zero stares at the stars outside, wondering how much time their current form truly has left."
      }
    ],
    "EthicalIssues": [
      "The dangers of genetic engineering intended to solve one problem but creating another.",
      "Responsibilities scientists bear for unintended consequences of their work.",
      "Zero’s struggle with bodily autonomy as their physical form begins to fail."
    ],
    "ContinuityNotes": [
      "Revisits tribbles with a twist, connecting Prodigy to one of Star Trek’s most famous species.",
      "Introduces bosonite as a key component in building a new proto-core.",
      "Foreshadows Zero’s later transformation and suit upgrades."
    ],
    "ThematicNotes": [
      "Owning mistakes without letting them define you forever.",
      "Balancing scientific ambition with compassion for living subjects.",
      "Found family extending even to odd little hybrid creatures."
    ],
    "BehindTheScenes": [
      "Offers a comedic yet heartfelt spin on tribbles for a new generation of viewers.",
      "Gives Rok-Tahk another chance to shine as a scientist and caretaker.",
      "Deepens the ongoing storyline about Zero’s fragile corporeal existence."
    ]
  },
  {
    "ID": "pros2e14",
    "Title": "Cracked Mirror",
    "Series": "PRO",
    "Season": 2,
    "Episode": 14,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Captain Chakotay",
      "Admiral Janeway"
    ],
    "GuestCharacters": [
      "Tuvix (alternate reality captain)",
      "Mirror Janeway",
      "Mirror Chakotay",
      "Crew of multiple alternate Voyagers"
    ],
    "Antagonists": [
      "A shattered multiverse of alternate Voyagers and timelines",
      "The risk of the Loom exploiting new tears in reality"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The newly rebuilt proto-core carries the Protostar to Voyager’s last reported position—but instead of a smooth arrival, the jump rips open weakened spacetime. Both ships are scattered across a patchwork of alternate realities where familiar faces have very different histories."
      },
      {
        "Header": "Act I",
        "Text": "Rok and Zero find themselves aboard a Voyager commanded by Tuvix, a composite of Tuvok and Neelix who never chose between his halves. Elsewhere, Dal, Gwyn, Jankom and Murf land on a Voyager from a universe where the Federation fell to the living construct. Each reality shows them a different version of what might have been if key choices had gone another way."
      },
      {
        "Header": "Act II",
        "Text": "An attempt to regroup flings most of the team—and Chakotay—into the Mirror Universe, where they confront ruthless versions of Janeway and her crew. Maj'el is accidentally left behind in the prime reality and must work with Hologram Janeway and the Doctor to track the others through fluctuating quantum signatures. In the Mirror Universe, the cadets must convince an adversarial Janeway that the Loom threatens both their realities."
      },
      {
        "Header": "Act III",
        "Text": "Realizing the rift will eventually tear all their Voyagers apart, Mirror Janeway reluctantly agrees to help. Using her ship’s agonizer-enhanced deflectors, she and the kids generate a multiversal pulse that knits the fractured timelines back together. The Protostar and the \"true\" Voyager finally re-align—though not before everyone has seen unsettling glimpses of lives they might have led."
      },
      {
        "Header": "Tag",
        "Text": "On the restored prime Voyager, Chakotay and Janeway are reunited at last, sharing a brief but emotional reunion on the bridge. The cadets, shaken by how fragile reality has become, vow to tread more carefully with the proto-core. Zero quietly notes that if one bad jump can splinter the universe, they must make every remaining jump count."
      }
    ],
    "EthicalIssues": [
      "Interfering with alternate realities, even in the name of saving one’s own.",
      "Whether it is right to close a rift that might erase other versions of people who clearly exist and feel.",
      "Using the brutal tools of the Mirror Universe for ostensibly noble ends."
    ],
    "ContinuityNotes": [
      "Features the return of the Mirror Universe and a new take on Tuvix that references Voyager’s controversial episode.",
      "Shows the growing strain on the fabric of reality from repeated proto-core and temporal jumps.",
      "Reunites Chakotay and Janeway, a major promise from early in the series."
    ],
    "ThematicNotes": [
      "Confronting the roads not taken—and the ones you are glad you avoided.",
      "Seeing yourself in darker mirrors and choosing who you want to be.",
      "The idea that every reality matters, even when you can only live in one."
    ],
    "BehindTheScenes": [
      "Celebrates Star Trek’s long history with mirror universes and alternate timelines.",
      "Gives fans a playful but thoughtful look at different outcomes for Voyager’s crew.",
      "Serves as a turning point where the scale of the Loom’s threat becomes undeniable."
    ]
  },
  {
    "ID": "pros2e15",
    "Title": "Ascension, Part I",
    "Series": "PRO",
    "Season": 2,
    "Episode": 15,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Captain Chakotay",
      "Admiral Janeway",
      "The Doctor"
    ],
    "GuestCharacters": [
      "Ilthuran",
      "Admiral Jellico",
      "Nova Squadron pilots",
      "Asencia",
      "Crew of the Rev-1"
    ],
    "Antagonists": [
      "Asencia’s renewed crusade against Federation and Solum alike",
      "Admiral Jellico’s cautious orders that threaten to shut the mission down",
      "A looming temporal war centered on Solum"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "Back aboard Voyager, the crew finally has a moment to breathe—until The Doctor confirms that Zero’s corporeal body is failing beyond repair. At the same time, Admiral Jellico orders both ships to return to Earth so Starfleet can seize control of the temporal crisis."
      },
      {
        "Header": "Act I",
        "Text": "The Doctor proposes upgrading Zero’s next containment suit with sensory inputs so they can still feel the world, even without a traditional body. Zero asks Jankom to help, giving the Tellarite a rare chance to apply his engineering genius to a friend instead of a warp core. Their quiet project unfolds against a backdrop of tension as Janeway fumes over being pulled off the front lines."
      },
      {
        "Header": "Act II",
        "Text": "Ilthuran secretly contacts Gwyn with terrible news: Asencia has seized control of Solum using advanced temporal weaponry, and the Rev-1 is en route to destroy Voyager and the Protostar. Janeway and Chakotay debate whether they can afford to defy Jellico’s orders when the fate of two civilizations hangs in the balance. In the end, they choose to stand their ground, scrambling both ships for battle."
      },
      {
        "Header": "Act III",
        "Text": "Dal joins Nova Squadron in the skies while the rest of the cadets hurry back to the Protostar to help Chakotay. The Rev-1’s weapons tear through their defenses, leaving Voyager dangerously exposed and the Protostar badly damaged. As Asencia closes in, it becomes clear that this fight will decide who controls the future of both the Federation and Solum."
      },
      {
        "Header": "Tag",
        "Text": "On the bridge, Janeway stares at a tactical display that grows more dire by the second as the Rev-1 moves into killing range. Zero, still in their failing body, quietly asks The Doctor to make sure their sacrifice means something if the worst happens. The episode ends with Voyager’s shields collapsing under a barrage of temporal fire."
      }
    ],
    "EthicalIssues": [
      "Defying direct orders from Starfleet Command when lives and timelines are at stake.",
      "Sending cadets into a battle involving weapons that can erase people from history.",
      "Zero’s acceptance of their failing body and their right to choose how they face the end."
    ],
    "ContinuityNotes": [
      "Brings Asencia back to center stage as the primary antagonist, now wielding new temporal technology.",
      "Shows Admiral Jellico again as a foil to Janeway’s more daring style of command.",
      "Sets up the climactic Solum storyline that will carry through the rest of the season."
    ],
    "ThematicNotes": [
      "Coming to terms with mortality in a universe that keeps rewriting time.",
      "When following orders conflicts with doing what’s right.",
      "How upgrades and change can be acts of love, not just necessity."
    ],
    "BehindTheScenes": [
      "Begins the multi-part finale arc that will close out both the temporal storyline and the Solum conflict.",
      "Gives Zero and Jankom a poignant shared subplot amid a large-scale battle.",
      "Puts Janeway back in familiar territory: challenging Starfleet when she believes the stakes justify it."
    ]
  },
  {
    "ID": "pros2e16",
    "Title": "Ascension, Part II",
    "Series": "PRO",
    "Season": 2,
    "Episode": 16,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Captain Chakotay",
      "Admiral Janeway",
      "The Doctor"
    ],
    "GuestCharacters": [
      "Ilthuran",
      "Asencia",
      "Nova Squadron pilots",
      "Department of Temporal Investigations personnel"
    ],
    "Antagonists": [
      "The Rev-1 armed with the temporal \"Incursor\" weapon",
      "Asencia’s campaign to prove Starfleet cannot protect the quadrant"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "The Rev-1 cripples the Protostar and strikes Voyager with the Incursor, a temporal weapon that accelerates the ship’s aging toward dust. Hull plates corrode before the crew’s eyes as entire decks threaten to crumble into nothing."
      },
      {
        "Header": "Act I",
        "Text": "Zero realizes that the Incursor can be redirected—if someone is willing to stand at the heart of its temporal blast. Knowing their body is failing anyway, they volunteer for a desperate maneuver, asking Jankom and The Doctor to trust their calculations. Dal and Nova Squadron, meanwhile, struggle to hold off the Rev-1 long enough for any plan to matter."
      },
      {
        "Header": "Act II",
        "Text": "Zero steps into the path of the weapon and uses their unique perception of time to twist the Incursor’s target from Voyager to Maj'el’s fighter, turning her ship into a lure. Maj'el leads the Rev-1 on a chase straight toward a volatile nebula nicknamed the \"Boothby Supernova.\" The maneuver shreds Zero’s corporeal form, but the crew refuses to accept that as the end of their story."
      },
      {
        "Header": "Act III",
        "Text": "The pursuing Rev-1 is caught in the supernova’s blast, and the redirected Incursor causes its own temporal weapons to rip the ship apart. In the quiet after the battle, Zero reveals a new containment suit Jankom built using The Doctor’s design—their consciousness saved in time. Starfleet orders both Voyager and the Protostar to head for Solum, making the coming confrontation official business."
      },
      {
        "Header": "Tag",
        "Text": "In a hidden chamber, Asencia is revealed to have Wesley Crusher chained to a temporal harness, his Traveler abilities exploited to design the very weapons that nearly destroyed the fleet. She calmly observes that Starfleet’s stretched defenses have proven her point—and that the real war is just beginning."
      }
    ],
    "EthicalIssues": [
      "Accepting one person’s self-sacrifice as the linchpin of a battle plan.",
      "Weaponizing stolen knowledge from a captured Traveler.",
      "Using temporal weapons that can undo lives rather than simply end them."
    ],
    "ContinuityNotes": [
      "Concludes the \"Ascension\" arc and transitions from defensive battles to an offensive mission toward Solum.",
      "Gives Zero their upgraded containment suit that will define their look going forward.",
      "Reveals how Asencia acquired her advanced temporal arsenal—by exploiting Wesley Crusher."
    ],
    "ThematicNotes": [
      "Sacrifice as a bridge between who you were and who you become.",
      "Surviving a brush with non-existence and coming back changed but still yourself.",
      "The danger of using extraordinary gifts—like Traveler powers—for conquest instead of exploration."
    ],
    "BehindTheScenes": [
      "Delivers one of the season’s most intense ship-to-ship battles and emotional character beats.",
      "Provides a major showcase for Zero’s heroism and Jankom’s craftsmanship.",
      "Further ties Prodigy into wider Trek lore through the fate of Wesley and the introduction of temporal super-weapons."
    ]
  },
  {
    "ID": "pros2e17",
    "Title": "Brink",
    "Series": "PRO",
    "Season": 2,
    "Episode": 17,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Admiral Janeway",
      "Captain Chakotay",
      "Wesley Crusher"
    ],
    "GuestCharacters": [
      "Ilthuran",
      "Younger Asencia",
      "Vau N'Akat rebels and loyalists"
    ],
    "Antagonists": [
      "Asencia’s regime on Solum backed by temporal weaponry",
      "The escalating risk of open war between the Federation and the Vau N'Akat"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With tensions between the Federation and the Vau N'Akat ready to explode, Solum becomes the flashpoint for a possible interstellar war. Janeway cannot send Starfleet officers behind enemy lines without inflaming the situation—so Gwyn proposes using the Protostar crew instead."
      },
      {
        "Header": "Act I",
        "Text": "Because the cadets are not commissioned Starfleet personnel, Janeway authorizes them to infiltrate Solum as deniable assets. Maj'el resigns from Nova Squadron to join them, following her instincts rather than her orders. Their mission: rescue Gwyn’s father and uncover how Asencia is powering her impossible new weapons."
      },
      {
        "Header": "Act II",
        "Text": "On Solum, the team encounters a younger version of Asencia who has joined the rebellion against her future self. She reveals that Wesley Crusher is the source of Asencia’s technology, his Traveler knowledge twisted into blueprints for paradox-inducing arms. Gwyn splits the team, sending some to liberate her father while others hunt for Wesley."
      },
      {
        "Header": "Act III",
        "Text": "Wesley, once found, drops a bombshell: in the timeline he remembers, Ilthuran never should have been rescued and was meant to return to foment the very rebellion now unfolding. He allowed himself to be captured specifically so Asencia would build the devices they now need to untangle the paradox around Tars Lamora. Realizing they have already changed history, the crew improvises a new plan that centers on getting Wesley and Ilthuran safely off-world."
      },
      {
        "Header": "Tag",
        "Text": "Dal uses a risky transporter maneuver to beam Wesley and Ilthuran directly back to Voyager, snatching them from Asencia’s grasp. On the bridge, Wesley warns Janeway that even Travelers cannot see past the branching futures now in play. The episode ends on the unsettling note that everyone—Travelers included—is flying blind."
      }
    ],
    "EthicalIssues": [
      "Sending non-Starfleet adolescents into a war zone as \"plausibly deniable\" agents.",
      "Accepting that a \"correct\" timeline involved leaving an ally to suffer to trigger a rebellion.",
      "Wesley’s choice to be captured and exploited for the sake of a larger temporal strategy."
    ],
    "ContinuityNotes": [
      "Deepens the history of Solum and the Vau N'Akat civil conflict.",
      "Clarifies Wesley’s long-game involvement in the season’s events.",
      "Shows younger Asencia at odds with the tyrant she will one day become."
    ],
    "ThematicNotes": [
      "Standing on the brink of war and choosing whether to step back or leap forward.",
      "The uneasy truth that some rebellions are born from terrible sacrifices.",
      "How even those who see time differently can be surprised by the future."
    ],
    "BehindTheScenes": [
      "Builds toward the season’s final confrontation on Solum.",
      "Allows Gwyn to take a more active strategic role in shaping her world’s fate.",
      "Uses Wesley as a bridge between the logic of Travelers and the messy realities on the ground."
    ]
  },
  {
    "ID": "pros2e18",
    "Title": "Touch of Grey",
    "Series": "PRO",
    "Season": 2,
    "Episode": 18,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Admiral Janeway",
      "Captain Chakotay",
      "The Doctor",
      "Wesley Crusher"
    ],
    "GuestCharacters": [
      "Asencia",
      "Ilthuran",
      "Captured Loom entity",
      "Vau N'Akat civilians"
    ],
    "Antagonists": [
      "Asencia’s attempt to weaponize the Loom against her enemies",
      "The chaos of a civil war erupting on Solum"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "A badly injured Wesley recuperates in Voyager’s sickbay, his Traveler abilities offline after prolonged abuse. He grapples with the unsettling prospect of being \"just\" a Starfleet officer again while the universe still needs saving."
      },
      {
        "Header": "Act I",
        "Text": "Janeway reminds Wesley that before he became something more, he was already someone she trusted on the Enterprise. Inspired, Wesley joins Janeway, Chakotay, and The Doctor on a daring mission to rescue the Protostar crew, who have been captured on Solum and slated to be fed to a Loom that Asencia has trapped and twisted into a weapon."
      },
      {
        "Header": "Act II",
        "Text": "Deep within Asencia’s stronghold, the kids are forced to confront the Loom’s horrifying presence as it hungrily probes the edges of their reality. Janeway’s strike team fights through temporal distortions and collapsing corridors to reach them, relying on Wesley’s knowledge even without his powers. A precisely timed assault frees both the cadets and the Loom itself, breaking Asencia’s control."
      },
      {
        "Header": "Act III",
        "Text": "Ilthuran seizes the moment to rouse his people against Asencia’s rule, sparking open rebellion across Solum. Civil war erupts almost instantly, with temporal weapons lighting up the skies. Remembering what it felt like to be underestimated early in her career, Janeway decides she cannot sit this fight out simply because of the Prime Directive."
      },
      {
        "Header": "Tag",
        "Text": "Back aboard Voyager, Janeway tells her crew that sometimes the \"grey\" areas of Starfleet law are exactly where their duty lies. She commits to helping save Solum even if it means bending the rules, echoing the choices of her own mentors. Wesley looks out at the embattled world below, accepting that heroism does not depend on cosmic powers."
      }
    ],
    "EthicalIssues": [
      "Intervening in a civil war despite the Prime Directive’s prohibitions.",
      "The morality of trying to weaponize a sentient, extra-dimensional being like the Loom.",
      "What Starfleet owes to worlds whose futures it has already altered."
    ],
    "ContinuityNotes": [
      "Escalates the Solum storyline into full-scale civil war.",
      "Shows Janeway explicitly choosing intervention in a way that echoes past captains’ toughest decisions.",
      "Further rehabilitates Wesley’s role as a Starfleet problem solver independent of his Traveler status."
    ],
    "ThematicNotes": [
      "Accepting that experience and age bring their own strengths to the table.",
      "The \"grey\" spaces where rules and morality do not perfectly align.",
      "Liberating others while ensuring you do not become what you are fighting."
    ],
    "BehindTheScenes": [
      "Pairs classic Trek questions about the Prime Directive with a very modern, serialized conflict.",
      "Gives Janeway, Chakotay, The Doctor, and Wesley a rare team-up on a rescue mission.",
      "Continues to develop the Loom from a simple threat into a complex presence in the story."
    ]
  },
  {
    "ID": "pros2e19",
    "Title": "Ouroboros, Part I",
    "Series": "PRO",
    "Season": 2,
    "Episode": 19,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Ilthuran",
      "Admiral Janeway",
      "Captain Chakotay",
      "Wesley Crusher"
    ],
    "GuestCharacters": [
      "Asencia",
      "Drednok",
      "Vau N'Akat rebels and loyalists",
      "Starfleet crews aboard Voyager and Protostar"
    ],
    "Antagonists": [
      "Asencia’s fleet of temporally armed warships",
      "The Loom, drawn to the growing web of rifts"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With her hold on Solum slipping, Asencia gambles everything on a final gambit: a fleet of ships equipped with temporal weapons aimed at major Federation targets across known space. Voyager and the Protostar form a thin defensive line between the armada and the rest of the galaxy."
      },
      {
        "Header": "Act I",
        "Text": "Janeway and Chakotay lead the Starfleet elements in space, buying time with daring maneuvers and carefully chosen targets. Meanwhile, Wesley, Rok-Tahk, Zero, and Maj'el hunker down in a makeshift lab, racing to calculate a stable wormhole back to Tars Lamora—the key to resolving the original paradox. Their work is complicated by the constant tremors of temporal shockwaves rippling through the system."
      },
      {
        "Header": "Act II",
        "Text": "Dal, Gwyn, Jankom, Murf, and Ilthuran beam to Solum to infiltrate Asencia’s stronghold and seize the source of her temporal tech. Gwyn confronts her older counterpart amid the chaos of the civil war, each accusing the other of betraying their people in different ways. As the fight spills into the streets, ordinary Vau N'Akat begin to choose sides."
      },
      {
        "Header": "Act III",
        "Text": "In a climactic duel, Gwyn manages to defeat Asencia with the unexpected help of Vau N'Akat citizens who lend their support, physically and symbolically. Murf destroys Asencia’s Drednok, depriving her of her most fearsome enforcer. Using stolen technology, Dal and Jankom tear open the wormhole to Tars Lamora, collapsing the open rifts onto Asencia’s fleet and saving the Federation—at least for the moment."
      },
      {
        "Header": "Tag",
        "Text": "As the fleet vanishes, a new threat emerges: the Loom pour out of the wormhole in vast numbers, drawn by the collapsing timelines like predators to wounded prey. Their presence threatens not just Solum or the Federation, but reality itself. Janeway realizes that closing the loop will require the Protostar to face its origin one last time."
      }
    ],
    "EthicalIssues": [
      "Using temporal collapses as a weapon, even against an enemy bent on mass destruction.",
      "Encouraging a population to overthrow its rulers when Starfleet partly caused the crisis.",
      "Gwyn’s willingness to fight—and potentially kill—another version of herself for the greater good."
    ],
    "ContinuityNotes": [
      "Begins the two-part series finale that ties together the Loom, Tars Lamora, and Solum storylines.",
      "Explains how the wormhole back to Tars Lamora is finally opened in a controlled way.",
      "Marks the apparent defeat of Asencia’s fleet even as a bigger danger appears."
    ],
    "ThematicNotes": [
      "The ouroboros image of a snake eating its tail, as actions circle back to their beginnings.",
      "Revolutions powered not just by weapons, but by ordinary people taking a stand.",
      "The idea that stopping one apocalypse can inadvertently invite another."
    ],
    "BehindTheScenes": [
      "Kicks off a finale that must resolve both a temporal paradox and a planetary civil war.",
      "Gives Gwyn her long-awaited confrontation with Asencia.",
      "Shows Murf once again playing a crucial, unexpectedly destructive role in saving the day."
    ]
  },
  {
    "ID": "pros2e20",
    "Title": "Ouroboros, Part II",
    "Series": "PRO",
    "Season": 2,
    "Episode": 20,
    "KeyCharacters": [
      "Dal R'El",
      "Gwyn",
      "Rok-Tahk",
      "Zero",
      "Jankom Pog",
      "Murf",
      "Maj'el",
      "Ilthuran",
      "Admiral Janeway",
      "Captain Chakotay",
      "The Doctor",
      "Wesley Crusher",
      "Hologram Janeway"
    ],
    "GuestCharacters": [
      "Vau N'Akat leaders",
      "Starfleet Academy instructors",
      "Beverly Crusher",
      "Jack Crusher"
    ],
    "Antagonists": [
      "The Loom swarm threatening to consume reality",
      "The lingering scars of the Mars attack on First Contact Day"
    ],
    "StorySections": [
      {
        "Header": "Teaser",
        "Text": "With the Loom flooding through the wormhole, Voyager and the Protostar have one last chance to tie off the paradox at its origin point: Tars Lamora. Janeway orders a daring plan—send the Protostar into the heart of the storm, guarded by Voyager to the last."
      },
      {
        "Header": "Act I",
        "Text": "The Doctor backs up Hologram Janeway’s program so Chakotay can carry her forward if the worst happens. The Protostar plunges into the wormhole, fighting through temporal turbulence until it lands once again on Tars Lamora at the critical moment that began the entire saga. By replaying events with new understanding, the crew manages to close the loop in a way that sends the Loom back to their own dimension."
      },
      {
        "Header": "Act II",
        "Text": "In the aftermath, Janeway leads an official first contact mission with the Vau N'Akat, finally meeting them not as enemies or future tyrants but as partners. Wesley tells Dal that the universe still has plans that require the crew to stay together, hinting at adventures beyond even Traveler sight. He visits his mother Beverly and brother Jack, grounding his cosmic journey in family once more."
      },
      {
        "Header": "Act III",
        "Text": "Time jumps forward: the kids enroll at Starfleet Academy, trading stolen starships for crowded lecture halls. On First Contact Day, however, the Mars attack shakes the Federation to its core, echoing events seen in Star Trek: Picard. Janeway is pulled out of retirement and tasked with turning a new Protostar-class USS Prodigy into a training ship for the group, complete with field promotions to ensign."
      },
      {
        "Header": "Tag",
        "Text": "Dal relinquishes the captain’s chair to Gwyn, choosing to serve as her first officer as they step onto the bridge of the USS Prodigy for the first time. Hologram Janeway, now upgraded as an Emergency Command Hologram, welcomes them aboard with a familiar twinkle. The series closes on the image of the young officers at their stations, ready to face \"wondrous and terrible\" things yet to come."
      }
    ],
    "EthicalIssues": [
      "Launching a starship into a temporal singularity with a crew of recent cadets to save all of reality.",
      "Balancing the need to correct a paradox against the lives and histories already shaped by it.",
      "Starfleet’s decision to put traumatised young heroes back in the line of fire after the Mars attack."
    ],
    "ContinuityNotes": [
      "Closes the loop on the Tars Lamora paradox introduced in Season 1.",
      "Directly ties Prodigy into the events surrounding the Mars synth attack referenced in Star Trek: Picard.",
      "Establishes the USS Prodigy and the cadets’ new status as ensigns, setting the stage for potential future stories."
    ],
    "ThematicNotes": [
      "Endings that are also beginnings, symbolized by the ouroboros imagery.",
      "The idea that chosen family can become the core of a new Starfleet crew.",
      "Accepting that the future will hold both wonder and pain, and choosing to face it anyway."
    ],
    "BehindTheScenes": [
      "Serves as the capstone for Prodigy’s two-season arc while leaving the door open for new adventures.",
      "Weaves together threads from across the modern Star Trek timeline, including connections to Picard.",
      "Gives each member of the Protostar crew a clear starting point for the next chapter of their lives in Starfleet."
    ]
  }
]